Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: Export tags to a file
it: Esportare tag in un file
ru: Экспорт тегов в файл
sv: Exportera taggar till en fil

source: <funcdef>boolean <function>exportToFile</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>path</parameter></paramdef> <paramdef>int32 <parameter>fmtIdx</parameter></paramdef>
it: <funcdef>boolean <function>exportToFile</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>percorso</parameter></paramdef> <paramdef>int32 <parameter>fmtIdx</parameter></paramdef>

source: Create a playlist
it: Creare una scaletta
ru: Создание нового списка воспроизведения
sv: Skapa en spellista

source: Get items of a playlist
it: Ottenere gli elementi di una scaletta
ru: Получение элементов списка воспроизведения
sv: Hämta objekt i en spellista

source: <funcdef>array <function>getPlaylistItems</function></funcdef> <paramdef>string <parameter>path</parameter></paramdef>
it: <funcdef>array <function>getPlaylistItems</function></funcdef> <paramdef>string <parameter>percorso</parameter></paramdef>

source: path to playlist file
it: percorso al file della scaletta
ru: путь к файлу списка воспроизведения
sv: sökväg till spellistefil

source: Returns list of absolute paths to playlist items.
it: Restituisce un elenco di percorsi assoluti agli elementi della scaletta.
ru: Возвращает список абсолютных путей к элементам списка воспроизведения.
sv: Returerar en lista över absoluta sökvägar till objekt i spellistan.

source: Set items of a playlist
it: Impostare gli elementi di una scaletta
ru: Установка элементов списка воспроизведения
sv: Tilldela objekten i en spellista

source: <funcdef>boolean <function>setPlaylistItems</function></funcdef> <paramdef>string <parameter>path</parameter></paramdef> <paramdef>array <parameter>items</parameter></paramdef>
it: <funcdef>boolean <function>setPlaylistItems</function></funcdef> <paramdef>string <parameter>percorso</parameter></paramdef> <paramdef>array <parameter>elementi</parameter></paramdef>

source: items
it: elementi

source: list of absolute paths to playlist items
it: elenco di percorsi assoluti agli elementi della scaletta
ru: список абсолютных путей к элементам списка воспроизведения
sv: lista över absoluta sökvägar till objekt i spellistan

source: Returns true if OK, false if not all items were found and added or saving failed.
it: Restituisce vero se OK, falso se non tutti gli elementi sono stati trovati e aggiunti o il salvataggio non è riuscito.
ru: Возвращает true, если выполнено успешно, и false, если не все элементы были найдены и добавлены или сохранение завершилось ошибкой.
sv: Returnerar true om ok, false om inte alla objekt hittades och lades till eller spara misslyckades.

source: Quit the application
it: Uscire dall'applicazione
ru: Выход из приложения
sv: Avsluta programmet

source: Select all files
it: Selezionare tutti i file
ru: Выделение всех файлов
sv: Markera alla filer

source: Deselect all files
it: Deselezionare tutti i file
ru: Отмена выделения всех файлов
sv: Avmarkera alla filer

source: Set the first file as the current file
it: Impostare il primo file come file attuale
ru: Установка первого файла в качестве текущего файла
sv: Ställ in första filen som den aktuella filen

source: Returns true if there is a first file.
it: Restituisce vero se esiste un primo file.
ru: Возвращает true, если первый файл существует.
sv: Returnerar true om det finns en första fil.

source: Set the previous file as the current file
it: Impostare il file precedente come file attuale
ru: Установка предыдущего файла в качестве текущего файла
sv: Ställ in föregående fil som den aktuella filen

source: Returns true if there is a previous file.
it: Restituisce vero se esiste un file precedente.
ru: Возвращает true, если предыдущий файл существует.
sv: Returnerar true om det finns en föregående fil.

source: Set the next file as the current file
it: Impostare il file successivo come file attuale
ru: Установка следующего файла в качестве текущего файла
sv: Ställ in nästa fil som den aktuella filen

source: Returns true if there is a next file.
it: Restituisce vero se esiste un file successivo.
ru: Возвращает true, если следующий файл существует.
sv: Returnerar true om det finns en nästa fil.

source: Select the first file
it: Selezionare il primo file
ru: Выделение первого файла
sv: Markera första filen

source: Select the previous file
it: Selezionare il file precedente
ru: Выделение предыдущего файла
sv: Markera föregående fil

source: Select the next file
it: Selezionare il file successivo
ru: Выделение следующего файла
sv: Markera nästa fil

source: Select the current file
it: Selezionare il file attuale
ru: Выделение текущего файла
sv: Markera aktuell fil

source: Returns true if there is a current file.
it: Restituisce vero se esiste un file attuale.
ru: Возвращает true, если текущий файл существует.
sv: Returnerar true om det finns en aktuell fil.

source: Expand or collapse the current file item if it is a folder
it: Espandere o contrarre l'elemento attuale se è una cartella
ru: Разворачивание или сворачивание текущего элемента, если это каталог
sv: Expandera eller dra ihop aktuellt filobjekt om det är en katalog

source: A file list item is a folder if getFileName() returns a name with '/' as the last character.
it: Una voce dell'elenco dei file è una cartella se getFileName() restituisce un nome con «/» come ultimo carattere.
ru: Пункт списка файлов является каталогом, если getFileName() возвращает название, последний символ которого — косая черта, «/».
sv: Ett objekt i fillistan är en katalog om getFileName() returnerar ett namn med '/' som det sista tecknet.

source: Returns true if current file item is a folder.
it: Restituisce vero se l'elemento attuale è una cartella.
ru: Возвращает true, если текущий элемент — каталог.
sv: Returnera true om aktuellt filobjekt är en katalog.

source: Apply the file name format
it: Applicare il formato del nome del file
ru: Применение формата имени файла
sv: Verkställ filnamnsformatet

source: Apply the tag format
it: Applicare il formato del tag
ru: Применение формата тега
sv: Verkställ taggformatet

source: Set the folder name from the tags
it: Impostare il nome della cartella dai tag
ru: Установка имени каталога из тегов
sv: Ange katalognamn från taggar

source: <funcdef>boolean <function>setDirNameFromTag</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>format</parameter></paramdef> <paramdef>boolean <parameter>create</parameter></paramdef>
it: <funcdef>boolean <function>setDirNameFromTag</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>formato</parameter></paramdef> <paramdef>boolean <parameter>creare</parameter></paramdef>

source: format
it: formato

source: folder name format
it: formato del nome della cartella
ru: формат имени каталога
sv: katalognamnsformat

source: create
it: creare
sv: skapa

source: true to create, false to rename
it: vero per creare, falso per rinominare
ru: true для создания, false для переименования
sv: true för att skapa, false för att byta namn

source: Returns true if OK, else the error message is available using getErrorMessage().
it: Restituisce vero se OK, altrimenti il messaggio di errore è disponibile utilizzando getErrorMessage().
ru: Возвращает true, если выполнено успешно, в противном случае воспользуйтесь командой getErrorMessage() для получения сообщения об ошибке
sv: Returnerar true om ok, annars är felmeddelandet tillgängligt genom att använda getErrorMessage().

source: Set subsequent track numbers in the selected files
it: Impostare i numeri di traccia successivi nei file selezionati
ru: Установка последовательной нумерации дорожек для выделенных файлов
sv: Ställ in följande spårnummer i markerade filer

source: number to use for first file
it: numero da utilizzare per il primo file
ru: номер, который будет использоваться для первого файла
sv: nummer att använda för första fil

source: Filter the files
it: Filtrare i file
ru: Фильтр файлов
sv: Filtrera filerna

source: <funcdef><function>filter</function></funcdef> <paramdef>string <parameter>expression</parameter></paramdef>
it: <funcdef><function>filter</function></funcdef> <paramdef>string <parameter>espressione</parameter></paramdef>

source: expression
it: espressione
sv: uttryck

source: filter expression
it: espressione di filtro
ru: фильтрующее выражение
sv: filteruttryck

source: Convert ID3v2.3 tags to ID3v2.4
it: Convertire i tag ID3v2.3 in ID3v2.4
ru: Преобразование тегов ID3v2.3 в ID3v2.4
sv: Konvertera ID3v2.3 taggar till ID3v2.4

source: Convert ID3v2.4 tags to ID3v2.3
it: Convertire i tag ID3v2.4 in ID3v2.3
ru: Преобразование тегов ID3v2.4 в ID3v2.3
sv: Konvertera ID3v2.4 taggar till ID3v2.3

source: Get path of folder
it: Ottenere il percorso della cartella
ru: Получение пути к каталогу
sv: Hämta katalogens sökväg

source: Returns absolute path of folder.
it: Restituisce il percorso assoluto a una cartella.
ru: Возвращает абсолютный путь к каталогу.
sv: Returnerar katalogens absoluta sökväg.

source: Get name of current file
it: Ottenere il nome del file attuale
ru: Получение имени текущего файла
sv: Hämta namnet på den aktuella filen

source: Returns true absolute file name, ends with "/" if it is a folder.
it: Restituisce il vero nome file assoluto, termina con «/» se si tratta di una cartella.
ru: Возвращает абсолютное имя текущего файла. Если это каталог, оно будет завершаться символом «/».
sv: Returnerar det verkliga absoluta filnamnet, slutar med "/" om det är en katalog.

source: Set name of selected file
it: Impostare il nome del file selezionato
ru: Установка имени выделенного файла
sv: Ställ in namnet på markerad fil

source: <funcdef><function>setFileName</function></funcdef> <paramdef>string <parameter>name</parameter></paramdef>
it: <funcdef><function>setFileName</function></funcdef> <paramdef>string <parameter>nome</parameter></paramdef>

source: name
it: nome
sv: namn

source: file name
it: nome file
ru: название файла
sv: filnamn

source: The file will be renamed when the folder is saved.
it: Il file sarà rinominato al salvataggio della cartella.
ru: Файл будет переименован при сохранении каталога.
sv: Filens namn byts när katalogen sparas.

source: Set format to use when setting the filename from the tags
it: Impostare il formato da utilizzare quando si imposta il nome file dai tag
ru: Установка формата, который будет использован при установке названий файлов на основе тегов
sv: Ställ in format att använda när filnamnet ställs in från taggarna

source: <funcdef><function>setFileNameFormat</function></funcdef> <paramdef>string <parameter>format</parameter></paramdef>
it: <funcdef><function>setFileNameFormat</function></funcdef> <paramdef>string <parameter>formato</parameter></paramdef>

source: file name format
it: formato del nome file
ru: формат названия файла
sv: filnamnsformat

source: Set the file names of the selected files from the tags
it: Impostare i nomi dei file selezionati dai tag
ru: Установка названий выделенных файлов на основе тегов
sv: Ställ in filnamn för markerade filer från taggarna

source: Get value of frame
it: Ottenere il valore del frame
ru: Получение значения фрейма
sv: Hämta ramens värde

source: <funcdef>string <function>getFrame</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>name</parameter></paramdef>
it: <funcdef>string <function>getFrame</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>nome</parameter></paramdef>

source: name of frame (<abbrev>e.g.</abbrev> "artist")
it: nome del frame (<abbrev>ad es.</abbrev> "artista")
ru: название фрейма (например, «artist»)
sv: ramens namn (t.ex. "artist")

source: To get binary data like a picture, the name of a file to write can be added after the <parameter>name</parameter>, <abbrev>e.g.</abbrev> "Picture:/path/to/file". In the same way, synchronized lyrics can be exported, <abbrev>e.g.</abbrev> "SYLT:/path/to/file".
it: Per ottenere dati binari come un'immagine, il nome di un file da scrivere può essere aggiunto dopo il <parameter>nome</parameter>, <abbrev>ad es.</abbrev> «Picture:/percorso/a/file». Allo stesso modo, i testi sincronizzati possono essere esportati, <abbrev>ad es.</abbrev> «SYLT:/percorso/a/file».
ru: Чтобы сохранить двоичные данные (например, изображение) в файле, добавьте имя файла к имени фрейма, например: «Picture:/путь/к/файлу». Таким же образом возможно экспортировать синхронизированный текст песни, например: «SYLT:/путь/к/файлу».
sv: För att hämta binärdata, som en bild, kan namnet på en fil att skriva till läggas till efter <parameter>namn</parameter>, <abbrev>t.ex.</abbrev> ""Picture:/path/to/file". På samma sätt kan synkroniserad sångtext exporteras, <abbrev>t.ex.</abbrev> "SYLT:/sökväg/till/fil".

source: Returns value of frame.
it: Restituisce il valore del frame.
ru: Возвращает значение фрейма.
sv: Returnerar ramens värde.

source: Set value of frame
it: Impostare il valore del frame
ru: Установка значения фрейма
sv: Tilldela ramens värde

source: <funcdef>boolean <function>setFrame</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>name</parameter></paramdef> <paramdef>string <parameter>value</parameter></paramdef>
it: <funcdef>boolean <function>setFrame</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>nome</parameter></paramdef> <paramdef>string <parameter>valore</parameter></paramdef>

source: value
it: valore
sv: värde

source: value of frame
it: valore del frame
ru: значение фрейма
sv: ramens värde

source: For tag 2 (<parameter>tagMask</parameter> 2), if no frame with <parameter>name</parameter> exists, a new frame is added, if <parameter>value</parameter> is empty, the frame is deleted. To add binary data like a picture, a file can be added after the <parameter>name</parameter>, <abbrev>e.g.</abbrev> "Picture:/path/to/file". "SYLT:/path/to/file" can be used to import synchronized lyrics.
it: Per il tag 2 (<parameter>tagMask</parameter> 2), se non esiste un frame con <parameter>nome</parameter>, viene aggiunto un nuovo frame, se il <parameter>valore</parameter> è vuoto, il frame è eliminato. Per aggiungere dati binari come un'immagine, è possibile aggiungere un file dopo il <parameter>nome</parameter>, <abbrev>ad es.</abbrev> «Picture:/percorso/a/file». «SYLT:/percorso/a/file» può essere usato per importare testi sincronizzati.
ru: Для тега 2 (<parameter>tagMask</parameter> 2): если фрейма с указанным именем не существует, будет добавлен новый фрейм; если значение параметра «value» пустое, фрейм будет удалён. Чтобы добавить двоичные данные (например, изображение), добавьте имя файла к имени фрейма, например: «Picture:/путь/к/файлу». Таким же образом возможно импортировать синхронизированный текст песни, например: «SYLT:/путь/к/файлу».
sv: Om det inte finns någon ram med <parameter>namn</parameter> för tagg 2 (<parameter>tagMask</parameter> 2), läggs en ny ram till. Om <parameter>värde</parameter> är tomt, tas ramen bort. För att lägga till binärdata, som en bild, kan en fil läggas till efter <parameter>namn</parameter>, <abbrev>t.ex.</abbrev> ""Picture:/path/to/file". "SYLT:/sökväg/till/fil" kan användas för att importera synkroniserad sångtext.

source: Get all frames of a tag
it: Ottenere tutti i frame da un tag
ru: Получение всех фреймов тега
sv: Hämta alla ramar i en tagg

source: Returns list with alternating frame names and values.
it: Restituisce un elenco con nomi e valori di frame alternati.
ru: Возвращает список с чередующимися названиями и значениями фреймов.
sv: Returnerar lista med alternerande ramnamn och värden.

source: Get technical information about file
it: Ottenere informazioni tecniche sul file
ru: Получение технической информации о файле
sv: Hämta teknisk information om filen

source: array of string <function>getInformation</function>
it: array di stringhe <function>getInformation</function>

source: Properties are Format, Bitrate, Samplerate, Channels, Duration, Channel Mode, VBR, Tag 1, Tag 2. Properties which are not available are omitted.
it: Le proprietà sono Formato, Bitrate, Campionamento, Canali, Durata, Modalità canale, VBR, Tag 1, Tag 2. Le proprietà non disponibili sono omesse.
ru: Свойствами являются Format, Bitrate, Samplerate, Channels, Duration, Channel Mode, VBR, Tag 1, Tag 2. Свойства, которые недоступны, будут пропущены.
sv: Egenskaperna är Format, Bithastighet, Samplingsfrekvens, Kanaler, Längd, Kanalläge, VBR, Tagg 1, Tagg 2. Egenskaper som inte är tillgängliga utelämnas.

source: Returns list with alternating property names and values.
it: Restituisce un elenco con nomi e valori di proprietà alternati.
ru: Возвращает список с чередующимися названиями и значениями свойств.
sv: Returnerar lista med alternerande egenskapsnamn och värden.

source: Set tag from file name
it: Impostare un tag dal nome del file
ru: Установка тега на основе имени файла
sv: Tilldela tagg från filnamn

source: Set tag from other tag
it: Impostare un tag da un altro tag
ru: Установка тега на основе другого тега
sv: Tilldela tagg från en annan tagg

source: Copy tag
it: Copiare un tag
ru: Копирование тега
sv: Kopiera tagg

source: Paste tag
it: Incollare un tag
ru: Вставка тега
sv: Klistra in tagg

source: Remove tag
it: Rimuovere un tag
ru: Удаление тега
sv: Ta bort tagg

source: Reparse the configuration
it: Elaborare nuovamente la configurazione
ru: Повторная обработка параметров конфигурации
sv: Tolka om inställningen

source: Automated configuration changes are possible by modifying the configuration file and then reparsing the configuration.
it: Le modifiche automatizzate alla configurazione sono possibili modificando il file di configurazione e quindi elaborando nuovamente la configurazione.
ru: Автоматизированная обработка изменений в параметрах конфигурации доступна посредством внесения изменений в файл конфигурации с их последующей повторной обработкой.
sv: Automatiserade inställningsändringar är möjliga genom att ändra inställningsfilen och sedan tolka om inställningen.

source: Plays the selected files
it: Riproduce i file selezionati
ru: Воспроизведение выбранных файлов
sv: Spelar markerade filer

source: QML Interface
it: Interfaccia QML
ru: Интерфейс QML
sv: QML-gränssnitt

source: QML Examples
it: Esempi di QML
ru: Примеры QML
sv: QML-exempel

source: QML scripts can be invoked via the context menu of the file list and can be set in the tab <link linkend="configure-user-actions-qml">User Actions</link> of the settings dialog. The scripts which are set there can be used as examples to program custom scripts. QML uses &javascript;, here is the obligatory "Hello World":
it: Gli script QML possono essere richiamati tramite il menu contestuale dell'elenco file e possono essere impostati nella scheda <link linkend="configure-user-actions-qml">Azioni dell'utente</link> della finestra delle impostazioni. Gli script impostati lì possono essere utilizzati come esempi per programmare script personalizzati. QML utilizza &javascript; ecco il «Ciao mondo» obbligatorio:
ru: Чтобы вызвать окно сценариев QML, воспользуйтесь контекстным меню списка файлов; чтобы указать список сценариев, воспользуйтесь вкладкой <link linkend="configure-user-actions-qml">Команды пользователя</link> диалога настройки. Установленные там сценарии возможно использовать в качестве примеров для создания собственных сценариев. QML использует синтаксис &javascript;. Вот пример простого сценария:
sv: QML-skript kan startas via fillistans sammanhangsberoende meny och det kan ställas in under fliken <link linkend="configure-user-actions-qml">Användaråtgärder</link> i inställningsdialogrutan. Skriptet som ställs in där kan användas som exempel för att programmera egna skript. QML använder &javascript;, och här är det obligatoriska "Hello World".

source: import Kid3 1.0 Kid3Script { onRun: { console.log("Hello world, folder is", app.dirName) Qt.quit() } }
it: import Kid3 1.0 Kid3Script { onRun: { console.log("Ciao mondo, la cartella è", app.dirName) Qt.quit() } }
sv: import Kid3 1.0 Kid3Script { onRun: { console.log("Hej allesamman, katalogen är", app.dirName) Qt.quit() } }

source: If this script is saved as <filename>/path/to/Example.qml</filename>, the user command can be defined as <command>@qml /path/to/Example.qml</command> with name <userinput>QML Test</userinput> and <guilabel>Output</guilabel> checked. It can then be started using the <guilabel>QML Test</guilabel> item in the file list context menu, and the output will be visible in the window.
it: Se questo script viene salvato come <filename>/percorso/a/Esempio.qml</filename>, il comando utente può essere definito come <command>@qml/percorso/a/Esempio.qml</command> con nome <userinput>Test QML</userinput> e <guilabel>Risultato</guilabel> selezionati. Può quindi essere avviato utilizzando l'elemento <guilabel>Test QML</guilabel> nel menu contestuale dell'elenco dei file e il risultato sarà visibile nella finestra.
ru: Если этот сценарий хранится по адресу <filename>/путь/к/Example.qml</filename>, команду пользователя возможно определить как <command>@qml /путь/к/Example.qml</command> и назвать <userinput>Проверка QML</userinput>. Также следует установить флажок в столбце <guilabel>Вывод</guilabel>. Чтобы выполнить сценарий, выберите в контекстном меню списка файлов пункт <guilabel>Проверка QML</guilabel>. Вывод будет показан в окне программы.
sv: Om skriptet sparas som <filename>/sökväg/till/Exempel.qml</filename> kan användarkommandot definieras som <command>@qml /sökväg/till/Exempel.qml</command> med namnet <userinput>Test av QML</userinput> och <guilabel>Utmatning</guilabel> markerat. Därefter kan det startas med alternativet <guilabel>Test av QML</guilabel> i fillistans sammanhangsberoende meny, så visas utmatningen i fönstret.

source: Alternatively, the script could also be started independent of &kid3; using the QML tools. <screen width="80"> qml -apptype widget -I /usr/lib/kid3/plugins/imports /path/to/Example.qml </screen> or <screen width="80"> qmlscene -I /usr/lib/kid3/plugins/imports /path/to/Example.qml </screen> On &Windows; and &macOS;, the import path must be adapted to the <filename class="directory">imports</filename> folder inside the installation folder. Scripts started outside of &kid3; will use the current folder, so it should be changed beforehand.
it: In alternativa, lo script può essere avviato anche indipendentemente da &kid3; utilizzando gli strumenti QML. <screen width="80"> qml -apptype widget -I /usr/lib/kid3/plugins/imports/percorso/a/Esempio.qml </screen> o <screen width="80"> qmlscene -I /usr/lib/kid3/plugins/imports/percorso/a/Esempio.qml </screen>Su &Windows; e &macOS; il percorso di importazione deve essere adattato alla cartella <filename class="directory">imports</filename> all'interno della cartella di installazione. Gli script avviati al di fuori di &kid3; utilizzeranno la cartella attuale, quindi dovrebbe essere cambiata in anticipo.
sv: Som ett alternativ, skulle skriptet också kunna startas oberoende av &kid3; genom att använda QML-verktygen. <screen width="80"> qml -apptype widget -I /usr/lib/kid3/plugins/imports /path/to/Example.qml </screen> eller <screen width="80"> qmlscene -I /usr/lib/kid3/plugins/imports /path/to/Example.qml </screen> På &Windows; och &macOS; måste importsökvägen anpassas till katalogen <filename class="directory">importer</filename> i installationskatalogen. Skript som startas utanför &kid3; använder den aktuella katalogen, så den måste ändras i förväg.
