Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: <guimenuitem>Play</guimenuitem>: Plays a file, see <link linkend="play">Play</link>. If the selected file is a playlist, the files of the playlist will be played.
it: <guimenuitem>Riproduci</guimenuitem>: riproduce un file, vedere <link linkend="play">Riproduci</link>. Se il file selezionato è una scaletta, i file della scaletta saranno riprodotti.
ru: <guimenuitem>Воспроизвести</guimenuitem>: воспроизводит файл; подробнее об этом пункте контекстного меню рассказано в описании функции «<link linkend="play">Воспроизведение</link>». Если выбранный файл — это список воспроизведения, будут воспроизводиться все файлы списка воспроизведения.
sv: <guimenuitem>Spela</guimenuitem>: Spelar upp en fil, se <link linkend="play">Spela</link>. Om den markerade filen är en spellista, spelas filerna i spellistan.

source: <guimenuitem>Edit</guimenuitem>: Edit a playlist, see <link linkend="edit-playlist">Edit Playlist</link>.
it: <guimenuitem>Modifica</guimenuitem>: modificare una scaletta, vedere <link linkend="edit-playlist">Modificare la scaletta</link>.
ru: <guimenuitem>Редактировать</guimenuitem>: позволяет отредактировать список воспроизведения, подробные сведения об этом пункте контекстного меню приводятся в разделе «<link linkend="edit-playlist">Редактирование списка воспроизведения</link>».
sv: <guimenuitem>Redigera</guimenuitem>: Redigera en spellista, se <link linkend="edit-playlist">Redigera spellista</link>.

source: The subsequent entries are user commands, which can be defined in the <guilabel>User Actions</guilabel> tab of <link linkend="configure-kid3">Configure &kid3;</link>. The playback on double click can also be activated there.
it: Le voci successive sono comandi utente, che possono essere definiti nella scheda <guilabel>Azioni dell'utente</guilabel> di <link linkend="configure-kid3">Configura &kid3;</link>. Qui è anche possibile attivare la riproduzione con doppio clic.
ru: Остальные пункты являются пользовательскими командами, которые возможно указать на вкладке <guilabel>Команды пользователя</guilabel> диалогового окна <link linkend="configure-kid3">настройки &kid3;</link>. В этом же разделе находится функция воспроизведения по двойному щелчку.
sv: Efterföljande alternativ är användarkommandon, som kan definieras under fliken <guilabel>Användaråtgärder</guilabel> i <link linkend="configure-kid3">Anpassa &kid3;</link>. Uppspelning vid dubbelklick kan också aktiveras där.

source: Edit Playlist
it: Modificare la scaletta
ru: Редактирование списка воспроизведения
sv: Redigera spellista

source: A playlist can be created empty or containing the tracks of a folder, see <link linkend="create-playlist">Create Playlist</link>. The playlist file created in such a way can be edited by double click or using <guilabel>Edit</guilabel> from the file list context menu. A dialog with the entries of the playlist is shown. It is possible to open multiple playlists simultaneously.
it: Una scaletta può essere creata vuota o contenente le tracce di una cartella, vedere <link linkend="create-playlist">Creare una scaletta</link>. Il file della scaletta creato in questo modo può essere modificato facendo doppio clic o utilizzando <guilabel>Modifica</guilabel> dal menu contestuale dell'elenco dei file. Viene visualizzata una finestra con le voci della scaletta. È possibile aprire più scalette contemporaneamente.
ru: Возможно создать как пустой список воспроизведения, так и уже содержащий дорожки из определённого каталога, подробные сведения об этом доступны в описании функции «<link linkend="create-playlist">Создать список воспроизведения</link>». Чтобы изменить список воспроизведения, созданный таким образом, дважды щёлкните по нему левой кнопкой мыши, либо воспользуйтесь пунктом контекстного меню списка файлов <guilabel>Правка</guilabel>. Отобразится диалог с содержимым списка воспроизведения. Возможно открывать сразу несколько разных списков воспроизведения.
sv: En spellista kan skapas tom eller med spåren i en katalog, se <link linkend="create-playlist">Skapa spellista</link>. Spellistefilen skapas på ett sådant sätt att den kan redigeras genom att dubbelklicka eller genom att använda <guilabel>Redigera</guilabel> i fillistans sammanhangsberoende meny. En dialogruta med posterna i spellistan visas. Det är möjligt att öppna flera spellistor samtidigt.

source: New entries can be added by drag and drop from the file list, a file manager or another playlist. If an entry is dragged from another playlist, it will be moved or copied depending on the system. To invoke the other operation, respectively, the <keycap>Shift</keycap>, &Ctrl; or &Alt; (to copy instead of move on &macOS;) key has to be pressed. Reordering entries within the playlist is also possible via drag and drop. Alternatively, entries can be moved using the keyboard shortcuts <keycombo>&Ctrl;<keycap>Shift</keycap><keycap>Up</keycap></keycombo> and <keycombo>&Ctrl;<keycap>Shift</keycap><keycap>Down</keycap></keycombo> (on &macOS; <keycap>Command</keycap> has to be pressed instead of &Ctrl;). An entry can be removed using the <keycap>Delete</keycap> key.
it: È possibile aggiungere nuove voci trascinandole dall'elenco dei file, da un gestore file o da un'altra scaletta. Se una voce viene trascinata da un'altra scaletta, sarà spostata o copiata in base al sistema. Per invocare l'altra operazione, rispettivamente, il tasto <keycap>Maiusc</keycap>, &Ctrl; o &Alt; (per copiare invece che spostare su &macOS;) deve essere premuto. Il riordino delle voci all'interno della scaletta è possibile anche tramite il trascinamento della selezione. In alternativa, le voci possono essere spostate utilizzando le scorciatoie da tastiera <keycombo>&Ctrl;<keycap>Maiusc</keycap><keycap>Su</keycap></keycombo> e <keycombo> &Ctrl; <keycap>Maiusc</keycap><keycap>Giù</keycap></keycombo> (su &macOS; <keycap> Command </keycap> deve essere premuto invece di &Ctrl;). Una voce può essere rimossa utilizzando il tasto <keycap>Elimina</keycap>.
ru: Чтобы добавить новые записи, перетащите нужные файлы из списка файлов, диспетчера файлов или из другого списка воспроизведения. Если перетащить запись из другого списка воспроизведения, в зависимости от системы, она будет либо перемещена, либо скопирована. Чтобы вызвать другие действия, нажмите клавишу <keycap>Shift</keycap>, &Ctrl; или &Alt; (в &macOS; — для копирования вместо перемещения). Чтобы упорядочить записи в списке воспроизведения, также воспользуйтесь функцией перетаскивания. Кроме того, для перемещения записей в списке предусмотрены комбинации клавиш <keycombo>&Ctrl;<keycap>Shift</keycap><keycap>Вверх</keycap></keycombo> и <keycombo>&Ctrl;<keycap>Shift</keycap><keycap>Вниз</keycap></keycombo> (в &macOS; вместо клавиши &Ctrl; следует использовать <keycap>Command</keycap>). Чтобы удалить запись, нажмите клавишу <keycap>Delete</keycap>.
sv: Nya poster kan läggas till genom att dra och släppa från fillistan, en filhanterare eller en annan spellista. Om en post dras från en annan spellista flyttas eller kopieras den beroende på systemet. För att utföra den andra åtgärden, måste &Shift;-, &Ctrl;- eller &Alt;-tangenten användas (för att kopiera eller flytta på &macOS;). Det är också möjligt att ordna om poster i spellistan med dra och släpp. Som alternativ kan poster flyttas genom att använda snabbtangenterna <keycombo>&Ctrl;&Shift;<keycap>Uppåtpil</keycap></keycombo> och <keycombo>&Ctrl;&Shift;<keycap>Neråtpil</keycap></keycombo> (på &macOS; måste <keycap>Kommando</keycap> användas istället för &Ctrl;). En post kan tas bort med <keycap>Delete</keycap>-tangenten.

source: Please note the following: To drag entries from the file list, they have to be held at the left side (near the icons), the same gesture at the right side will perform a multi selection, such an action is hereby still easily possible.
it: Notare quanto segue: per trascinare le voci dall'elenco dei file, devono essere tenute sul lato sinistro (vicino alle icone), lo stesso gesto sul lato destro eseguirà una selezione multipla, tale azione è ancora facilmente possibile.
ru: Обратите внимание на следующее: чтобы перетащить записи из списка файлов, их следует захватывать с левой стороны (рядом со значком), так как захват с правой стороны выполняет функцию выделения нескольких файлов. Поэтому, чтобы перетащить сразу несколько файлов, потребуется выполнить оба этих действия.
sv: Observera följande: För att dra poster från fillistan, måste de hållas på vänster sida (nära ikonerna), samma gest på höger sida utför multipel markering, en sådan åtgärd är därmed fortfarande enkel att göra.

source: When a playlist has been modified, the changes can be stored using <guibutton>Save</guibutton> or discarded using <guibutton>Cancel</guibutton>. When the window is closed, a confirmation prompt is shown if there are unsaved changes.
it: Quando una scaletta è stata modificata, le modifiche possono essere archiviate utilizzando <guibutton>Salva</guibutton> o scartate utilizzando <guibutton>Annulla</guibutton>. Quando la finestra è chiusa, viene visualizzato un messaggio di conferma in caso di modifiche non salvate.
ru: После внесения изменений в список воспроизведения нажмите кнопку <guibutton>Сохранить</guibutton> для сохранения изменений или кнопку <guibutton>Отмена</guibutton> для их отмены. При закрытии окна приложения будет предложено сохранить несохранённые изменения, если таковые имеются.
sv: När en spellista har ändrats, ändringarna kan lagras genom att använda <guibutton>Spara</guibutton> eller kastas genom att använda <guibutton>Avbryt</guibutton>. När fönstret stängs, visas en bekräftelseruta om det finns osparade ändringar.

source: Tracks selected in a playlist will be automatically selected in the file list, thereby making it possible to edit their tags.
it: Le tracce selezionate in una scaletta saranno selezionate automaticamente nell'elenco dei file, rendendo così possibile modificare i loro tag.
ru: Выделенные в списке воспроизведения дорожки также автоматически выделяются в списке файлов, что позволяет сразу же приступить к редактированию присвоенных им тегов.
sv: Spår som markeras i spellistan markeras automatiskt i fillistan, och därigenom blir det möjligt att redigera deras taggar.

source: To execute actions on a playlist, its file must be selected in the file list. <guimenuitem>Edit</guimenuitem> from the context menu will lead to the dialog described in this section, and <guimenuitem>Play</guimenuitem> will start the media player with the tracks from the playlist. User actions can act on playlists, for <link linkend="qml-examples">example</link> <guilabel>Export Playlist Folder</guilabel>, which copies the files from a playlist into a folder.
it: Per eseguire azioni su una scaletta, è necessario selezionare il relativo file nell'elenco dei file. <guimenuitem>Modifica</guimenuitem> dal menu contestuale porta alla finestra descritta in questa sezione e <guimenuitem>Riproduci</guimenuitem> avvia il lettore multimediale con i brani della scaletta. Le azioni dell'utente possono agire sulle scalette, ad <link linkend="qml-examples">esempio</link> <guilabel>Esporta cartella della scaletta</guilabel>, che copia i file da una scaletta in una cartella.
ru: Чтобы выполнить те или иные действия над списком воспроизведения, следует выделить его файл в списке файлов. Пункт контекстного меню <guimenuitem>Изменить</guimenuitem> открывает диалог, описанный в этом разделе, а пункт <guimenuitem>Воспроизвести</guimenuitem> запустит проигрыватель с дорожками из списка воспроизведения. Над списками воспроизведения возможно выполнять пользовательские действия, <link linkend="qml-examples">например</link>, <guilabel>Экспорт списка воспроизведения</guilabel> для копирования файлов из списка воспроизведения в каталог.
sv: För att utföra åtgärder för en spellista måste dess fil vara markerad i fillistan. <guimenuitem>Redigera</guimenuitem> i den sammanhangsberoende menyn ger dialogrutan beskriven i det här avsnittet, och <guimenuitem>Spela</guimenuitem> startar mediaspelaren med spåren i spellistan. Användaråtgärder kan gälla spellistor, <link linkend="qml-examples">exempelvis</link> <guilabel>Exportera spellistekatalog</guilabel>, som kopierar filerna från en spellista till en katalog.

source: Folder List
it: Elenco delle cartelle
ru: Список каталогов
sv: Kataloglista

source: The folder list contains the names of the folders in the opened folder, as well as the current (<filename class="directory">.</filename>) and the parent (<filename class="directory">..</filename>) folder. It allows one to quickly change the folder without using the <guimenuitem>Open</guimenuitem> command or drag and drop.
it: L'elenco delle cartelle contiene i nomi delle cartelle nella cartella aperta, nonché l'attuale (<filename class="directory">.</filename>) e la cartella superiore (<filename class="directory">..</filename>). Permette di cambiare rapidamente la cartella senza utilizzare il comando <guimenuitem>Apri</guimenuitem> o trascinare e rilasciare.
ru: В списке каталогов содержатся названия подкаталогов открытого каталога, а также пункты текущего (<filename class="directory">.</filename>) и родительского (<filename class="directory">..</filename>) каталога. Этот список позволяет быстро сменить каталог без использования кнопки <guimenuitem>Открыть</guimenuitem> или функции перетаскивания.
sv: Kataloglista innehåller namnet på katalogerna i den öppnade katalogen, förutom den aktuella (<filename class="directory">.</filename>) och den överliggande (<filename class="directory">..</filename>) katalogen. Den gör att man snabbt kan byta katalog utan att använda kommandot <guimenuitem>Öppna...</guimenuitem> eller dra och släpp.

source: Column visibility, order and sorting can be configured as described in the section about the <link linkend="file-list">file list</link>.
it: La visibilità, l'ordine e l'ordinamento delle colonne possono essere configurati come descritto nella sezione relativa all'<link linkend="file-list">elenco dei file</link>.
ru: Сведения о настройке видимости столбцов, порядка столбцов и сортировки записей в столбцах доступны в разделе о <link linkend="file-list">списке файлов</link>.
sv: Kolumnsynlighet, ordning och sortering kan ställas in som beskrivs i avsnittet om <link linkend="file-list">fillistan</link>.

source: Shows information about the encoding (MP3, Ogg, Opus, DSF, FLAC, MPC, APE, MP2, MP4, AAC, Speex, TrueAudio, WavPack, WMA, WAV, AIFF), bit rate, sample rate, channels and the length of the file.
it: Mostra le informazioni sulla codifica (MP3, Ogg, Opus, DSF, FLAC, MPC, APE, MP2, MP4, AAC, Speex, TrueAudio, WavPack, WMA, WAV, AIFF), bit rate, frequenza di campionamento, canali e la lunghezza di il file.
ru: Отображает информацию о кодировке (MP3, Ogg, Opus, DSF, FLAC, MPC, APE, MP2, MP4, AAC, Speex, TrueAudio, WavPack, WMA, WAV, AIFF), скорости передачи, частоте дискретизации, каналах и длине файла.
sv: Visar information om kodningen (MP3, Ogg, Opus, DSF, FLAC, MPC, APE, MP2, MP4, AAC, Speex, TrueAudio, WavPack, WMA, WAV, AIFF), bithastighet, samplingsfrekvens, kanaler och filens längd.

source: The <guilabel>Name</guilabel> line edit contains the name of the file (if only a single file is selected). If this name is changed, the file will be renamed when the Save command is used.
it: Il campo di testo <guilabel>Nome</guilabel> contiene il nome del file (se viene selezionato un solo file). Se questo nome viene modificato, il file sarà rinominato quando viene utilizzato il comando Salva.
ru: Поле для редактирования <guilabel>Имя</guilabel> содержит название файла (только если выделен один файл). При изменении имени файла для сохранения следует использовать команду сохранения изменений.
sv: Redigeringsraden <guilabel>Namn</guilabel> innehåller filens namn (om bara en enda fil är markerad). Om namnet ändras, ändras också filens namn när kommandot Spara används.

source: The <guilabel>Format</guilabel> combo box and line edit contains the format to be used when the filename is generated from the first or the second tag. The filename can contain arbitrary characters, even a folder part separated by a slash from the file name, but that folder must already exist for the renaming to succeed. The following special codes are used to insert tag values into the filename:
it: La casella combinata <guilabel>Formato</guilabel> e il campo di testo contengono il formato da utilizzare quando il nome file viene generato dal primo o dal secondo tag. Il nome file può contenere caratteri arbitrari, anche una parte di cartella separata da una barra dal nome del file, ma quella cartella deve già esistere affinché la rinomina abbia esito positivo. I seguenti codici speciali vengono utilizzati per inserire i valori dei tag nel nome file:
ru: Раскрывающийся список <guilabel>Формат</guilabel> и поле для редактирования содержат информацию о формате, который будет использоваться при создании имени файла из первого или второго тега. Имя файла может содержать произвольные символы, даже часть каталога, отделённую от имени файла косой чертой (но переименование будет успешно выполнено только в том случае, если эта папка уже существует). Следующие специальные коды используются для вставки значений тегов в имя файла:
sv: Kombinationsrutan <guilabel>Format</guilabel> och redigeringsraden innehåller formatet som ska användas när filnamnet genereras från den första eller andra taggen. Filnamnet kan använda godtyckliga tecken, till och med en katalogdel åtskild med ett snedstreck från filnamnet, men katalogen måste redan finnas för att namnbytet ska lyckas. Följande specialkoder används för att infoga taggvärden i filnamnet:

source: %s %{title} Title (Song)
it: %s %{title} Titolo (Brano)
ru: %s %{title} Заголовок (композиции)
sv: %s %{title} Titel (Låt)

source: %a %{artist} Artist
it: %a %{artist} Artista
ru: %a %{artist} Исполнитель

source: %c %{comment} Comment
it: %c %{comment} Commento
ru: %c %{comment} Комментарий
sv: %c %{comment} Kommentar

source: %y %{year} Year
it: %y %{year} Anno
ru: %y %{year} Год
sv: %y %{year} År

source: %t %{track} Track (<abbrev>e.g.</abbrev> 01)
it: %t %{track} Traccia (<abbrev>ad es.</abbrev> 01)
ru: %t %{track} Номер дорожки (например, 01)
sv: %t %{track} Spår (t.ex. 01)

source: %t %{track.n} Track with field width n (<abbrev>e.g.</abbrev> 001 for %{track.3})
it: %t %{track.n} Traccia con larghezza dei campi n (<abbrev>ad es.</abbrev> 001 per %{track.3})
ru: %t %{track.n} Номер дорожки с шириной поля n (например, 001 для %{track.3})
sv: %t %{track.n} Spår med fältbredd n (t.ex. 001 för %{track.3})

source: %T %{tracknumber} Track (without leading zeros, <abbrev>e.g.</abbrev> 1)
it: %T %{tracknumber} Traccia (senza zeri iniziali, <abbrev>ad es.</abbrev> 1)
ru: %T %{tracknumber} Номер дорожки (без нулей в начале, например, 1)
sv: %T %{tracknumber} Spår (utan inledande nollor, t.ex. 1)

source: %g %{genre} Genre
it: %g %{genre} Genere
ru: %g %{genre} Жанр

source: %{ignore} Ignored when generating tags from the file name
it: %{ignore} Ignorato durante la generazione di tag dal nome del file
ru: %{ignore} Игнорируется при создании тегов из имени файла
sv: %{ignore} Ignoreras när taggar genereras från filnamnet

source: The format codes are not restricted to the examples given above. Any frame name can be used, for instance unified frame names like <userinput>%{albumartist}</userinput>, <userinput>%{discnumber.1}</userinput>, <userinput>%{bpm}</userinput> or format specific names like <userinput>%{popm}</userinput>.
it: I codici di formato non sono limitati agli esempi sopra riportati. È possibile utilizzare qualsiasi nome di frame, ad esempio nomi di frame unificati come <userinput>%{albumartist}</userinput>, <userinput>%{discnumber.1}</userinput>, <userinput>%{bpm}</userinput> o formattare nomi specifici come <userinput>%{popm}</userinput>.
ru: Коды формата не ограничены приведёнными выше примерами. Возможно использовать любые названия фреймов, например, унифицированные названия фреймов наподобие <userinput>%{albumartist}</userinput>, <userinput>%{discnumber.1}</userinput>, <userinput>%{bpm}</userinput> или специфичные для форматов названия наподобие <userinput>%{popm}</userinput>.
sv: Formatkoderna är inte begränsade till exemplen som ges ovan. Alla ramnamn kan användas, exempelvis gemensamma ramnamn som <userinput>%{albumartist}</userinput>, <userinput>%{discnumber.1}</userinput>, <userinput>%{bpm}</userinput> eller formatspecifika namn såsom <userinput>%{popm}</userinput>.

source: It is possible to prepend and append strings to the replacement for a format code by adding them in double quotes inside the curly braces of a format code. These strings will only be put into the resulting string if the format code yields a nonempty value. For example, if the file name shall both contain the title and the subtitle, one could use <userinput>%{title} [%{subtitle}]</userinput> in the format string. But this would result in a string ending with <computeroutput> []</computeroutput> if no subtitle frame exists for a file. In order to omit the brackets if no subtitle is present, <userinput>%{title}%{" ["subtitle"]"}</userinput> shall be used instead. This will omit the brackets, the leading space and the subtitle if not subtitle exists.
it: È possibile anteporre e aggiungere stringhe alla sostituzione per un codice di formato aggiungendole tra virgolette doppie tra le parentesi graffe di un codice di formato. Queste stringhe saranno inserite nella stringa risultante solo se il codice del formato restituisce un valore non vuoto. Ad esempio, se il nome del file deve contenere sia il titolo che il sottotitolo, è possibile utilizzare <userinput>%{title} [%{subtitle}]</userinput> nella stringa di formato. Ciò produrrebbe una stringa che termina con <computeroutput> []</computeroutput> se non esiste un frame di sottotitoli per un file. Al fine di omettere le parentesi se non è presente alcun sottotitolo, al suo posto deve essere utilizzato <userinput>%{title}%{"["subtitle"]"}</userinput>. Questo ometterà le parentesi, lo spazio iniziale e il sottotitolo se non esistono i sottotitoli.
ru: Чтобы добавить строки к началу или концу строки для замены кода формата, следует добавить соответствующие строки в двойных кавычках внутри фигурных скобок кода формата. Такие строки добавляются в строку-результат, только если код формата имеет непустое значение. Например, если имя файла содержит как заголовок, так и подзаголовок, используйте в строке формата запись <userinput>%{title} [%{subtitle}]</userinput>. Но использование такой записи приведёт к завершению строки символами <computeroutput>[]</computeroutput>, если в файле отсутствует фрейм подзаголовка. Чтобы избежать добавления таких пустых квадратных скобок, следует использовать запись вида <userinput>%{title}%{" ["subtitle"]"}</userinput>. В этом случае скобки, начальный пробел и подзаголовок будут опущены, если подзаголовка не существует.
sv: Det är möjligt att lägga till strängar i början eller slutet av en formatkod genom att lägga till den i dubbla citationstecken inne i en formatkods klammerparenteser. Strängarna läggs bara till i resultatsträngen om formatkoden ger ett värde som inte är tomt. Om filnamnet exempelvis både ska innehålla titeln och undertiteln, skulle man kunna använda <userinput>%{title} [%{subtitle}]</userinput> i formatsträngen. Men det skulle resultera i en sträng som slutar med <computeroutput> []</computeroutput> om undertitel saknas i en fil. För att utelämna hakparenteserna om det inte finns någon undertitel, måste <userinput>%{title}%{" ["subtitle"]"}</userinput> användas istället. Det utelämnar hakparenteserna, det inledande mellanslaget och undertiteln om det inte finns någon undertitel.
