Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: To select certain frames before a copy, paste or remove action, the pseudo field name "selected" can be used. Normally, all frames are selected, to deselect all, use <userinput>set '*.selected' 0</userinput>, then for example <userinput>set artist.selected 1</userinput> to select the artist frame.
it: Per selezionare determinati frame prima di copiare, incollare o rimuovere un'azione, è possibile utilizzare il nome dello pseudo-campo «selected». Normalmente, tutti i frame sono selezionati, per deselezionare tutto, utilizzare <userinput>set '*.selected' 0</userinput>, quindi ad esempio <userinput>set artist.selected 1</userinput> per selezionare il frame dell'artista.
ru: Чтобы выделить определённые фреймы перед действиями копирования, вставки или удаления, воспользуйтесь псевдополем «selected». Обычно выделены все фреймы. Чтобы снять выделение со всех фреймов, воспользуйтесь командой <userinput>set '*.selected' 0</userinput>, а затем, например, для выделения фрейма исполнителя, командой <userinput>set artist.selected 1</userinput>.
sv: För att markera vissa ramar innan kopierings-, inklistrings- eller borttagningsåtgärder, kan pseudofältnamnet "selected" användas. Normalt är alla ramar markerade. För att avmarkera alla, använd <userinput>set '*.selected' 0</userinput>, och därefter exempelvis <userinput>set artist.selected 1</userinput> för att markera artistramen.

source: Revert
it: Ripristinare
ru: Отменить изменения
sv: Återställ

source: Revert all modifications in the selected files (or all files if no files are selected).
it: Annullare tutte le modifiche nei file selezionati (o tutti i file se non è selezionato alcun file).
ru: Отменить все изменения в выбранных файлах (или во всех файлах, если файлы не выбраны).
sv: Återställ alla ändringar i de markerade filerna (eller alla filer om inga filer är markerade).

source: Import from file
it: Importare da file
ru: Импортировать из файла
sv: Importera från fil

source: <command>import</command> <arg choice="req"><replaceable>FILE</replaceable></arg> <arg choice="req"><replaceable>FORMAT-NAME</replaceable></arg> <arg><replaceable>TAG-NUMBERS</replaceable></arg>
it: <command>import</command> <arg choice="req"><replaceable>FILE</replaceable></arg> <arg choice="req"><replaceable>NOME-FORMATO</replaceable></arg> <arg><replaceable>NUMERI-TAG</replaceable></arg>
ru: <command>import</command> <arg choice="req"><replaceable>ФАЙЛ</replaceable></arg> <arg choice="req"><replaceable>НАЗВАНИЕ-ФОРМАТА</replaceable></arg> <arg><replaceable>НОМЕРА-ТЕГОВ</replaceable></arg>
sv: <command>import</command> <arg choice="req"><replaceable>FIL</replaceable></arg> <arg choice="req"><replaceable>FORMATNAMN</replaceable></arg> <arg><replaceable>TAGGNUMMER</replaceable></arg>

source: Tags are imported from the file <replaceable>FILE</replaceable> in the format with the name <replaceable>FORMAT-NAME</replaceable> (<abbrev>e.g.</abbrev> <userinput>"CSV unquoted"</userinput>, see <link linkend="import-text">Import</link>).
it: I tag sono importati dal file <replaceable>FILE</replaceable> nel formato con il nome <replaceable>FORMAT-NAME</replaceable> (<abbrev>ad es.</abbrev> <userinput>«CSV non quotato»</userinput> , vedere <link linkend="import-text">Importa</link>).
ru: Теги будут импортированы из файла <replaceable>ФАЙЛ</replaceable> в формате под названием <replaceable>НАЗВАНИЕ-ФОРМАТА</replaceable> (например, <userinput>«CSV unquoted»</userinput>, подробные сведения доступны в описании функции «<link linkend="import-text">Импорт</link>»).
sv: Taggar importeras från filen <replaceable>FIL</replaceable> på formatet vid namn <replaceable>FORMATNAMN</replaceable> (<abbrev>tex.</abbrev> <userinput>"CSV unquoted"</userinput>. Se <link linkend="import-text">Import</link>).

source: If <userinput>tags</userinput> is given for <replaceable>FILE</replaceable>, tags are imported from other tags. Instead of <replaceable>FORMAT-NAME</replaceable> parameters <replaceable>SOURCE</replaceable> and <replaceable>EXTRACTION</replaceable> are required, see <link linkend="import-tags">Import from Tags</link>. To apply the import from tags on the selected files, use <userinput>tagsel</userinput> instead of <userinput>tags</userinput>. This function also supports output of the extracted value by using an <replaceable>EXTRACTION</replaceable> with the value <userinput>%{__return}(.+)</userinput>.
it: Se <userinput>tags</userinput> viene fornito per <replaceable>FILE</replaceable>, i tag sono importati da altri tag. Invece di <replaceable>FORMAT-NAME</replaceable> sono richiesti i parametri <replaceable>SOURCE</replaceable> e <replaceable>EXTRACTION</replaceable>, vedere <link linkend="import-tags">Importa da tag</link >. Per applicare l'importazione dai tag sui file selezionati, utilizzare <userinput>tagsel</userinput> invece di <userinput>tag</userinput>. Questa funzione supporta anche il risultato del valore estratto utilizzando un <replaceable>EXTRACTION</replaceable> con il valore <userinput>%{__return}(.+)</userinput>.
ru: Если указать <userinput>tags</userinput> для параметра <replaceable>ФАЙЛ</replaceable>, теги будут импортированы из других тегов. Вместо параметра <replaceable>НАЗВАНИЕ-ФОРМАТА</replaceable> следует указать параметры <replaceable>ИСТОЧНИК</replaceable> и <replaceable>ИЗВЛЕЧЕНИЕ</replaceable>, подробные сведения доступны в описании функции «<link linkend="import-tags">Импорт из тегов...</link>». Чтобы применить импорт из тегов к выделенным файлам, используйте <userinput>tagsel</userinput> вместо <userinput>tags</userinput>. Эта функция также поддерживает вывод полученного значения: укажите параметр <replaceable>ИЗВЛЕЧЕНИЕ</replaceable> со значением <userinput>%{__return}(.+)</userinput>.
sv: Om <userinput>tags</userinput> anges för <replaceable>FIL</replaceable>, importeras taggar från andra taggar. Istället för <replaceable>FORMATNAMN</replaceable> krävs <replaceable>KÄLLA</replaceable> och <replaceable>EXTRAHERING</replaceable>, se <link linkend="import-tags">Import från taggar</link>. För att utföra import från taggar med de markerade filerna, använda <userinput>tagsel</userinput> istället för <userinput>tags</userinput>. Funktionen stöder också utmatning av det extraherade värdet genom att använda <replaceable>EXTRAHERING</replaceable> med värdet <userinput>%{__return}(.+)</userinput>.

source: Automatic import
it: Importazione automatica
ru: Автоматический импорт
sv: Automatisk import

source: <command>autoimport</command> <arg><replaceable>PROFILE-NAME</replaceable></arg> <arg><replaceable>TAG-NUMBERS</replaceable></arg>
it: <command>autoimport</command> <arg><replaceable>NOME-PROFILO</replaceable></arg> <arg><replaceable>NUMERI-TAG</replaceable></arg>
ru: <command>autoimport</command> <arg><replaceable>ИМЯ-ПРОФИЛЯ</replaceable></arg> <arg><replaceable>НОМЕРА-ТЕГОВ</replaceable></arg>
sv: <command>autoimport</command> <arg><replaceable>PROFILNAMN</replaceable></arg> <arg><replaceable>TAGGNUMMER</replaceable></arg>

source: Batch import using profile <replaceable>PROFILE-NAME</replaceable> (see <link linkend="batch-import">Automatic Import</link>, <userinput>"All"</userinput> is used if omitted).
it: Importazione in serie utilizzando il profilo <replaceable>PROFILE-NAME</replaceable> (vedere <link linkend="batch-import">Importazione automatica</link>, <userinput>"All"</userinput> viene utilizzato se omesso).
ru: Пакетный импорт на основе профиля <replaceable>НАЗВАНИЕ-ПРОФИЛЯ</replaceable> (смотрите описание функции «<link linkend="batch-import">Автоматический импорт</link>»; если профиль не указан, используется <userinput>«All»</userinput>).
sv: Import i bakgrunden genom att använda profilen <replaceable>PROFILNAMN</replaceable> (se <link linkend="batch-import">Automatisk import</link>, <userinput>"All"</userinput> används om utelämnat).

source: Download album cover artwork
it: Scaricare le copertine
ru: Загрузить обложку
sv: Ladda ner albumomslag

source: Set the album artwork by downloading a picture from <replaceable>URL</replaceable>. The rules defined in the <link linkend="browse_pictures">Browse Cover Art</link> dialog are used to transform general &URL;s (<abbrev>e.g.</abbrev> from Amazon) to a picture &URL;. To set the album cover from a local picture file, use the <link linkend="cli-set">set</link> command.
it: Impostare la copertina dell'album scaricando un'immagine da <replaceable>URL</replaceable>. Le regole definite nella finestra <link linkend="browse_pictures">Sfoglia copertina</link> sono utilizzate per trasformare gli &URL; generici (<abbrev>ad es.</abbrev> da Amazon) in un &URL; di un'immagine. Per impostare la copertina dell'album da un file di immagine locale, utilizzare il comando <link linkend="cli-set">set</link>.
ru: Установить обложку альбома путём загрузки изображения с адреса <replaceable>URL-адрес</replaceable>. Правила, определённые в диалоге «<link linkend="browse_pictures">Найти обложки</link>», используются для преобразования обычных &URL;-адресов (например, Amazon) в адрес изображения. Чтобы установить обложку альбома из локального файла изображения, воспользуйтесь командой <link linkend="cli-set">set</link>.
sv: Tilldela albumomslaget genom att ladda ner en bild från <replaceable>WEBBADRESS</replaceable>. Reglerna definierade i dialogrutan <link linkend="browse_pictures">Bläddra bland omslag</link> används för att översätta allmänna webbadresser (<abbrev>t.ex.</abbrev> från Amazon) till en bildwebbadress. För att tilldela albumomslaget från en lokal bildfil, använd kommandot <link linkend="cli-set">set</link>.

source: Export to file
it: Esporta su file
ru: Экспортировать в файл
sv: Exportera till fil

source: <command>export</command> <arg choice="req"><replaceable>FILE</replaceable></arg> <arg choice="req"><replaceable>FORMAT-NAME</replaceable></arg> <arg><replaceable>TAG-NUMBERS</replaceable></arg>
it: <command>export</command> <arg choice="req"><replaceable>FILE</replaceable></arg> <arg choice="req"><replaceable>NOME-FORMATO</replaceable></arg> <arg><replaceable>NUMERI -TAG</replaceable></arg>
ru: <command>export</command> <arg choice="req"><replaceable>ФАЙЛ</replaceable></arg> <arg choice="req"><replaceable>НАЗВАНИЕ-ФОРМАТА</replaceable></arg> <arg><replaceable>НОМЕРА-ТЕГОВ</replaceable></arg>
sv: <command>export</command> <arg choice="req"><replaceable>FIL</replaceable></arg> <arg choice="req"><replaceable>FORMATNAMN</replaceable></arg> <arg><replaceable>TAGGNUMMER</replaceable></arg>

source: Tags are exported to file <replaceable>FILE</replaceable> in the format with the name <replaceable>FORMAT-NAME</replaceable> (<abbrev>e.g.</abbrev> <userinput>"CSV unquoted"</userinput>, see <link linkend="export">Export</link>).
it: I tag sono esportati nel file <replaceable>FILE</replaceable> nel formato con il nome <replaceable>FORMAT-NAME</replaceable> (<abbrev>ad es.</abbrev> <userinput>«CSV non quotato»</userinput >, vedere <link linkend="export">Esportazione</link>).
ru: Экспорт тегов в файл <replaceable>ФАЙЛ</replaceable> в формате под названием <replaceable>НАЗВАНИЕ-ФОРМАТА</replaceable> (например, <userinput>«CSV unquoted»</userinput>, смотрите описание функции «<link linkend="export">Экспорт</link>»).
sv: Taggar exporteras till filen <replaceable>FIL</replaceable> på formatet vid namn <replaceable>FORMATNAMN</replaceable> (<abbrev>t.ex.</abbrev> <userinput>"CSV unquoted"</userinput>. Se <link linkend="export">Export</link>.

source: Create playlist
it: Creare una scaletta
ru: Создать список воспроизведения
sv: Skapa spellista

source: Create playlist in the format set in the configuration, see <link linkend="create-playlist">Create Playlist</link>.
it: Creare una scaletta nel formato impostato nella configurazione, vedere <link linkend="create-playlist">Creare una scaletta</link>.
ru: Создать список воспроизведения в формате, указанном в параметрах, подробные сведения доступны в описании функции «<link linkend="create-playlist">Создать список воспроизведения</link>».
sv: Skapa en spellista med formatet valt i inställningarna, se <link linkend="create-playlist">Skapa spellista</link>.

source: Apply filename format
it: Applicare il formato al nome file
ru: Применить формат имени файла
sv: Verkställ filnamnsformat

source: Apply file name format set in the configuration, see <link linkend="apply-filename-format">Apply Filename Format</link>.
it: Applicare il formato al nome file impostato nella configurazione, vedere <link linkend="apply-filename-format">Applicare il formato al nome file</link>.
ru: Применить формат имени файла, указанный в параметрах, подробные сведения доступны в описании функции «<link linkend="apply-filename-format">Применить формат имени файла</link>».
sv: Verkställ filnamnsformatet valt i inställningarna, se <link linkend="apply-filename-format">Verkställ filnamnsformat</link>.

source: Apply tag format
it: Applicare il formato al tag
ru: Применить формат тега
sv: Verkställ taggformat

source: Apply tag name format set in the configuration, see <link linkend="apply-tag-format">Apply Tag Format</link>.
it: Applicare il formato del nome del tag impostato nella configurazione, vedere <link linkend="apply-tag-format">Applica il formato al tag</link>.
ru: Применить формат тега, указанный в параметрах, подробные сведения доступны в описании функции «<link linkend="apply-tag-format">Применить формат тега</link>».
sv: Verkställ taggnamnsformatet valt i inställningarna, se <link linkend="apply-filename-format">Verkställ taggformat</link>.

source: Apply text encoding
it: Applicare la codifica del testo
ru: Применить кодировку текста
sv: Verkställ textkodning

source: Apply text encoding set in the configuration, see <link linkend="apply-text-encoding">Apply Text Encoding</link>.
it: Applicare la codifica del testo impostata nella configurazione, vedere <link linkend="apply-text-encoding">Applicare la codifica del testo</link>.
ru: Применить кодировку текста, указанную в параметрах, подробные сведения доступны в описании функции «<link linkend="apply-text-encoding">Применить кодировку текста</link>».
sv: Verkställ textkodningen vald i inställningarna, se <link linkend="apply-text-encoding">Verkställ textkodning</link>.

source: Rename folder
it: Rinominare una cartella
ru: Переименовать каталог
sv: Byt namn på katalog

source: <command>renamedir</command> <arg><replaceable>FORMAT</replaceable></arg> <group> <arg choice="plain">create</arg> <arg choice="plain">rename</arg> <arg choice="plain">dryrun</arg> </group> <arg><replaceable>TAG-NUMBERS</replaceable></arg>
it: <command>renamedir</command> <arg><replaceable>FORMATO</replaceable></arg> <group> <arg choice="plain">create</arg> <arg choice="plain">rename</arg> <arg choice="plain">dryrun</arg> </group> <arg><replaceable>NUMERI-TAG</replaceable></arg>
ru: <command>renamedir</command> <arg><replaceable>ФОРМАТ</replaceable></arg> <group> <arg choice="plain">create</arg> <arg choice="plain">rename</arg> <arg choice="plain">dryrun</arg> </group> <arg><replaceable>НОМЕРА-ТЕГОВ</replaceable></arg>
sv: <command>renamedir</command> <arg><replaceable>FORMAT</replaceable></arg> <group> <arg choice="plain">create</arg> <arg choice="plain">rename</arg> <arg choice="plain">dryrun</arg> </group> <arg><replaceable>TAGGNUMMER</replaceable></arg>

source: Rename or create folders from the values in the tags according to a given <replaceable>FORMAT</replaceable> (<abbrev>e.g.</abbrev> <userinput>%{artist} - %{album}</userinput>, see <link linkend="rename-directory">Rename Folder</link>), if no format is given, the format defined in the <guilabel>Rename folder</guilabel> dialog is used. The default mode is <option>rename</option>; to create folders, <option>create</option> must be given explicitly. The rename actions will be performed immediately, to just see what would be done, use the <option>dryrun</option> option.
it: Rinominare o creare cartelle dai valori nei tag in base a un determinato <replaceable>FORMAT</replaceable> (<abbrev>ad es.</abbrev> <userinput>%{artist} - %{album}</userinput>, vedere <link linkend="rename-directory">Rinomina cartella</link>), se non viene fornito alcun formato, viene utilizzato il formato definito nella finestra <guilabel>Rinomina cartella</guilabel>. La modalità predefinita è <option>rename</option>; per creare cartelle, <option>create</option> deve essere esplicitamente indicata. Le azioni di rinomina saranno eseguite immediatamente, per verificare ciò che dovrebbe avvenire, utilizzare l'opzione <option>dryrun</option>.
ru: Переименовать или создать каталоги на основе значений в тегах в соответствии с заданным значением параметра <replaceable>ФОРМАТ</replaceable> (например, <userinput>%{artist} - %{album}</userinput>, подробные сведения доступны в описании функции «<link linkend="rename-directory">Переименовать каталог</link>»). Если формат не задан, будет использован формат, указанный в диалоге <guilabel>Переименовать каталог</guilabel>. Режим по умолчанию — <option>rename</option>; для создания каталогов — <option>create</option> (следует указать явным образом). Действия по переименованию будут произведены немедленно; чтобы просто посмотреть, что должно быть сделано, воспользуйтесь опцией <option>dryrun</option>.
sv: Byt namn på eller skapa kataloger från värdena i taggarna enligt ett givet <replaceable>FORMAT</replaceable> (<abbrev>t.ex.</abbrev> <userinput>%{artist} - %{album}</userinput>, se <link linkend="rename-directory">Byt namn på katalog</link>). Om inget format anges, används formatet definierat i <guilabel>Byt namn på katalog</guilabel>. Standardläget är <option>rename</option>. För att skapa kataloger måste <option>create</option> explicit användas. Namnbytesåtgärderna utförs omedelbart, för att bara se vad som skulle göras, använd väljaren <option>dryrun</option>.

source: Number tracks
it: Numera le tracce
ru: Пронумеровать дорожки
sv: Numrera spår

source: <command>numbertracks</command> <arg><replaceable>TRACK-NUMBER</replaceable></arg> <arg><replaceable>TAG-NUMBERS</replaceable></arg>
it: <command>numbertracks</command> <arg><replaceable>NUMERO-TRACCIA</replaceable></arg> <arg><replaceable>NUMERI-TAG</replaceable></arg>
ru: <command>numbertracks</command> <arg><replaceable>НОМЕР-ДОРОЖКИ</replaceable></arg> <arg><replaceable>НОМЕРА-ТЕГОВ</replaceable></arg>
sv: <command>numbertracks</command> <arg><replaceable>SPÅRNUMMER</replaceable></arg> <arg><replaceable>TAGGNUMMER</replaceable></arg>

source: Number the selected tracks starting with <replaceable>TRACK-NUMBER</replaceable> (<literal>1</literal> if omitted).
it: Numerare le tracce selezionate che iniziano con <replaceable>TRACK-NUMBER</replaceable> (<literal>1</literal> se omesso).
ru: Пронумеровать выделенные дорожки, начиная с номера <replaceable>НОМЕР-ДОРОЖКИ</replaceable> (если параметр не указан, нумерация начнётся с цифры <literal>1</literal>).
sv: Numrera de markerade spåren med början på <replaceable>SPÅRNUMMER</replaceable> (<literal>1</literal> om utelämnat).

source: Filter
it: Filtro
ru: Фильтр
sv: Filtrera

source: <command>filter</command> <group> <arg choice="plain"><replaceable>FILTER-NAME</replaceable></arg> <arg choice="plain"><replaceable>FILTER-FORMAT</replaceable></arg> </group>
it: <command>filter</command> <group> <arg choice="plain"><replaceable>NOME-FILTRO</replaceable></arg> <arg choice="plain"><replaceable>FORMATO FILTRO</replaceable></arg> </group>
ru: <command>filter</command> <group> <arg choice="plain"><replaceable>ИМЯ-ФИЛЬТРА</replaceable></arg> <arg choice="plain"><replaceable>ФОРМАТ-ФИЛЬТРА</replaceable></arg> </group>
sv: <command>filter</command> <group> <arg choice="plain"><replaceable>FILTERNAMN</replaceable></arg> <arg choice="plain"><replaceable>FILTERFORMAT</replaceable></arg> </group>

source: Filter the files so that only the files matching the <replaceable>FILTER-FORMAT</replaceable> are visible. The name of a predefined filter expression (<abbrev>e.g.</abbrev> <userinput>"Filename Tag Mismatch"</userinput>) can be used instead of a filter expression, see <link linkend="filter">Filter</link>.
it: Filtrare i file in modo che siano visibili solo i file corrispondenti a <replaceable>FILTER-FORMAT</replaceable>. È possibile utilizzare il nome di un'espressione di filtro predefinita (<abbrev>ad es.</abbrev> <userinput>«Mancata corrispondenza tra nome file e tag»</userinput>) anziché un'espressione di filtro, vedere <link linkend="filter">Filtro</link>.
ru: Отфильтровать файлы таким образом, чтобы отобразились только файлы, соответствующие фильтру <replaceable>ФОРМАТ-ФИЛЬТРА</replaceable>. Вместо выражения фильтра возможно использовать название предустановленного фильтра (например, <userinput>«Несоответствие тега названию файла»</userinput>), подробные сведения доступны в описании функции «<link linkend="filter">Фильтр</link>».
sv: Filtrera filerna så att bara filerna som matchar <replaceable>FILTERFORMAT</replaceable> är synliga. Namnet på ett fördefinierat filteruttryck (<abbrev>t.ex.</abbrev> <userinput>"Filnamn tagg missanpassning"</userinput>) kan användas istället för att filteruttryck, se <link linkend="filter">Filter</link>.

source: Convert ID3v2.3 to ID3v2.4
it: Convertire ID3v2.3 in ID3v2.4
ru: Преобразовать ID3v2.3 в ID3v2.4
sv: Konvertera ID3v2.3 till ID3v2.4

source: Convert ID3v2.4 to ID3v2.3
it: Convertire ID3v2.4 in ID3v2.3
ru: Преобразовать ID3v2.4 в ID3v2.3
sv: Konvertera ID3v2.4 till ID3v2.3

source: Filename from tag
it: Nome file da tag
ru: Имя файла из тега
sv: Filnamn från tagg

source: <command>fromtag</command> <arg><replaceable>FORMAT</replaceable></arg> <arg><replaceable>TAG-NUMBERS</replaceable></arg>
it: <command>fromtag</command> <arg><replaceable>FORMATO</replaceable></arg> <arg><replaceable>NUMERI-TAG</replaceable></arg>
ru: <command>fromtag</command> <arg><replaceable>ФОРМАТ</replaceable></arg> <arg><replaceable>НОМЕРА-ТЕГОВ</replaceable></arg>
sv: <command>fromtag</command> <arg><replaceable>FORMAT</replaceable></arg> <arg><replaceable>TAGGNUMMER</replaceable></arg>

source: Set the file names of the selected files from values in the tags, for example <userinput>fromtag '%{track} - %{title}' 1</userinput>. If no format is specified, the format set in the &GUI; is used.
it: Impostare i nomi dei file selezionati dai valori nei tag, ad esempio <userinput>fromtag '%{track} - %{title}' 1</userinput>. Se non si specifica alcun formato, è utilizzato invece il formato impostato nella &GUI;.
ru: Указать имена выбранных файлов на основе тегов, например, <userinput>fromtag '%{track} - %{title}' 1</userinput>. Если формат не указан, будет использоваться формат, установленный в графическом интерфейсе.
sv: Ställ in filnamn för markerade filer från värden i taggarna, exempelvis <userinput>fromtag '%{track} - %{title}' 1</userinput>. Om inget format anges, används formatet som ställts in i det grafiska användargränssnittet.

source: Tag from filename
it: Tag da nome file
ru: Тег из имени файла
sv: Tagg från filnamn

source: <command>totag</command> <arg><replaceable>FORMAT</replaceable></arg> <arg><replaceable>TAG-NUMBERS</replaceable></arg>
it: <command>totag</command> <arg><replaceable>FORMATO</replaceable></arg> <arg><replaceable>NUMERI-TAG</replaceable></arg>
ru: <command>totag</command> <arg><replaceable>ФОРМАТ</replaceable></arg> <arg><replaceable>НОМЕРА-ТЕГОВ</replaceable></arg>
sv: <command>totag</command> <arg><replaceable>FORMAT</replaceable></arg> <arg><replaceable>TAGGNUMMER</replaceable></arg>
