Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: To list the titles in the tags 2 of all files in the current folder, the following script could be used:
it: Per elencare i titoli nei tag 2 di tutti i file nella cartella attuale, è possibile utilizzare il seguente script:
ru: Чтобы получить список заголовков тегов 2 из всех файлов в текущем каталоге, воспользуйтесь следующим сценарием:
sv: För att lista titlarna i tagg 2 för alla filer i aktuell katalog, skulle följande skript kunna användas:

source: import Kid3 1.0 Kid3Script { onRun: { app.firstFile() do { if (app.selectionInfo.tag(Frame.Tag_2).tagFormat) { console.log(app.getFrame(tagv2, "title")) } } while (app.nextFile()) } }
it: import Kid3 1.0 Kid3Script { onRun: { app.firstFile() do { if (app.selectionInfo.tag(Frame.Tag_2).tagFormat) { console.log(app.getFrame(tagv2, "titolo")) } } while (app.nextFile()) } }

source: If the folder contains many files, such a script might block the user interface for some time. For longer operations, it should therefore have a break from time to time. The alternative implementation below has the work for a single file moved out into a function. This function invokes itself with a timeout of 1 ms at the end, given that more files have to be processed. This will ensure that the &GUI; remains responsive while the script is running.
it: Se la cartella contiene molti file, uno script del genere potrebbe bloccare l'interfaccia utente per qualche tempo. Per operazioni più lunghe, dovrebbe quindi avere una pausa di tanto in tanto. L'implementazione alternativa di seguito ha il compito per un singolo file spostato in una funzione. Questa funzione si richiama alla fine con un timeout di 1 ms, dato che è necessario elaborare più file. Questo assicurerà che la &GUI; rimanga reattiva mentre lo script è in esecuzione.
ru: Если каталог содержит большое количество файлов, такой сценарий может на некоторое время заблокировать возможность использования интерфейса, поэтому для выполнения длительных действий следует периодически прерывать работу сценария. В альтернативном варианте, который приводится далее, обработка отдельного файла вынесена в функцию. В конце эта функция вызывает себя со временем ожидания в 1 миллисекунду, если имеются другие файлы, которые следует обработать. Такая реализация позволяет продолжать работать с графическим интерфейсом во время работы сценария.
sv: Om katalogen innehåller många filer, ett sådant skript kan blockera användargränssnittet under en viss tid. För längre åtgärder, bör det därför ta en paus då och då. Den alternativa implementeringen nedan har flyttat ut arbetet för en enstaka fil till en funktion. Funktionen aktiverar sig själv med en 1 ms tidsgräns i slutet, under förutsättning att flera filer måste behandlas. Det säkerställer att det grafiska användargränssnittet förblir mottagligt medan skriptet kör.

source: import Kid3 1.0 Kid3Script { onRun: { function doWork() { if (app.selectionInfo.tag(Frame.Tag_2).tagFormat) { console.log(app.getFrame(tagv2, "title")) } if (!app.nextFile()) { Qt.quit() } else { setTimeout(doWork, 1) } } app.firstFile() doWork() } }
it: import Kid3 1.0 Kid3Script { onRun: { function doWork() { if (app.selectionInfo.tag(Frame.Tag_2).tagFormat) { console.log(app.getFrame(tagv2, "titolo")) } if (!app.nextFile()) { Qt.quit() } else { setTimeout(doWork, 1) } } app.firstFile() doWork() } }

source: When using <command>app.firstFile()</command> with <command>app.nextFile()</command>, all files of the current folder will be processed. If only the selected files shall be affected, use <command>firstFile()</command> and <command>nextFile()</command> instead, these are convenience functions of the <classname>Kid3Script</classname> component. The following example is a script which copies only the disc number and copyright frames of the selected file.
it: Quando si utilizza <command>app.firstFile()</command> con <command>app.nextFile()</command>, saranno elaborati tutti i file della cartella attuale. Se sono interessati solo i file selezionati, utilizzare invece <command>firstFile()</command> e <command>nextFile()</command>, queste sono funzioni utili del componente <classname>Kid3Script</classname>. L'esempio seguente è uno script che copia solo il numero del disco e i frame del copyright del file selezionato.
ru: При использовании команды <command>app.firstFile()</command> вместе с командой <command>app.nextFile()</command> будут обработаны все файлы в текущем каталоге. Если требуется обработка только выделенных файлов, воспользуйтесь командами <command>firstFile()</command> и <command>nextFile()</command>, вспомогательными функциями компонента <classname>Kid3Script</classname>. В следующем примере представлен сценарий, который копирует только фреймы номера диска и авторских прав выделенного файла.
sv: Vid användning av <command>app.firstFile()</command> med <command>app.nextFile()</command>, processas alla filer i den aktuella katalogen. Om bara de markerade filerna ska påverkas, använd istället <command>firstFile()</command> och <command>nextFile()</command>, som är bekvämlighetsfunktioner i komponenten <classname>Kid3Script</classname>. Följande exempel är ett skript som bara kopierar den markerade filens skivnummer- och copyrightram.

source: More example scripts come with &kid3; and are already registered as user commands.
it: Altri script di esempio sono forniti da &kid3; e sono già registrati come comandi dell'utente.
ru: Другие примеры сценариев поставляются вместе с &kid3; в качестве команд пользователя.
sv: Fler exempelskript levereras med &kid3; och är redan registrerade som användarkommandon.

source: <guilabel>ReplayGain to SoundCheck</guilabel> (<filename>ReplayGain2SoundCheck.qml</filename>): Create iTunNORM SoundCheck information from replay gain frames.
it: <guilabel>ReplayGain in SoundCheck</guilabel> (<filename>ReplayGain2SoundCheck.qml</filename>): creare informazioni iTunNORM SoundCheck dai frame del guadagno di riproduzione.
ru: <guilabel>ReplayGain to SoundCheck</guilabel> (<filename>ReplayGain2SoundCheck.qml</filename>): создаёт данные для iTunNORM SoundCheck на основе фреймов данных о выравнивании громкости.
sv: <guilabel>ReplayGain till SoundCheck</guilabel> (<filename>ReplayGain2SoundCheck.qml</filename>): Skapa iTunNORM SoundCheck information från ramar med uppspelningsförstärkning.

source: <guilabel>Resize Album Art</guilabel> (<filename>ResizeAlbumArt.qml</filename>): Resize embedded cover art images which are larger than 500x500 pixels.
it: <guilabel>Ridimensionare le copertine degli album</guilabel> (<filename>ResizeAlbumArt.qml</filename>): ridimensionare le immagini di copertina integrate che sono più grandi di 500x500 pixel.
ru: <guilabel>Resize Album Art</guilabel> (<filename>ResizeAlbumArt.qml</filename>): изменяет размеры встроенных изображений обложек альбомов, если эти размеры превышают 500x500 пикселов.
sv: <guilabel>Ändra storlek på omslag</guilabel> (<filename>ResizeAlbumArt.qml</filename>): Ändra storlek på inbäddade omslagsbilder som är större än 500 x 500 bildpunkter.

source: <guilabel>Extract Album Art</guilabel> (<filename>ExtractAlbumArt.qml</filename>): Extract all embedded cover art pictures avoiding duplicates.
it: <guilabel>Estrarre le copertine degli album</guilabel> (<filename>ExtractAlbumArt.qml</filename>): estrarre le immagini di copertina integrate evitando i duplicati.
ru: <guilabel>Extract Album Art</guilabel> (<filename>ExtractAlbumArt.qml</filename>): извлекает все встроенные изображения обложек без создания дубликатов.
sv: <guilabel>Extrahera omslag</guilabel> (<filename>ExtractAlbumArt.qml</filename>): Extrahera alla inbäddade omslagsbilder och undvik dubbletter.

source: <guilabel>Embed Album Art</guilabel> (<filename>EmbedAlbumArt.qml</filename>): Embed cover art found in image files into audio files in the same folder.
it: <guilabel>Integrare le copertine degli album</guilabel> (<filename>EmbedAlbumArt.qml</filename>): integrare le copertine trovate nei file di immagine trovati nei file audio nella stessa cartella.
ru: <guilabel>Embed Album Art</guilabel> (<filename>EmbedAlbumArt.qml</filename>): встраивает изображение обложки альбома из файлов изображений в аудиофайлы в том же каталоге.
sv: <guilabel>Inbädda omslag</guilabel> (<filename>EmbedAlbumArt.qml</filename>): Inbädda omslag funna i bildfiler till ljudfiler i samma katalog.

source: <guilabel>Embed Lyrics</guilabel> (<filename>EmbedLyrics.qml</filename>): Fetch unsynchronized lyrics from web service.
it: <guilabel>Integrare i testi</guilabel> (<filename>EmbedLyrics.qml</filename>): recuperare i testi non sincronizzati da un servizio web.
ru: <guilabel>Embed Lyrics</guilabel> (<filename>EmbedLyrics.qml</filename>): получает несинхронизированный текст песни из веб-сервиса.
sv: <guilabel>Inbädda sångtexter</guilabel> (<filename>EmbedLyrics.qml</filename>): Hämta osynkroniserade sångtexter från webbtjänst.

source: <guilabel>Text Encoding ID3v1</guilabel> (<filename>ShowTextEncodingV1.qml</filename>): Helps to find the encoding of ID3v1 tags by showing the tags of the current file in all available character encodings.
it: <guilabel>Codifica del testo ID3v1</guilabel> (<filename>ShowTextEncodingV1.qml</filename>): aiuta a trovare la codifica dei tag ID3v1 mostrando i tag del file attuale in tutte le codifiche di caratteri disponibili.
ru: <guilabel>Text Encoding ID3v1</guilabel> (<filename>ShowTextEncodingV1.qml</filename>): помогает определить кодировку тегов ID3v1, отображая содержание тегов в текущем файле во всех доступных кодировках.
sv: <guilabel>Textkodning ID3v1</guilabel> (<filename>ShowTextEncodingV1.qml</filename>): Hjälper till att hitta kodning av ID3v1-taggar genom att visa den aktuella filens taggar med alla tillgängliga teckenkodningar.

source: <guilabel>ID3v1 to ASCII</guilabel> (<filename>Tag1ToAscii.qml</filename>): Transliterate extended latin characters in the ID3v1 tag to ASCII.
it: <guilabel>ID3v1 a ASCII</guilabel> (<filename>Tag1ToAscii.qml</filename>): Traslitterare caratteri latini estesi nel tag ID3v1 in ASCII.
ru: <guilabel>ID3v1 to ASCII</guilabel> (<filename>Tag1ToAscii.qml</filename>): преобразовывает все дополнительные символы латиницы в тегах ID3v1 в символы ASCII.
sv: <guilabel>ID3v1 till ASCII</guilabel> (<filename>Tag1ToAscii.qml</filename>): Omvandlar utökade latinska tecken i ID3v1-taggar till ASCII.

source: <guilabel>English Title Case</guilabel> (<filename>TitleCase.qml</filename>): Formats text in the tags to English title case.
it: <guilabel>Maiuscole dei titoli inglesi</guilabel> (<filename>TitleCase.qml</filename>): Formatta il testo nei tag in con i criteri inglesi di utilizzo delle maiuscole nei titoli.
ru: <guilabel>English Title Case</guilabel> (<filename>TitleCase.qml</filename>): форматирует текст в тегах по правилам использования регистра символов английского языка.
sv: <guilabel>Engelskt titelskiftläge</guilabel> (<filename>TitleCase.qml</filename>): Formaterar texten i taggarna med engelskt titelskiftläge.

source: <guilabel>Rewrite Tags</guilabel> (<filename>RewriteTags.qml</filename>): Rewrite all tags in the selected files.
it: <guilabel>Riscrivi tag</guilabel> (<filename>RewriteTags.qml</filename>): Riscrivi tutti i tag dei file selezionati.
ru: <guilabel>Rewrite Tags</guilabel> (<filename>RewriteTags.qml</filename>): перезаписывает все теги в выделенных файлах.
sv: <guilabel>Skriv om taggar</guilabel> (<filename>RewriteTags.qml</filename>): Skriv om alla taggar i de markerade filerna.

source: <guilabel>Export CSV</guilabel> (<filename>ExportCsv.qml</filename>): Export recursively all tags of all files to a CSV file.
it: <guilabel>Esporta CSV</guilabel> (<filename>ExportCsv.qml</filename>): Esporta ricorsivamente tutti i tag di tutti i file in una file CSV.
ru: <guilabel>Export CSV</guilabel> (<filename>ExportCsv.qml</filename>): рекурсивно экспортирует все теги во всех файлах в файл CSV.
sv: <guilabel>Exportera CSV</guilabel> (<filename>ExportCsv.qml</filename>): Exportera rekursivt alla taggar för alla filer till en CSV-fil.

source: <guilabel>Export Playlist Folder</guilabel> (<filename>ExportPlaylist.qml</filename>): Copy all files from a playlist into a folder and rename them according to their position.
it: <guilabel>Esportare la cartella della scaletta</guilabel> (<filename>ExportPlaylist.qml</filename>): copiare tutti i file di una scaletta in una cartella e rinominarli in base alla loro posizione.
ru: <guilabel>Export Playlist Folder</guilabel> (<filename>ExportPlaylist.qml</filename>): копирует все файлы из списка воспроизведения в каталог и переименовывает их в соответствии с их положением в списке.
sv: <guilabel>Exportera spellistekatalog</guilabel> (<filename>ExportPlaylist.qml</filename>): Kopiera alla filer från en spellista till en katalog och byt namn på dem enligt deras position.

source: <guilabel>QML Console</guilabel> (<filename>QmlConsole.qml</filename>): Simple console to play with &kid3;'s QML API.
it: <guilabel>QML Console</guilabel> (<filename>QmlConsole.qml</filename>): Semplice console per fare pratica con le API QML di &kid3;.
ru: <guilabel>QML Console</guilabel> (<filename>QmlConsole.qml</filename>): вызывает простую консоль для работы с программным интерфейсом QML &kid3;.
sv: <guilabel>QML-terminal</guilabel> (<filename>QmlConsole.qml</filename>): Enkel terminal för att leka med &kid3;s QML programmeringsgränssnitt.

source: QML API
it: API QML
ru: Программный интерфейс QML
sv: QML-programmeringsgränssnitt

source: The API can be easily explored using the QML Console, which is available as an example script with a user interface.
it: L'API può essere facilmente esplorata utilizzando la console QML, disponibile come script di esempio con un'interfaccia utente.
ru: С программным интерфейсом возможно ознакомиться во время использования консоли QML, которая доступна в качестве примера сценария с пользовательским интерфейсом.
sv: Programmeringsgränssnittet kan enkelt utforskas genom att använda QML-terminalen, som är tillgänglig som ett exempelskript med ett användargränssnitt.

source: <classname>Kid3Script</classname> is a regular QML component located inside the plugin folder. You could use another QML component just as well. Using <classname>Kid3Script</classname> makes it easy to start the script function using the <function>onRun</function> signal handler. Moreover it offers some functions:
it: <classname>Kid3Script</classname> è un normale componente QML situato nella cartella delle estensioni. È possibile utilizzare anche un altro componente QML. L'uso di <classname>Kid3Script</classname> semplifica l'avvio della funzione di script utilizzando il gestore di segnali <function>onRun</function>. Inoltre offre alcune funzioni:
ru: <classname>Kid3Script</classname> — это обычный компонент QML, расположенный в каталоге модуля. Возможно использовать и любой другой компонент QML. Использование <classname>Kid3Script</classname> упрощает запуск функции сценария с помощью обработчика сигналов <function>onRun</function>. Кроме того, он предлагает несколько функций:
sv: <classname>Kid3Script</classname> är en vanlig QML-komponent som finns i katalogen med insticksprogram. Du skulle lika enkelt kunna använda en annan QML-komponent. Genom att använda <classname>Kid3Script</classname> blir det enkelt att starta skriptfunktionen med signalhanteraren <function>onRun</function>. Dessutom erbjuder den några funktioner:

source: onRun: Signal handler which is invoked when the script is started tagv1, tagv2, tagv2v1: Constants for tag parameters script: Access to scripting functions configs: Access to configuration objects getArguments(): List of script arguments isStandalone(): true if the script was not started from within Kid3 setTimeout(callback, delay): Starts callback after delay ms firstFile(): To first selected file nextFile(): To next selected file
it: onRun: gestore dei segnali che è invocato quando lo script è avviato tagv1, tagv2, tagv2v1: costanti per i parametri dei tag script: accesso alle funzioni di scripting configs: accesso agli oggetti di configurazione getArguments(): elenco degli argomenti degli script isStandalone(): vero se lo script non era stato avviato dall'interno di Kid3 setTimeout(callback, ritardo): avvia callback dopo ms di ritardo firstFile(): al primo file selezionato nextFile(): al successivo file selezionato
ru: onRun: обработчик сигналов, который вызывается при запуске сценария tagv1, tagv2, tagv2v1: постоянные для параметров тегов script: доступ к функциям сценариев configs: доступ к объектам конфигурации getArguments(): список аргументов сценария isStandalone(): true, если сценарий был запущен не в Kid3 setTimeout(callback, delay): запуск обратного вызова после задержки, указанной в миллисекундах firstFile(): к первому выделенному файлу nextFile(): к следующему выделенному файлу
sv: onRun: Signalhanterare som anropas när skriptet startas tagv1, tagv2, tagv2v1: Konstanter för taggparametrar script: Åtkomst till skriptfunktioner configs: Åtkomst till inställningsobjekt getArguments(): Lista över skripargument isStandalone(): true om skriptet inte startades inifrån Kid3 setTimeout(callback, delay): Startar återanrop efter delay ms firstFile(): Till första markerade fil nextFile(): Till nästa markerade fil

source: Scripting Functions
it: Funzioni per creare script
ru: Поддержка сценариев
sv: Skriptfunktioner

source: As &javascript; and therefore QML too has only a limited set of functions for scripting, the <function>script</function> object has some additional methods, for instance:
it: Come &javascript; e quindi anche QML ha solo un insieme limitato di funzioni per gli script, l'oggetto <function>script</function> ha alcuni metodi aggiuntivi, ad esempio:
ru: В &javascript; и QML предусмотрен довольно ограниченный набор функций. Объект <function>script</function> имеет несколько дополнительных методов, в частности:
sv: Eftersom &javascript; och därför också QML bara har en begränsad uppsättning funktioner för skript, har objektet <function>script</function> några ytterligare metoder, exempelvis:
