Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: The list of custom genres can also be used to reduce the number of genres available in the <guilabel>Genre</guilabel> combo box to those typically used. If your collection mostly contains music in the genres Metal, Gothic Metal, Ancient and Hard Rock, you can enter those genres and mark <guilabel>Show only custom genres</guilabel>. The <guilabel>Tag 2</guilabel> <guilabel>Genre</guilabel> combo box will then only contain those four genres and you will not have to search through the complete genres list for them. In this example, only Metal and Hard Rock will be listed in the tag 1 genres list, because those two custom genres entries are standard genres. If <guilabel>Show only custom genres</guilabel> is not active, the custom genres can be found at the end of the genres list.
it: L'elenco di generi personalizzati può anche essere utilizzato per ridurre il numero di generi disponibili nella casella combinata <guilabel>Genere</guilabel> a quelli normalmente utilizzati. Se la propria raccolta contiene principalmente musica nei generi Metal, Gothic Metal, Ancient e Hard Rock, è possibile inserire quei generi e marcare <guilabel>Mostra solo generi personalizzati</guilabel>. La casella combinata <guilabel>Tag 2</guilabel> <guilabel>Genere</guilabel> conterrà quindi solo quei quattro generi e non sarà necessario cercarli nell'elenco completo dei generi. In questo esempio, solo Metal e Hard Rock saranno elencati nell'elenco dei generi di tag 1, poiché queste due voci di generi personalizzati sono generi standard. Se <guilabel>Mostra solo generi personalizzati</guilabel> non è attiva, i generi personalizzati possono essere trovati alla fine dell'elenco dei generi.
ru: Список пользовательских жанров также возможно использовать для сокращения количества вариантов в раскрывающемся списке <guilabel>Жанр</guilabel> до тех, которые используются чаще всего. Например, если коллекция в основном содержит музыку в жанрах «Metal», «Gothic Metal», «Ancient» и «Hard Rock», внесите жанры в этот список и установите флажок <guilabel>Показывать только пользовательские жанры</guilabel>. Тогда раскрывающийся список <guilabel>Жанр</guilabel> в разделе <guilabel>Тег 2</guilabel> будет содержать только эти четыре жанра, и искать их в полном списке не понадобится. В таком примере в списке жанров тега 1 будут отображаться только «Metal» и «Hard Rock», потому что эти два пользовательских жанра являются стандартными жанрами. Если флажок <guilabel>Показывать только пользовательские жанры</guilabel> не установлен, пользовательские жанры будут расположены в конце списка жанров.
sv: Listan över egna genrer kan också användas för att reducera antalet genrer tillgängliga i kombinationsrutan <guilabel>Genre</guilabel> till de som typiskt används. Om din samling innehåller mest musik i genrerna Metal, Gothic Metal, Ancient och Hard Rock, kan du mata in dessa genrerna och markera <guilabel>Visa bara egna genrer</guilabel>. Kombinationsrutan <guilabel>Tagg 2</guilabel> <guilabel>Genre</guilabel> innehåller då bara de fyra genrerna och du behöver inte söka igenom den fullständiga genrelistan för att hitta dem. I det här exemplet listas bara Metal och Hard Rock i genrelistan för tagg 1, eftersom dessa två egna genrer är standardgenrer. Om <guilabel>Visa bara egna genrer</guilabel> inte är aktiverad, hittar man de egna genrerna i slutet av genrelistan.

source: <guilabel>Quick Access Frames</guilabel> defines which frame types are always shown in the <link linkend="tag2">Tag 2</link> section. Such frames can then be added without first using the <guibutton>Add</guibutton> button. The order of these quick access frames can be changed by dragging and dropping items.
it: <guilabel>Frame di accesso rapido</guilabel> definisce quali tipi di frame sono mostrati sempre nella sezione <link linkend="tag2">Tag 2</link>. Tali frame possono quindi essere aggiunti senza prima utilizzare il pulsante <guibutton>Aggiungi</guibutton>. L'ordine di questi frame di accesso rapido può essere modificato trascinando gli elementi.
ru: Раздел <guilabel>Фреймы быстрого доступа</guilabel> позволяет указать, какие типы фреймов следует всегда отображать в разделе <link linkend="tag2">Тег 2</link>. Такие фреймы затем можно будет добавить без предварительного использования кнопки <guibutton>Добавить</guibutton>. Чтобы изменить порядок фреймов быстрого доступа, воспользуйтесь функцией перетаскивания
sv: <guilabel>Snabbåtkomstramar</guilabel> definierar vilka ramtyper som alltid visas i sektionen <link linkend="tag2">Tagg 2</link>. Sådana ramar kan därefter läggas till utan att först använda knappen <guibutton>Lägg till</guibutton>. Ordningen på snabbåtkomstramarna kan ändras genom att dra och släppa objekt.

source: The combo box <guilabel>Track number field name</guilabel> is only relevant for RIFF INFO and sets the name of the field used for track numbers. Track numbers are not specified in the original RIFF standard, there are applications which use "<literal>ITRK</literal>", others use "<literal>IPRT</literal>".
it: La casella combinata <guilabel>Nome campo numero traccia</guilabel> è rilevante solo per RIFF INFO e imposta il nome del campo utilizzato per i numeri di traccia. I numeri di traccia non sono specificati nello standard RIFF originale, ci sono applicazioni che utilizzano «<literal>ITRK</literal>», altri utilizzano «<literal>IPRT</literal>».
ru: Значение в раскрывающемся списке <guilabel>Имя поля номера дорожки</guilabel> используется только для данных RIFF INFO. С его помощью возможно указать название поля, используемого для номеров дорожек. Название поля номера дорожки не определено в исходном стандарте RIFF. В некоторых программах используется «<literal>ITRK</literal>», в других — «<literal>IPRT</literal>».
sv: Kombinationsrutan <guilabel>Spårnummerfältnamn</guilabel> är bara relevant för RIFF INFO och ställer in namnet på fältet som används för spårnummer. Spårnummer är inte specificerade i den ursprungliga RIFF-standarden. Det finns program som använder "<literal>ITRK</literal>" och andra som använder "<literal>IPRT</literal>".

source: <guilabel>Tag Format</guilabel> contains options for the format of the tags. When <guilabel>Automatically apply format</guilabel> is checked, the format configuration is automatically used while editing text in the line edits. <guilabel>Validation</guilabel> enables validators in the controls with track/total and date/time values. The <guilabel>Case conversion</guilabel> can be set to <guilabel>No changes</guilabel>, <guilabel>All lowercase</guilabel>, <guilabel>All uppercase</guilabel>, <guilabel>First letter uppercase</guilabel> or <guilabel>All first letters uppercase</guilabel>. To use locale-aware conversion between lowercase and uppercase characters, a locale can be selected in the combobox below. The string replacement list can be set to arbitrary string mappings. To add a new mapping, select the <guilabel>From</guilabel> cell of a row and insert the text to replace, then go to the <guilabel>To</guilabel> column and enter the replacement text. When the text to replace starts and ends with a slash ("/"), a regular expression is used. For regular expressions containing capturing groups, occurrences of \1, \2, ... in <guilabel>To</guilabel> are replaced with the string captured by the corresponding capturing group. To remove a mapping set the <guilabel>From</guilabel> cell to an empty value (<abbrev>e.g.</abbrev> by first typing space and then backspace). Inserting and deleting rows is also possible using a context menu which appears when the <mousebutton>right</mousebutton> mouse button is clicked. Replacement is only active, if the <guilabel>String replacement</guilabel> check box is checked.
it: <guilabel>Formato tag</guilabel> contiene opzioni per il formato dei tag. Quando è selezionato <guilabel>Applica automaticamente il formato</guilabel>, la configurazione del formato viene utilizzata automaticamente durante la modifica del testo nei campi di testo. <guilabel>Convalida</guilabel> abilita validatori nei controlli con i valori di traccia/totale e data/ora. <guilabel>Maiuscole/minuscole</guilabel> può essere impostato su <guilabel>Nessuna modifica</guilabel>, <guilabel>Tutte minuscole</guilabel>, <guilabel>Tutte maiuscole</guilabel>, <guilabel>Prima lettera maiuscola</guilabel> o <guilabel>Tutte le prime lettere maiuscole</guilabel>. Per utilizzare una conversione basata sulla localizzazione tra caratteri minuscoli e maiuscoli, è possibile selezionare una localizzazione nella casella combinata di seguito. L'elenco di sostituzione delle stringhe può essere impostato su associazioni di stringhe arbitrarie. Per aggiungere una nuova associazione, selezionare la cella <guilabel>Da</guilabel> di una riga e inserire il testo da sostituire, quindi portarsi sulla colonna <guilabel>A</guilabel> e inserire il testo sostitutivo. Quando il testo da sostituire inizia e termina con una barra ("/"), viene utilizzata un'espressione regolare. Per le espressioni regolari contenenti gruppi di acquisizione, le occorrenze di \1, \2, ... in <guilabel>A</guilabel> vengono sostituite con la stringa acquisita dal gruppo di acquisizione corrispondente. Per rimuovere un'associazione impostare la cella <guilabel>Da</guilabel> su un valore vuoto (<abbrev>ad es.</abbrev> digitando prima lo spazio e poi il backspace). L'inserimento e l'eliminazione di righe è anche possibile utilizzando un menu di scelta rapida che viene visualizzato quando si fa clic sul pulsante <mousebutton>destro</mousebutton>. La sostituzione è attiva solo se la casella di selezione <guilabel>Sostituzione stringa</guilabel> è marcata.
ru: Раздел <guilabel>Формат тега</guilabel> содержит параметры для форматирования тегов. Если установлен флажок <guilabel>Автоматически применять формат</guilabel>, заданные параметры форматирования будут автоматически применяться при правке текста в строках редактирования. Флажок <guilabel>Проверка</guilabel> включает или отключает средства проверки значений номера дорожки по общему количеству дорожек и значений даты и времени. Раскрывающийся список <guilabel>Преобразование регистра</guilabel> позволяет выбрать один из вариантов изменения регистра: <guilabel>Нет изменений</guilabel>, <guilabel>Все строчные</guilabel>, <guilabel>Все прописные</guilabel>, <guilabel>Первая буква — прописная</guilabel> или <guilabel>Все первые буквы — прописные</guilabel>. Чтобы использовать локаль для преобразования букв между верхним и нижним регистром, воспользуйтесь расположенным ниже раскрывающимся списком. Список заменителей позволяет настроить произвольное преобразование строк. Чтобы добавить новое сопоставление, выделите ячейку в столбце <guilabel>Из</guilabel>, вставьте в неё текст, который следует заменить, затем перейдите к соответствующей ячейке в столбце <guilabel>В</guilabel> и вставьте в неё замещающий текст. Если текст, который следует заменить, начинается и заканчивается символом косой черты «/», предполагается, что использовано регулярное выражение. Для регулярных выражений, содержащих группы захвата в круглых скобках, соответствующие им заменители \1, \2, ... в ячейке столбца <guilabel>В</guilabel> заменяются строкой, захваченной соответствующей группой захвата. Чтобы удалить соответствие, укажите в поле <guilabel>Из</guilabel> пустое значение (например, нажав клавишу пробела, а затем клавишу Backspace). Добавить или удалить строки также возможно с помощью контекстного меню, которое вызывается щелчком правой кнопки мыши. Замена выполняется только в том случае, если установлен флажок <guilabel>Замена строк</guilabel>.
sv: <guilabel>Taggformat</guilabel> innehåller alternativ för taggarnas format. När <guilabel>Verkställ format automatiskt</guilabel> är markerat, används formatinställningen automatiskt när text ändras i redigeringsrader. <guilabel>Validering</guilabel> aktiverar validering i rutorna med värden för spår/totalt och datum/tid. <guilabel>Skiftlägeskonvertering</guilabel> kan ställas in till <guilabel>Ingen ändringar</guilabel>, <guilabel>Bara små bokstäver</guilabel>, <guilabel>Bara stora bokstäver</guilabel>, <guilabel>Första bokstaven stor bokstav</guilabel> eller <guilabel>Alla första bokstäver stora</guilabel>. För att använda konvertering mellan små och stora bokstäver som känner till landsinställningar, kan en landsinställning väljas i kombinationsrutan nedanför. Strängersättningslistan kan ställas in till godtyckliga strängavbildningar. För att lägga till en ny avbildning, markera cellen <guilabel>Från</guilabel> på en rad och infoga texten att ersätta, och gå sedan till kolumnen <guilabel>Till</guilabel> och skriv in ersättningstexten. När texten att ersätta börjar och slutar med ett snedstreck ("/"), används ett reguljärt uttryck. För reguljära uttryck som innehåller infångningsgrupper, ersätts förekomster av \1, \", ... i <guilabel>Till</guilabel> ersätts av strängen som representeras av motsvarande infångningsgrupp. För att ta bort en avbildning, ändra cellen <guilabel>Från</guilabel> till ett tomt värde (<abbrev>t.ex.</abbrev> genom att först skriva in ett mellanslag och sedan ett baksteg). Att infoga och ta bort rader är också möjligt med en sammanhangsberoende meny som dyker upp när <mousebutton>höger</mousebutton> musknapp klickas. Ersättning är bara aktiv om kryssrutan <guilabel>Strängersättning</guilabel> är markerad.

source: The table in <guilabel>Rating</guilabel> contains the mapping of star ratings to the effective values stored in the tag. The frames with rating information are listed in the Rating row of the <link linkend="table-frame-list">frame list</link>. For these frames, the rating can be set by giving a number of stars out of five stars. Different tag formats and different applications use different values to map the star rating to the value stored in the tag. In order to display the correct number of stars, &kid3; will look up a map in this table. The key to look up the mapping is the frame name, for example "RATING" as used for Vorbis comments or "IRTD" for RIFF INFO. For ID3v2 tags, a combined key is used consisting of the frame ID "POPM" of the Popularimeter frame and its "Email" field, separated by a dot. Therefore, different keys for ID3v2 exist, <abbrev>e.g.</abbrev> "POPM.Windows Media Player 9 Series" for the mapping used by Windows Media Player and Explorer, and simply "POPM" for POPM frames with an empty "Email" field. As multiple entries for "POPM" can exist, their order is important. When &kid3; adds a new Popularimeter frame, it will use the first "POPM" entry to determine the value to be written into the "Email" field. This value will then specify the mapping to be used for star ratings. The first entry is also used if no key was found, it is therefore the default entry.
it: La tabella in <guilabel>Valutazione</guilabel> contiene l'associazione delle valutazioni in stelle ai valori effettivi memorizzati nel tag. I frame con informazioni di valutazione sono elencati nella riga Valutazione dell'<link linkend="table-frame-list">elenco dei frame</link>. Per questi frame, la valutazione può essere impostata assegnando un numero di stelle su cinque. Diversi formati di tag e diverse applicazioni utilizzano valori diversi per associare la valutazione in stelle al valore memorizzato nel tag. Per visualizzare il numero corretto di stelle, &kid3; cercherà una mappa in questa tabella. La chiave per cercare l'associazione è il nome del frame, ad esempio «RATING» utilizzato per i commenti di Vorbis o «IRTD» per RIFF INFO. Per i tag ID3v2, viene utilizzata una chiave combinata costituita dal frame ID «POPM» del frame Popularimeter e dal suo campo «Email», separati da un punto. Pertanto, esistono diverse chiavi per ID3v2, <abbrev>ad es.</abbrev> «POPM.Windows Media Player 9 Series» per l'associazione utilizzata da Windows Media Player ed Explorer, e semplicemente «POPM» per i frame POPM con un campo «Email» vuoto. Poiché possono esistere più voci per «POPM», il loro ordine è importante. Quando &kid3; aggiunge un nuovo frame Popularimeter, utilizzerà la prima voce «POPM» per determinare il valore da scrivere nel campo «Email». Questo valore specificherà quindi l'associazione da utilizzare per le stelle. La prima voce viene utilizzata anche se non viene trovata alcuna chiave, pertanto è la voce predefinita.
ru: Таблица в разделе <guilabel>Рейтинг</guilabel> содержит сопоставления рейтинга (в звёздах) с текущими значениями, хранящимися в теге. Фреймы с данными рейтинга содержатся в строке «Рейтинг» <link linkend="table-frame-list">списка фреймов</link>. Для этих фреймов рейтинг устанавливается путём присвоения определённого количества звёзд из пяти звёзд. В разных форматах тегов и разных приложениях используются разные значения для привязки этой оценки в звёздах к значению, хранящемуся в теге. Чтобы отображать количество присвоенных звёзд корректно, программа &kid3; обращается к этой таблице. Ключом для поиска соответствующей информации является название фрейма, например, в комментариях Vorbis это будет «RATING», а в RIFF INFO — «IRTD». Для тегов ID3v2 используется комбинированный ключ, содержащий идентификатор «POPM» фрейма Popularimeter и поле «Email», отделённое точкой. Таким образом, для тегов ID3v2 существуют разные ключи, например, «POPM.Windows Media Player 9 Series» для привязки, используемой приложениями Windows Media Player и Explorer, и просто «POPM» для фреймов POPM с пустым полем «Email». Так как для «POPM» может существовать несколько записей, их порядок важен. Когда &kid3; добавляет новый фрейм Popularimeter, для определения значения, которое будет записано в поле «Email», используется первая запись «POPM». Это значение затем укажет привязку, которая будет использоваться для оценки в звёздах. Первая запись также используется как запись по умолчанию в случаях, когда ключ не был найден.
sv: Tabellen <guilabel>Betyg</guilabel> innehåller avbildningen av stjärnbetyg till de verkliga värdena lagrade i taggen. Ramarna med betygsinformation listas på raden Betyg i <link linkend="table-frame-list">ramlistan</link>. För dessa ramar, kan betyget anges genom att ge ett antal stjärnor av fem stjärnor. Olika taggformat och olika program använder olika värden för att avbilda stjärnbetygen till värdet lagrat i taggen. För att visa rätt antal stjärnor slår &kid3; upp en avbildning i den här tabellen. Nyckeln för att slå upp avbildningen är ramnamnet, till exempel "RATING" som används för Vorbis-kommentarer eller "IRTD" för RIFF INFO. För ID3v2-taggar, används en kombinerad nyckel som består av ram-id "POPM" i ramen Popularimeter och dess "Email" fält, separerade av en punkt. Därför finns olika nycklar för ID3v2, <abbrev>t.ex.</abbrev> "POPM.Windows Media Player 9 Series" för avbildningen som används av Windows mediaspelare och utforskare, och helt enkelt "POPM" för POPM-ramar med ett tomt "Email" fält. Eftersom flera poster kan finnas för "POPM" är deras ordning viktig. När &kid3; lägger till en ny Popularimeter-ram, används den första "POPM" posten för att bestämma värdet som ska skrivas in i "Email" fältet. Det värdet anger sedan avbildningen som används för stjärnbetyg. Den första posten används också om ingen nyckel hittades, och är därför den förvalda posten.

source: Besides the <guilabel>Name</guilabel> column containing the keys, the table has columns <guilabel>1</guilabel> to <guilabel>5</guilabel> for the values to be stored when the corresponding number of stars is given. The other way round, the values determine the number of stars which are displayed for the value stored in the frame. For instance, the row in the table below contains the values 1, 64, 128, 196, 255. The thresholds for the number of stars to be displayed lay between these values and are compatible with what the &Windows; Explorer uses.
it: Oltre alla colonna <guilabel>Nome</guilabel> contenente le chiavi, la tabella ha le colonne da <guilabel>1</guilabel> a <guilabel>5</guilabel> per i valori da memorizzare quando viene dato il numero di stelle corrispondente . Al contrario, i valori determinano il numero di stelle visualizzate per il valore memorizzato nel frame. Ad esempio, la riga nella tabella seguente contiene i valori 1, 64, 128, 196, 255. Le soglie per il numero di stelle da visualizzare si trovano tra questi valori e sono compatibili con ciò che &Windows; Explorer utilizza.
ru: Помимо столбца <guilabel>Имя</guilabel>, содержащего ключи, в таблице представлены столбцы от <guilabel>1</guilabel> до <guilabel>5</guilabel> для значений параметров, которые будут записаны в тег, если дорожке будет назначена соответствующая оценка в звёздах. И наоборот, эти значения определяют количество звёзд, которые будут отображаться для значения, хранящегося во фрейме. Например, строка таблицы ниже содержит значения 1, 64, 128, 196, 255. Пороговые значения количества звёзд, которые будут показаны для оценок, лежащих между этими значениями, совместимы с используемыми в &Windows; Explorer.
sv: Förutom kolumnen <guilabel>Namn</guilabel> som innehåller nycklarna, har tabellen kolumnerna <guilabel>1</guilabel> till <guilabel>5</guilabel> för värden som ska lagras när motsvarande antal stjärnor ges. Åt andra hållet, avgör värdena antal stjärnor som visas för värdet som är lagrat i ramen. Raden i tabellen nedan innehåller exempelvis värdena 1, 64, 128, 196, 255. Trösklarna för antal stjärnor som visas ligger mellan dessa värden och är kompatibla med det som &Windows; utforskare använder.

source: Entry in Rating Table
it: Voce nella tabella di valutazione
ru: Запись в таблице оценок
sv: Post i betygstabell

source: Name
it: Nome
ru: Имя
sv: Namn

source: Range
it: Intervallo
ru: Диапазон
sv: Intervall
