Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: If the files are ordered differently than the imported tracks, their assigned tracks have to be changed. This task can be facilitated using the <guilabel>Match with</guilabel> option with the buttons <guibutton>Length</guibutton>, <guibutton>Track</guibutton>, and <guibutton>Title</guibutton>, which will reorder the tracks according to the corresponding field. To correct the assignments manually, a track can be dragged with the <mousebutton>left</mousebutton> mouse button and the &Ctrl; key hold down, and then dropped at the new location.
it: Se i file sono ordinati in modo diverso rispetto alle tracce importate, è necessario modificare le tracce assegnate. Questa attività può essere facilitata utilizzando l'opzione <guilabel>Corrisponde a</guilabel> con i pulsanti <guibutton>Lunghezza</guibutton>, <guibutton>Traccia</guibutton> e <guibutton>Titolo</guibutton>, che riordinare le tracce in base al campo corrispondente. Per correggere manualmente le assegnazioni, è possibile trascinare una traccia con il pulsante <mousebutton>sinistro</mousebutton> e il tasto &Ctrl; premuto, quindi rilasciare nella nuova posizione.
ru: Если файлы расположены не в же порядке, что и импортированные дорожки, потребуется изменить назначенные этим файлам дорожки. Эту задачу упрощает опция <guilabel>Сопоставлять с:</guilabel> с кнопками <guibutton>Длительность</guibutton>, <guibutton>Дорожка</guibutton> и <guibutton>Название</guibutton>. Эти кнопки позволяют переупорядочить дорожки в соответствии с нужным полем. Чтобы отредактировать порядок дорожек вручную, перетащите дорожку на новое место с помощью <mousebutton>левой</mousebutton> кнопки мыши в сочетании с клавишей &Ctrl;.
sv: Om filerna är ordnade på annat sätt än de importerade spåren, måste deras tilldelade spår ändras. Uppgiften kan förenklas genom att använda alternativet <guilabel>Matcha med</guilabel> och knapparna <guibutton>Längd</guibutton>, <guibutton>Spår</guibutton> och <guibutton>Titel</guibutton>, vilket ordnar om spåren enligt motsvarande fält. För att korrigera tilldelningarna manuellt, kan ett spår dras med <mousebutton>vänster</mousebutton> musknapp och tangenten &Ctrl; nedtryckt, och därefter släppas på den nya platsen.

source: When the import dialog is opened, it contains the actual contents of the tags. The tag type (Tag 1, Tag 2, Tag 1 and Tag 2) can be selected using the <guilabel>Destination</guilabel> combo box. The button on the right of this combo box can be used to revert the table to the current contents of the tags. The check boxes in the first table column can be used to select the tracks which are imported. This can be useful if a folder contains the tracks of both &CD;s of a double &CD; and only the tracks of the second &CD; have to be imported.
it: Quando si apre la finestra di importazione, essa contiene il contenuto attuale dei tag. Il tipo di tag (Tag 1, Tag 2, Tag 1 e Tag 2) può essere selezionato utilizzando la casella combinata <guilabel>Destinazione</guilabel>. Il pulsante a destra di questa casella combinata può essere utilizzato per ripristinare la tabella al contenuto attuale dei tag. Le caselle di controllo nella prima colonna della tabella possono essere utilizzate per selezionare le tracce che vengono importate. Questo può essere utile se una cartella contiene le tracce di entrambi i &CD; di un doppio &CD; e solo le tracce del secondo &CD; devono essere importate.
ru: Открытый диалог импорта содержит данные тегов. Тип тега («Тег 1», «Тег 2», «Тег 1 и тег 2») выбирается в раскрывающемся списке <guilabel>Место назначения</guilabel>. Кнопка справа от раскрывающегося списка позволяет отменить изменения, чтобы вновь показать в таблице текущее содержимое тегов. Флажки в первом столбце таблицы позволяют выбрать дорожки, для которых будут импортированы данные. Это может быть полезно, например, если папка содержит дорожки с обоих компакт-дисков двойного компакт-диска, а импортировать следует только данные второго компакт-диска.
sv: När importdialogrutan öppnas innehåller den taggarnas verkliga innehåll. Taggtypen (Tagg 1, Tagg 2, Tagg 1 och tagg 2) kan väljas med kombinationsrutan <guilabel>Mål</guilabel>. Knappen till höger om kombinationsrutan kan användas för att återställa tabellen till taggarnas nuvarande innehåll. Kryssrutorna i den första tabellkolumnen kan användas för att markera spåren som är importerade. Det kan vara användbart om en katalog innehåller spåren för båda cd-skivorna av en dubbel-cd, och bara spåren på den andra cd-skivan behöver importeras.

source: To identify the tracks which are imported, it is possible to display the file names or the full paths to the files using the context menu of the table header. The values in the import table can be edited. The revert-button to the right of the <guilabel>Destination</guilabel> combo box can be used to restore the contents of the tags, which can also be useful after changing the <guilabel>Destination</guilabel>.
it: Per identificare le tracce importate, è possibile visualizzare i nomi dei file o i percorsi completi dei file utilizzando il menu di contestuale dell'intestazione della tabella. I valori nella tabella di importazione possono essere modificati. Il pulsante Ripristina a destra della casella combinata <guilabel>Destinazione</guilabel> può essere utilizzato per ripristinare il contenuto dei tag, che può essere utile anche dopo aver modificato la <guilabel>Destinazione</guilabel>.
ru: Чтобы идентифицировать дорожки, данные которых будут импортированы, возможно включить показ названий файлов или полного пути к файлам с помощью контекстного меню заголовка таблицы. Значения в таблице импорта доступны для редактирования. Кнопка отмены изменений, расположенная справа от раскрывающегося списка <guilabel>Место назначения</guilabel>, служит для восстановления содержимого тегов. Ей также возможно воспользоваться после изменения содержания пункта <guilabel>Место назначения</guilabel>.
sv: För att identifiera spår som importeras är det möjligt att visa filnamnen eller hela sökvägarna till filerna genom att använda den sammanhangsberoende menyn i tabellrubrikerna. Värdena i importtabellen kan redigeras. Ångringsknappen till höger om kombinationsrutan <guilabel>Mål</guilabel> kan användas för att återställa taggarnas innehåll, vilket också kan vara användbart efter att ha ändrat <guilabel>Mål</guilabel>.

source: Almost all dialogs feature a <guibutton>Save Settings</guibutton> button, which can be used to store the dialog specific settings and the window size persistently.
it: Quasi tutte le finestre dispongono di un pulsante <guibutton>Salva impostazioni</guibutton>, che può essere utilizzato per memorizzare in modo persistente le impostazioni specifiche e le dimensioni della finestra.
ru: Почти во всех диалогах присутствует кнопка <guibutton>Сохранить параметры</guibutton>, позволяющая сохранить параметры конкретного диалога и размеры окна.
sv: Nästan alla dialogrutornas funktioner har knappen <guibutton>Spara inställningar</guibutton>, som kan användas för att beständigt lagra dialogspecifika inställningar och fönsterstorlekar.

source: <guibutton>From Tags</guibutton> leads to a subdialog to set tag frames from the contents of other tag frames. This can be used to simply copy information between tags or extract a part from one frame and insert it in another.
it: <guibutton>Da tag</guibutton> porta a una sotto-finestra per impostare i frame dei tag dal contenuto di altri frame dei tag. Questo può essere usato per copiare semplicemente informazioni tra tag o estrarre una parte da un frame e inserirla in un altro.
ru: Кнопка <guibutton>Из тегов...</guibutton> открывает вложенный диалог для заполнения данных фреймов тегов на основе других фреймов тегов. Эта функция позволяет просто скопировать информацию из одного тега в другой или извлечь часть фрейма и вставить её в другой фрейм.
sv: <guibutton>Från taggar</guibutton> leder till en underdialogruta för att tilldela taggramar från innehållet i andra taggramar. Det kan användas för att helt enkelt kopiera information mellan taggar eller extrahera en del från en ram och infoga den i en annan.

source: As in the <link linkend="import-text">import from file/clipboard</link> dialog, there are freely configurable formats to perform different operations. Already preconfigured are formats to copy the Album value to Album Artist, Composer or Conductor, and to extract the Track Number from Title fields which contain a number. There is also a format to extract a Subtitle from a Title field.
it: Come nella finestra <link linkend="import-text">importa da file/appunti</link>, ci sono formati liberamente configurabili per eseguire diverse operazioni. Sono già preconfigurati formati per copiare il valore dell'album in Artista dell'album, Compositore o Direttore ed estrarre il numero di traccia dai campi del titolo che contengono un numero. Esiste anche un formato per estrarre un sottotitolo da un campo Titolo.
ru: Как и в диалоге <link linkend="import-text">импорта из файла или буфера обмена</link>, здесь представлены легко настраиваемые форматы для выполнения различных действий. Предусмотрены предустановленные форматы для копирования значения названия альбома в поля исполнителя, композитора или дирижёра, а также для извлечения номера дорожки из полей заголовка, содержащих число. Также предусмотрен формат для получения значения подзаголовка из поля заголовка.
sv: Liksom i dialogrutan <link linkend="import-text">Importera från fil/klippbord</link> finns det fritt inställningsbara format för att utföra olika åtgärder. Format för att kopiera albumvärdet till albumartist, tonsättare eller dirigent, och för att extrahear spårnummer från titelfält som innehåller ett nummer är redan fördefinierade. Det finns också ett format för att extrahera en undertitel från ett titelfält.

source: The following example explains how to add a custom format, which sets the information from the Subtitle field also in the Comment field. Create a new format using <guibutton>Add</guibutton> button and set a new name, <abbrev>e.g.</abbrev> "Subtitle to Comment". Then enter "<userinput>%{subtitle}</userinput>" in <guilabel>Source</guilabel> and "<userinput>%{comment}(.*)</userinput>" for <guilabel>Extraction</guilabel> and click <guibutton>Save Settings</guibutton>.
it: L'esempio seguente spiega come aggiungere un formato personalizzato, che imposta le informazioni dal campo Sottotitoli anche nel campo Commento. Crea un nuovo formato utilizzando il pulsante <guibutton>Aggiungi</guibutton> e imposta un nuovo nome, <abbrev>ad es.</abbrev> «Sottotitolo su commento». Quindi inserire «<userinput>%{subtitle}</userinput>» in <guilabel>Fonte</guilabel> e «<userinput>%{comment}(.*)</userinput>» per <guilabel>Estrazione</guilabel > e fare clic su <guibutton>Salva impostazioni</guibutton>.
ru: Следующий пример описывает алгоритм добавления пользовательского формата, который будет вставлять информацию из поля «Подзаголовок» в поле «Комментарий». Создайте новый формат с помощью кнопки <guibutton>Добавить</guibutton> и укажите новое название, например, «Подзаголовок в комментарий». Затем введите «<userinput>%{subtitle}</userinput>» в поле <guilabel>Источник</guilabel> и «<userinput>%{comment}(.*)</userinput>» в <guilabel>Извлечение</guilabel>, а затем нажмите кнопку <guibutton>Сохранить параметры</guibutton>.
sv: Följande exempel förklarar hur man lägger till ett eget format, vilket också tilldelar informationen från undertiteln till kommentarfältet. Skapa ett nytt format genom att använda knappen <guibutton>Lägg till</guibutton> och ange ett nytt namn, t.ex. "Undertitel till kommentar". Mata därefter in "<userinput>%{subtitle}</userinput>" i <guilabel>Källa</guilabel> and "<userinput>%{comment}(.*)</userinput>" för <guilabel>Extrahering</guilabel> och klicka på <guibutton>Spara inställningar</guibutton>.

source: The expression in <guilabel>Source</guilabel> can contain <link linkend="format-codes">format codes</link> for arbitrary tag frames, multiple codes can be used to combine the contents from different frames. For each track, a text is generated from its tags using the <guilabel>Source </guilabel> format, and the regular expression from <guilabel>Extraction</guilabel> is applied to this text to set new values for the tags. Format codes are used before the capturing parentheses to specify the tag frame where the captured text shall be stored. It works in the same way as for the <link linkend="import-text">import from file/clipboard</link>.
it: L'espressione in <guilabel>Fonte</guilabel> può contenere <link linkend="format-codes">codici di formato</link> per frame di tag arbitrari, è possibile utilizzare più codici per combinare i contenuti di frame diversi. Per ogni traccia, un testo viene generato dai suoi tag utilizzando il formato <guilabel>Fonte</guilabel> e l'espressione regolare da <guilabel>Estrazione</guilabel> viene applicata a questo testo per impostare nuovi valori per i tag. I codici di formato sono utilizzati prima delle parentesi di acquisizione per specificare il frame del tag in cui deve essere memorizzato il testo acquisito. Funziona come per <link linkend="import-text">importa da file/appunti</link>.
ru: Выражение в поле <guilabel>Источник</guilabel> может содержать <link linkend="format-codes">коды формата</link> для произвольных фреймов тегов. Использование нескольких кодов позволяет комбинировать содержимое разных фреймов. Для каждой дорожки текст генерируется из её тегов с использованием формата <guilabel>Источник</guilabel>, а затем к этому тексту применяется регулярное выражение из поля <guilabel>Извлечение</guilabel> для установки новых значений тегов. Коды формата используются перед захватывающими круглыми скобками, чтобы указать фрейм тега, в котором будет сохранён захваченный текст. Всё это работает таким же образом, как и в функции <link linkend="import-text">импорта из файла или буфера обмена</link>.
sv: Uttrycket i <guilabel>Källa</guilabel> kan innehålla <link linkend="format-codes">formatkoder</link> för godtyckliga taggramar, flera koder kan användas för att kombinera innehållet från olika ramar. För varje spår skapas en text från dess taggar genom att använda formatet i <guilabel>Källa</guilabel>, och det reguljära uttrycket från <guilabel>Extrahering</guilabel> används på texten för att tilldela nya värden till taggarna. Formatkoder används innan lagringsparenteserna för att ange taggramen där den tagna texten ska lagras. Det fungerar på samma sätt som <link linkend="import-text">import från fil/klippbord</link>.

source: <guimenuitem>Import from Tags...</guimenuitem> is also directly available from the <guimenu>File</guimenu> menu. The difference between these two functions is that the import dialog subdialog operates on all files of the current folder whereas the menu function operates on the selected files (which can be in different folders). The menu function supports an additional code "<literal>%{__return}</literal>" to return the extracted value, which can be useful with the CLI and QML interfaces.
it: <guimenuitem> Importa da tag...</guimenuitem> è anche disponibile direttamente dal menu <guimenu>File</guimenu>. La differenza tra queste due funzioni è che la finestra di importazione opera su tutti i file della cartella attuale mentre la funzione di menu opera sui file selezionati (che possono trovarsi in cartelle diverse). La funzione di menu supporta un codice aggiuntivo «<literal>%{__return}</literal>» per restituire il valore estratto, che può essere utile con le interfacce CLI e QML.
ru: Функцией <guimenuitem>Импорт из тегов...</guimenuitem> также возможно воспользоваться непосредственно в меню <guimenu>Файл</guimenu>. Разница между этими двумя инструментами заключается в том, что вложенный диалог функции импорта работает со всеми файлами в текущем каталоге, тогда как функция в меню работает с выбранными файлами (которые могут находиться в разных каталогах). Функция в меню поддерживает дополнительный код «<literal>%{__return}</literal>» для возврата полученного значения, что может быть полезно при работе с интерфейсами командной строки и QML.
sv: <guimenuitem>Importera från taggar...</guimenuitem> är också direkt tillgänglig i menyn <guimenu>Arkiv</guimenu>. Skillnaden mellan dessa två funktioner är att importdialogrutans underdialogruta arbetar med alla filer i aktuell katalog, medan menyfunktionen arbetar med de markerade filerna (vilka kan vara i olika kataloger). Menyfunktionen stöder ytterligare en kod "<literal>%{__return}</literal>" för att returnera det extraherade värdet, vilket kan vara användbart med kommandorads- och QML-gränssnitten.

source: <guimenu>File</guimenu> <guimenuitem>Import from gnudb.org...</guimenuitem>
it: <guimenu>File</guimenu> <guimenuitem>Importa da gnudb.org...</guimenuitem>
ru: <guimenu>Файл</guimenu> <guimenuitem>Импорт из gnudb.org...</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Importera från gnudb.org...</guimenuitem>

source: <action>Import from a freedb.org server using gnudb.org album search.</action> This menu item opens the same import dialog as <guimenuitem>Import...</guimenuitem>, but opens directly the <guibutton>gnudb.org</guibutton> dialog.
it: <action>Importa da un server freedb.org utilizzando la ricerca degli album di gnudb.org.</action> Questo elemento di menu apre la stessa finestra di importazione di <guimenuitem>Importa...</guimenuitem>, ma apre direttamente la sezione <guibutton>gnudb.org</guibutton>.
ru: <action>Импорт с сервера freedb.org с помощью поиска по альбомам в gnudb.org.</action> Этот пункт меню открывает то же окно импорта, что и пункт меню <guimenuitem>Импорт...</guimenuitem>, но при этом сразу появляется диалог <guibutton>gnudb.org</guibutton>.
sv: <action>Importera från en freedb.org server med gnudb.org albumsökning.</action> Menyalternativet öppnar samma importdialogruta som <guimenuitem>Importera...</guimenuitem> men öppnar direkt dialogrutan <guibutton>gnudb.org</guibutton>.

source: <guimenu>File</guimenu> <guimenuitem>Import from Discogs...</guimenuitem>
it: <guimenu>File</guimenu> <guimenuitem>Importa da Discogs...</guimenuitem>
ru: <guimenu>Файл</guimenu> <guimenuitem>Импорт из Discogs...</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Importera från Discogs...</guimenuitem>

source: <action>Import from the Discogs server.</action> This menu item opens the same import dialog as <guimenuitem>Import...</guimenuitem>, but opens directly the <guibutton>From Discogs</guibutton> dialog.
it: <action>Importa dal server Discogs.</action> Questo elemento di menu apre la stessa finestra di importazione di <guimenuitem>Importa...</guimenuitem>, ma apre direttamente la sezione <guibutton>Da Discogs</guibutton>.
ru: <action>Импорт с сервера Discogs.</action> Этот пункт меню открывает то же окно импорта, что и пункт меню <guimenuitem>Импорт...</guimenuitem>, но при этом сразу появляется диалог <guibutton>Discogs</guibutton>.
sv: <action>Importera från Discogs servern</action> Menyalternativet öppnar samma importdialogruta som <guimenuitem>Importera..</guimenuitem> men öppnar direkt dialogrutan <guibutton>Från Discogs</guibutton>.

source: <guimenu>File</guimenu> <guimenuitem>Import from Amazon...</guimenuitem>
it: <guimenu>File</guimenu> <guimenuitem>Importa da Amazon...</guimenuitem>
ru: <guimenu>Файл</guimenu> <guimenuitem>Импорт из Amazon...</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Importera från Amazon...</guimenuitem>

source: <action>Import from Amazon.</action> This menu item opens the same import dialog as <guimenuitem>Import...</guimenuitem>, but opens directly the <guibutton>From Amazon</guibutton> dialog.
it: <action>Importa da Amazon.</action> Questo elemento di menu apre la stessa finestra di importazione di <guimenuitem>Importa...</guimenuitem>, ma apre direttamente la sezione <guibutton>Da Amazon</guibutton>.
ru: <action>Импорт из Amazon.</action> Этот пункт меню открывает то же окно импорта, что и пункт меню <guimenuitem>Импорт...</guimenuitem>, но при этом сразу появляется диалог <guibutton>Amazon</guibutton>.
sv: <action>Importera från Amazon.</action> Menyalternativet öppnar samma importdialogruta som <guimenuitem>Importera.</guimenuitem> men öppnar direkt dialogrutan <guibutton>Från Amazon</guibutton>.

source: <guimenu>File</guimenu> <guimenuitem>Import from MusicBrainz Release...</guimenuitem>
it: <guimenu>File</guimenu> <guimenuitem>Importa da MusicBrainz Release...</guimenuitem>
ru: <guimenu>Файл</guimenu> <guimenuitem>Импорт из MusicBrainz (релиз)...</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Importera från MusicBrainz Release...</guimenuitem>

source: <action>Import from the MusicBrainz release database.</action> This menu item opens the same import dialog as <guimenuitem>Import...</guimenuitem>, but opens directly the <guibutton>From MusicBrainz Release</guibutton> dialog.
it: <action>Importa dalla banca dati delle uscite di MusicBrainz.</action> Questo elemento di menu apre la stessa finestra di importazione di <guimenuitem>Importa...</guimenuitem>, ma apre direttamente la sezione <guibutton>Da MusicBrainz Release</guibutton>.
ru: <action>Импорт из базы данных альбомов MusicBrainz.</action> Этот пункт меню открывает то же окно импорта, что и пункт меню <guimenuitem>Импорт...</guimenuitem>, но при этом сразу появляется диалог <guibutton>MusicBrainz (релиз)</guibutton>.
sv: <action>Importera från MusicBrainz Release databas.</action> Menyalternativet öppnar samma importdialogruta som <guimenuitem>Importera.</guimenuitem> men öppnar direkt dialogrutan <guibutton>Från MusicBrainz Release</guibutton>.

source: <guimenu>File</guimenu> <guimenuitem>Import from MusicBrainz Fingerprint...</guimenuitem>
it: <guimenu>File</guimenu> <guimenuitem>Importa da MusicBrainz Fingerprint...</guimenuitem>
ru: <guimenu>Файл</guimenu> <guimenuitem>Импорт из MusicBrainz (отпечаток)...</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Importera från MusicBrainz Fingerprint...</guimenuitem>

source: <action>Import from a MusicBrainz server.</action> This menu item opens the same import dialog as <guimenuitem>Import...</guimenuitem>, but opens directly the <guibutton>From MusicBrainz Fingerprint</guibutton> dialog.
it: <action>Importa dal server di MusicBrainz.</action> Questo elemento di menu apre la stessa finestra di importazione di <guimenuitem>Importa...</guimenuitem>, ma apre direttamente la sezione <guibutton>Da MusicBrainz Fingerprint</guibutton>.
ru: <action>Импорт с сервера MusicBrainz.</action> Этот пункт меню открывает то же окно импорта, что и пункт меню <guimenuitem>Импорт...</guimenuitem>, но при этом сразу появляется диалог <guibutton>MusicBrainz (отпечаток)</guibutton>.
sv: <action>Importera från en MusicBrainz server.</action> Menyalternativet öppnar samma importdialogruta som <guimenuitem>Importera.</guimenuitem> men öppnar direkt dialogrutan <guibutton>Från MusicBrainz Fingerprint</guibutton>.

source: <guimenu>File</guimenu> <guimenuitem>Import from Tags...</guimenuitem>
it: <guimenu>File</guimenu> <guimenuitem>Importa da tag...</guimenuitem>
ru: <guimenu>Файл</guimenu> <guimenuitem>Импорт из тегов...</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Importera från taggar...</guimenuitem>

source: Like <link linkend="import-tags">From Tags</link>, but the import is applied to the selected files.
it: Come <link linkend="import-tags">Da tag</link>, ma l'importazione è applicata ai file selezionati.
ru: Аналогично кнопке «<link linkend="import-tags">Из тегов...</link>», но импорт применяется к выделенным файлам.
sv: Som <link linkend="import-tags">Från taggar</link>, men importen gäller de markerade filerna.
