Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: On the page <guilabel>Files</guilabel> the check box <guilabel>Load last-opened files</guilabel> can be marked so that &kid3; will open and select the last selected file when it is started the next time. <guilabel>Preserve file timestamp</guilabel> can be checked to preserve the file modification time stamp. <guilabel>Filename for cover</guilabel> sets the name which is suggested when an embedded image is exported to a file. With <guilabel>Text encoding (Export, Playlist)</guilabel> the encoding used when writing files can be set. The default <guilabel>System</guilabel> can be changed for example if playlists have to be used on a different device.
it: Nella pagina <guilabel>File</guilabel> la casella di selezione <guilabel>Carica gli ultimi file aperti</guilabel> può essere contrassegnata in modo che &kid3; si aprirà e selezionerà l'ultimo file selezionato al successivo avvio. <guilabel>Mantieni data/ora del file</guilabel> può essere marcata per conservare la marca temporale di modifica del file. <guilabel>Nome file per copertina</guilabel> imposta il nome suggerito quando un'immagine incorporata viene esportata in un file. Con <guilabel>Codifica del testo (esportazione, scaletta)</guilabel> è possibile impostare la codifica utilizzata durante la scrittura dei file. Il <guilabel>Sistema</guilabel> predefinito può essere modificato, ad esempio, se le scalette devono essere utilizzate su un dispositivo diverso.
ru: Флажок <guilabel>Загружать при запуске файлы, открытые при последнем выходе</guilabel>, расположенный на вкладке <guilabel>Файлы</guilabel>, позволяет &kid3; при следующем запуске открывать файл, который был открыт при последнем выходе. Флажок <guilabel>Сохранять метки времени изменения файлов</guilabel> позволяет сохранять метку времени изменения файла. Поле ввода <guilabel>Имя файла обложки</guilabel> предназначено для указания имени, которое будет предложено при экспорте встроенного изображения в файл. Раскрывающийся список <guilabel>Кодировка текста (экспорт, список воспроизведения)</guilabel> позволяет указать кодировку, используемую при записи файлов. Стандартный вариант <guilabel>System</guilabel> возможно изменить, например, если списки воспроизведения будут использоваться на другом устройстве.
sv: På sidan <guilabel>Filer</guilabel> akn kryssrutan <guilabel>Läs in senast öppnade filer</guilabel> så att &kid3; öppnar och markerar den senast markerade filen när det startas nästa gång. <guilabel>Bevara filtidsstämpel</guilabel> kan markeras för att bevara filens ändringstidsstämpel. <guilabel>Filnamn för omslag</guilabel> ställer in namnet som föreslås när en inbäddad bild exporteras till en fil. Med <guilabel>Textkodning (export, spellista)</guilabel> kan kodningen som används när filer skrivs ut ställas in. Förvalet <guilabel>System</guilabel> kan ändras om spellistor exempelvis behöver användas på en annan enhet.

source: If <guilabel>Mark changes</guilabel> is active, changed fields are marked with a light gray label background.
it: Se <guilabel>Marca le modifiche</guilabel> è attiva, i campi modificati sono marcati con uno sfondo grigio chiaro.
ru: Если установлен флажок <guilabel>Отмечать изменения</guilabel>, изменённые поля будут отмечены светло-серым фоном.
sv: Om <guilabel>Markera ändringar</guilabel> är aktiverad, markeras ändrade fält med en ljusgrå bakgrund.

source: The section <guilabel>File List</guilabel> determines which files are displayed in the file list. A <guilabel>Filter</guilabel> can be used to restrict the items in this list to files with supported extensions. To explicitly specify which folders to display in the file list or exclude certain folders, the options <guilabel>Include folders</guilabel> and <guilabel>Exclude folders</guilabel> can be used. They can contain wildcard expressions, for instance <filename>*/Music/*</filename> to include only the <filename>Music</filename> folder, or <filename>*/iTunes/*</filename> to exclude the iTunes folder from the file list. If multiple such expressions have to be used, they can be separated by spaces or semicolons.
it: La sezione <guilabel>Elenco file</guilabel> determina quali file vengono visualizzati nell'elenco dei file. Un <guilabel>Filtro</guilabel> può essere utilizzato per limitare gli elementi in questo elenco ai file con estensioni supportate. Per specificare esplicitamente quali cartelle visualizzare nell'elenco dei file o escludere determinate cartelle, è possibile utilizzare le opzioni <guilabel>Includi cartelle</guilabel> e <guilabel>Escludi cartelle</guilabel>. Possono contenere espressioni con metacaratteri, ad esempio <filename>*/Musica/*</filename> per includere solo la cartella <filename>Musica</filename> o <filename>*/iTunes/*</filename> per escludere la cartella iTunes dall'elenco dei file. Se devono essere utilizzate più espressioni di questo tipo, possono essere separate da spazi o punti e virgola.
ru: Раздел <guilabel>Список файлов</guilabel> позволяет указать, какие файлы следует отображать в списке файлов. С помощью раскрывающегося списка <guilabel>Фильтр</guilabel> возможно задать отображение в списке только тех файлов, которые имеют поддерживаемые расширения. Чтобы явным образом указать, какие каталоги следует отображать или исключить в списке файлов, воспользуйтесь полями ввода <guilabel>Включить папки</guilabel> и <guilabel>Исключить папки</guilabel>. Эти поля могут содержать выражения с подстановочными знаками, например, <filename>*/Музыка/*</filename> для включения только каталога <filename>Музыка</filename> или <filename>*/iTunes/*</filename> для исключения каталога iTunes из списка файлов. Если необходимо использовать несколько таких выражений, их следует разделить пробелами или точками с запятой.
sv: Sektionen <guilabel>Fillista</guilabel> bestämer vilka filer som visas i fillistan. Ett <guilabel>Filter</guilabel> kan användas för att begränsa objekten i listan till filer med filändelser som stöds. För att explicit ange vilka kataloger som ska visas i fillistan eller undanta vissa kataloger, kan alternativen <guilabel>Inkludera kataloger</guilabel> och <guilabel>Undanta kataloger</guilabel> användas. De kan innehålla uttryck med jokertecken, exempelvis <filename>*/Musik/*</filename> för att bara inkludera katalogen <filename>Musik</filename>, eller <filename>*/iTunes/*</filename> för att undanta katalogen iTunes från fillistan. Om flera sådana uttryck behöver användas, kan de åtskiljas av mellanslag eller semikolon.

source: The buttons <guibutton>Filename from tag</guibutton> and <guibutton>Tag from filename</guibutton> in section <guilabel>Format</guilabel> open dialogs to edit the formats which are available in the <guilabel>Format</guilabel> combo boxes (with arrows up and down), which can be found in the <link linkend="file">File</link> section of the main window.
it: I pulsanti <guibutton>Nome file dal tag</guibutton> e <guibutton>Tag dal nome file</guibutton> nella sezione <guilabel>Formato</guilabel> aprono le finestre per modificare i formati disponibili nelle caselle combinate <guilabel>Formato</guilabel> (con le frecce su e giù), che si trovano nella sezione <link linkend="file">File</link> della finestra principale.
ru: Кнопки <guibutton>Имя файла из тега...</guibutton> и <guibutton>Тег из имени файла...</guibutton> в разделе <guilabel>Формат</guilabel> открывают диалоги для редактирования форматов, доступных в раскрывающихся списках <guilabel>Формат</guilabel> (со стрелками вверх и вниз), которые расположены в разделе <link linkend="file">«Файл»</link> главного окна.
sv: Knapparna <guibutton>Filnamn från tagg</guibutton> och <guibutton>Tagg från filnamn</guibutton> i sektionen <guilabel>Format</guilabel> visar dialogrutor för att redigera formaten som är tillgängliga i kombinationsrutorna <guilabel>Format</guilabel> (med piltangenterna uppåt och neråt) som finns i sektionen <link linkend="file">Fil</link> i huvudfönstret.

source: <guilabel>Filename Format</guilabel> contains options for the format of the filenames. The same options as in <guilabel>Tag Format</guilabel> are available.
it: <guilabel>Formato nome file</guilabel> contiene opzioni per il formato dei nomi dei file. Sono disponibili le stesse opzioni di <guilabel>Formato tag</guilabel>.
ru: <guilabel>Формат имени файла</guilabel> содержит параметры формата имён файлов. Доступны те же параметры, что и в разделе <guilabel>Формат тега</guilabel>.
sv: <guilabel>Filnamnsformat</guilabel> innehåller alternativ för filnamnens format. Samma alternativ som för <guilabel>Taggformat</guilabel> är tillgängliga.

source: The <guilabel>User Actions</guilabel> page contains a table with the commands which are available in the context menu of the file list. For critical operations such as deleting files, it is advisable to mark <guilabel>Confirm</guilabel> to pop up a confirmation dialog before executing the command. <guilabel>Output</guilabel> can be marked to see the output written by console commands (standard output and standard error). <guilabel>Name</guilabel> is the name displayed in the context menu. <guilabel>Command</guilabel> is the command line to be executed. Arguments can be passed using the following codes:
it: La pagina <guilabel>Azioni dell'utente</guilabel> contiene una tabella con i comandi disponibili nel menu contestuale dell'elenco dei file. Per operazioni critiche come l'eliminazione di file, è consigliabile marcare <guilabel>Conferma</guilabel> per visualizzare una finestra di conferma prima di eseguire il comando. <guilabel>Risultato</guilabel> può essere contrassegnato per vedere il risultato scritto dei comandi della console (standard output e standard error). <guilabel>Nome</guilabel> è il nome visualizzato nel menu contestuale. <guilabel>Comando</guilabel> è la riga di comando da eseguire. Gli argomenti possono essere passati utilizzando i seguenti codici:
ru: Вкладка <guilabel>Команды пользователя</guilabel> содержит таблицу со списком команд, доступных в контекстном меню списка файлов. Для важных действий наподобие удаления файлов рекомендуется установить флажок <guilabel>Подтвердить</guilabel>, чтобы перед выполнением команды появлялось всплывающее окно для подтверждения действия. Флажок <guilabel>Вывод</guilabel> позволяет отображать для просмотра вывод консольных команд (стандартный вывод и стандартные ошибки). В столбце <guilabel>Имя</guilabel> указано имя для отображения в контекстном меню. Столбец <guilabel>Команда</guilabel> содержит команду для выполнения. Для передачи аргументов доступны следующие коды:
sv: Sidan <guilabel>Användaråtgärder</guilabel> innehåller en tabell med kommandon som är tillgängliga i fillistans sammanhangsberoende meny. För kritiska åtgärder, som att ta bort filer, är det lämpligt att markera <guilabel>Bekräfta</guilabel> för att visa en bekräftelseruta innan kommandot utförs. <guilabel>Utmatning</guilabel> kan markeras för att se utmatning skriven av terminalkommandon (standardutmatning och standardfelutmatning). <guilabel>Namn</guilabel> är namnet som visas i den sammanhangsberoende menyn. <guilabel>Kommando</guilabel> är kommandoraden som ska utföras. Argument kan skickas med genom att använda följande koder:

source: %F %{files} File paths (a list if multiple files selected)
it: %F %{files} Percorsi dei file (un elenco se sono selezionati più file)
ru: %F %{files} Пути файлов (в виде списка, если было выбрано несколько файлов)
sv: %F %{files} Filsökvägar (en lista om flera filer är markerade)

source: %f %{file} File path to single file
it: %f %{file} Percorso di un file singolo
ru: %f %{file} Путь к отдельному файлу
sv: %f %{file} Filsökväg till en enstaka fil

source: %uF %{urls} &URL;s (a list if multiple files selected)
it: %uF %{urls} &URL; (un elenco se più file sono selezionati)
ru: %uF %{urls} &URL;-адреса (в виде списка, если было выбрано несколько файлов)
sv: %uF %{urls} Webbadresser (en lista om flera filer är markerade)

source: %uf %{url} &URL; to single file
it: %uf %{url} &URL; a un file singolo
ru: %uf %{url} &URL;-адрес отдельного файла
sv: %uf %{url} Webbadress till en enstaka fil

source: %d %{directory} Folder
it: %d %{directory} Cartella
ru: %d %{directory} Каталог
sv: %d %{directory} Katalog

source: %b %{browser} Command to start the web browser
it: %b %{browser} Comando per avviare il browser web
ru: %b %{browser} Команда для запуска веб-браузера
sv: %b %{browser} Kommando för att starta webbläsaren

source: %q %{qmlpath} Base folder of provided QML files
it: %q %{qmlpath} Cartella di base per i file QML forniti
ru: %q %{qmlpath} Базовый каталог предоставленных файлов QML
sv: %q %{qmlpath} Baskatalog för tillhandahållna QML-filer

source: The special code <command>@separator</command> can be set as a command to insert a separator into the user actions context menu. Menu items can be put into a submenu by enclosing them with <command>@beginmenu</command> and <command>@endmenu</command> commands. The name of the submenu is determined by the <guilabel>Name</guilabel> column of the <command>@beginmenu</command> command.
it: Il codice speciale <command>@separator</command> può essere impostato come comando per inserire un separatore nel menu contestuale delle azioni dell'utente. Le voci di menu possono essere inserite in un sottomenu racchiudendole con i comandi <command>@beginmenu</command> e <command>@endmenu</command>. Il nome del sottomenu è determinato dalla colonna <guilabel>Nome</guilabel> del comando <command>@beginmenu</command>.
ru: Cпециальный код, <command>@separator</command>, возможно использовать в качестве команды, добавляющей разделитель в контекстное меню команд пользователя. Чтобы добавить пункты меню как вложенное меню, перед ними следует указать команду <command>@beginmenu</command>, а после них — команду <command>@endmenu</command>. Название меню будет определяться столбцом <guilabel>Имя</guilabel> команды <command>@beginmenu</command>.
sv: Specialkoden <command>@separator</command> kan anges som ett kommando för att infoga en avskiljare i den sammanhangsberoende menyn med användaråtgärder. Menyalternativ kan läggas till i en undermeny genom att omge dem med kommandona <command>@beginmenu</command> och <command>@endmenu</command>. Namnet på undermenyn bestäms av kolumnen <guilabel>Namn</guilabel> för kommandot <command>@beginmenu</command>.

source: To execute QML scripts, <command>@qml</command> is used as a command name. The path to the QML script is passed as a parameter. The provided scripts can be found in the folder <filename>%{qmlpath}/script/</filename> (on &Linux; typically <filename>/usr/share/kid3/qml/script/</filename>, on Windows <filename>qml/script/</filename> inside the installation folder, and on &macOS; in the app folder <filename>kid3.app/Contents/Resources/qml/script/</filename>). Custom scripts can be stored in any folder. If the QML code uses &GUI; components, <command>@qmlview</command> shall be used instead of <command>@qml</command>. Additional parameters are passed to the QML script where they will be available via the <function>getArguments()</function> function. An overview of some functions and properties which are available in QML can be found in the appendix <link linkend="qml-interface">QML Interface</link>.
it: Per eseguire gli script QML, <command>@qml</command> viene utilizzato come nome di comando. Il percorso dello script QML viene passato come parametro. Gli script forniti sono disponibili nella cartella <filename>%{qmlpath}/script/</filename> (su &Linux; in genere <filename>/usr/share/kid3/qml/script/</filename>, su Windows <filename>qml/script/</filename> all'interno della cartella di installazione e su &macOS; nella cartella dell'applicazione <filename>kid3.app/Contents/Resources/qml/script/</filename>). Gli script personalizzati possono essere archiviati in qualsiasi cartella. Se il codice QML utilizza componenti della &GUI;, <command>@qmlview</command> sarà utilizzato al posto di <command>@qml</command>. Ulteriori parametri vengono passati allo script QML dove saranno disponibili tramite la funzione <function>getArguments()</function>. Una panoramica di alcune funzioni e proprietà disponibili in QML è disponibile nell'appendice <link linkend="qml-interface">Interfaccia QML</link>.
ru: Чтобы выполнить сценарии QML, используйте <command>@qml</command> в качестве названия команды. Путь к сценарию QML передаётся в качестве параметра. Соответствующие сценарии расположены в каталоге <filename>%{qmlpath}/script/</filename> (в &Linux; это обычно путь <filename>/usr/share/kid3/qml/script/</filename>, в Windows — <filename>qml/script/</filename> внутри папки установки, в &macOS; — в каталоге приложения <filename>kid3.app/Contents/Resources/qml/script/</filename>). Пользовательские сценарии возможно хранить в любом каталоге. Если в коде QML задействованы компоненты графического интерфейса, вместо <command>@qml</command> следует использовать <command>@qmlview</command>. Дополнительные параметры передаются в сценарий QML, где они будут доступны с помощью функции <function>getArguments()</function>. Обзор некоторых функций и свойств, доступных в QML, доступен в приложении <link linkend="qml-interface">Интерфейс QML</link>.
sv: För att köra QML-skript används <command>@qml</command> som kommandonamn. Sökvägen till QML-skriptet skickas med som en parameter. Skripten som tillhandahålls finns i katalogen <filename>%{qmlpath}/script/</filename> (på &Linux; oftast <filename>/usr/share/kid3/qml/script/</filename>, på Windows <filename>qml/script/</filename> inne i installationskatalogen, och på &macOS; i app-katalogen <filename>kid3.app/Contents/Resources/qml/script/</filename>). Egna skript kan lagras i vilken katalog som helst. Om QML-koden använder grafiska användargränssnittskommandon, måste <command>@qmlview</command> användas istället för <command>@qml</command>. Ytterligare parametrar kan skickas med till QML-skriptet, där de är tillgängliga via funktionen <function>getArguments()</function>. En översikt av några funktioner och egenskaper som är tillgängliga i QML finns i appendixet <link linkend="qml-interface">QML-gränssnitt</link>.

source: The command which will be inserted with %{browser} can be defined in the <guilabel>Web browser</guilabel> line edit above. Commands starting with %{browser} can be used to fetch information about the audio files from the web, for instance <screen width="40"> <userinput>%{browser} http://lyricwiki.org/%u{artist}:%u{title}</userinput> </screen> will query the lyrics for the current song in <ulink url="http://www.lyricwiki.org">LyricWiki</ulink>. The "u" in %u{artist} and %u{title} is used to &URL;-encode the artist %{artist} and song %{title} information. It is easy to define your own queries in the same way, <abbrev>e.g.</abbrev> an image search with <ulink url="http://www.google.com">Google</ulink>:
it: Il comando che sarà inserito con %{browser} può essere definito nella riga <guilabel>Browser web</guilabel> sopra. I comandi che iniziano con %{browser} possono essere utilizzati per recuperare informazioni sui file audio dal web, ad esempio <screen width="40"> <userinput>%{browser} http://lyricwiki.org/%u{artist}:%u{title}</userinput> </screen> interrogherà i testi del brano attuale in <ulink url="http://www.lyricwiki.org">LyricWiki</ulink>. La «u» in %u{artist} e %u{title} viene utilizzata per la codifica come &URL; delle informazioni relative all'artista %{artist} e al brano %{title}. È facile definire le proprie query allo stesso modo, <abbrev>ad es.</abbrev> una ricerca di immagini con <ulink url="http://www.google.com">Google</ulink>:
ru: Команда, которая будет вставлена вместо %{browser}, указывается в строке <guilabel>Веб-браузер</guilabel>. Команды, которые начинаются с символов %{browser}, используются для получения информации об аудиофайлах из Интернета. Например, команда <screen width="40"> <userinput>%{browser} http://lyricwiki.org/%u{artist}:%u{title}</userinput> </screen> проведёт поиск текста текущей песни на сайте <ulink url="http://www.lyricwiki.org">LyricWiki</ulink>. Символ «u» в %u{artist} и %u{title} означает, что это закодированная в формате &URL; информация об исполнителе %{artist} и песне %{title}. Таким же образом возможно указывать собственные запросы; например, поиск изображений в <ulink url="http://www.google.com">Google</ulink> будет выглядеть следующим образом:
sv: Kommandot som infogas med %{browser} kan definieras på redigeringsraden <guilabel>Webbläsare</guilabel> ovanför. Kommandon som börjar med %{browser} kan användas för att hämta information om ljudfilerna från webben, exempelvis frågar <screen width="40"> <userinput>%{browser} http://lyricwiki.org/%u{artist}:%u{title}</userinput> </screen> efter sångtexten för nuvarande sång hos <ulink url="http://www.lyricwiki.org">LyricWiki</ulink>. Bokstaven "u" i %u{artist} och %u{title} används för att webbadresskoda artist- %{artist} och sång- %{title} information. Det är enkelt att definiera dina egna frågor på samma sätt, <abbrev>t.ex.</abbrev> en bildsökning med <ulink url="http://www.google.com">Google</ulink>:

source: To add album cover art to tag 2, you can search for images with Google or Amazon using the commands described above. The picture can be added to the tag with drag and drop. You can also add an image with <guibutton>Add</guibutton>, then select the Picture frame and import an image file or paste from the clipboard. Picture frames are supported for ID3v2, MP4, FLAC, Ogg and ASF tags.
it: Per aggiungere la copertina dell'album al tag 2, è possibile cercare immagini con Google o Amazon utilizzando i comandi descritti sopra. L'immagine può essere aggiunta al tag con il trascinamento della selezione. È possibile aggiungere un'immagine anche con <guibutton>Aggiungi</guibutton>, quindi selezionare il frame Immagine e importare un file di immagine o incollarlo dagli appunti. I frame sono supportati per i tag ID3v2, MP4, FLAC, Ogg e ASF.
ru: Чтобы добавить обложку альбома в тег 2, возможно выполнить поиск изображений с помощью Google или Amazon, используя приведённые выше команды. Для добавления изображения в тег воспользуйтесь функцией перетаскивания или кнопкой <guibutton>Добавить</guibutton>; после нажатия этой кнопки следует выбрать фрейм изображения и импортировать файл изображения или вставить его из буфера обмена. Фреймы изображений поддерживаются для тегов ID3v2, MP4, FLAC, Ogg и ASF.
sv: För att lägga till albumomslag till tagg 2 kan du söka efter bilder med Google eller Amazon genom att använda kommandona som beskrivs ovan. Bilden kan läggas till i taggen med drag och släpp. Du kan också lägga till en bild med <guibutton>Lägg till</guibutton> och därefter markera bildramen och importera en bildfil eller klistra in från klippbordet. Bildramar stöds för ID3v2-, MP4-, FLAC-, Ogg- och ASF-taggar

source: To add and delete entries in the table, a context menu can be used.
it: Per aggiungere ed eliminare voci nella tabella, può essere utilizzato un menu contestuale.
ru: Чтобы добавить или удалить записи в таблице, воспользуйтесь контекстном меню.
sv: En sammanhangsberoende meny kan användas för att lägga till eller ta bort poster i tabellen.
