Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: The &kid3; Handbook
it: Manuale di &kid3;
ru: Руководство пользователя &kid3;
sv: Handbok &kid3;

source: Software development
it: sviluppo software
ru: Разработка программного обеспечения
sv: Programvaruutveckling

source: ROLES_OF_TRANSLATORS
it: <othercredit role="translator"><firstname>Vincenzo</firstname><surname>Reale</surname><affiliation><address><email>smart2128vr@gmail.com</email></address></affiliation><contrib>Traduzione dell'interfaccia e della documentazione</contrib></othercredit>
ru: <othercredit role="translator"><firstname>Мария</firstname><surname>Шикунова</surname><affiliation><address><email>translation-team@basealt.ru</email></address></affiliation><contrib>Перевод на русский язык</contrib></othercredit>
sv: <othercredit role="translator"> <firstname>Stefan</firstname> <surname>Asserhäll</surname> <affiliation><address><email>stefan.asserhall@bredband.net</email></address></affiliation> <contrib>Översättare</contrib></othercredit>

source: &kid3; is an application to edit the ID3v1 and ID3v2 tags in MP3 files in an efficient way. Also tags in Ogg/Vorbis, Opus, DSF, FLAC, MPC, APE, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV, AIFF files and tracker modules (MOD, S3M, IT, XM) are supported. It is easy to set tags of multiple files to the same values (<abbrev>e.g.</abbrev> album, artist, year and genre in all files of the same album) and generate the tags from the file name or vice versa.
it: &kid3; è un'applicazione per modificare i tag ID3v1 e ID3v2 nei file MP3 in modo efficiente. Sono supportati anche i tag nei file Ogg/Vorbis, Opus, DSF, FLAC, MPC, APE, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV, AIFF e nei moduli dei tracker (MOD, S3M, IT, XM). È semplice impostare i tag di più file allo stesso valore (cioè album, artista, anno e genere in tutti i file dello stesso album) e generare i tag dal nome dei file o viceversa.
ru: &kid3; — это приложение для эффективного редактирования тегов ID3v1 и ID3v2 в MP3-файлах, поддерживающее также теги файлов Ogg/Vorbis, Opus, DSF, FLAC, MPC, APE, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV, AIFF и модулей трекеров (MOD, S3M, IT, XM). Приложение позволяет легко указывать значения для тегов в разных файлах (например, название альбома, исполнителя, год и жанр во всех файлах внутри одного альбома) и создавать теги из имён файлов и наоборот.
sv: &kid3; är ett program för att redigera ID3v1 och ID3v2 taggar i MP3-filer på ett effektivt sätt. Taggar i Ogg/Vorbis-, Opus-, DSF-, FLAC-, MPC-, APE-, MP4/AAC-, MP2-, Speex-, TrueAudio-, WavPack-, WMA-, WAV-, AIFF-filer och spårningsmoduler (MOD, S3M, IT, XM) stöds också. Det är enkelt att tilldela taggar i fler filer till samma värden (t.ex. album, artist, år och genre i alla filer för samma album) och generera taggar från filnamn eller vice versa.

source: Synopsis
it: Sinossi
ru: Обзор
sv: Översikt

source: <command>kid3-qt</command> <arg><option>&doublehyphen;portable</option></arg> <arg><option>Qt-options</option></arg> <arg rep="repeat"><replaceable>FILE</replaceable></arg>
it: <command>kid3-qt</command> <arg><option>&doublehyphen;portable</option></arg> <arg><option>Opzioni Qt</option></arg> <arg rep="repeat"><replaceable>FILE</replaceable></arg>
ru: <command>kid3-qt</command> <arg><option>&doublehyphen;portable</option></arg> <arg><option>Параметры Qt</option></arg> <arg rep="repeat"><replaceable>ФАЙЛ</replaceable></arg>
sv: <command>kid3-qt</command> <arg><option>&doublehyphen;portable</option></arg> <arg><option>Qt-väljare</option></arg> <arg rep="repeat"><replaceable>FIL</replaceable></arg>

source: <command>kid3-cli</command> <arg><option>&doublehyphen;portable</option></arg> <arg><option>&doublehyphen;dbus</option></arg> <group> <arg choice="plain"><option>-h</option></arg> <arg choice="plain"><option>&doublehyphen;help</option></arg> </group> <arg><option>-c COMMAND1</option></arg> <arg rep="repeat"><option>-c COMMAND2</option></arg> <arg rep="repeat"><replaceable>FILE</replaceable></arg>
it: <command>kid3-cli</command> <arg><option>&doublehyphen;portable</option></arg> <arg><option>&doublehyphen;dbus</option></arg> <group> <arg choice="plain"><option>-h</option></arg> <arg choice="plain"><option>&doublehyphen;help</option></arg> </group> <arg><option>-c COMANDO1</option></arg> <arg rep="repeat"><option>-c COMANDO2</option></arg> <arg rep="repeat"><replaceable>FILE</replaceable></arg>
ru: <command>kid3-cli</command> <arg><option>&doublehyphen;portable</option></arg> <arg><option>&doublehyphen;dbus</option></arg> <group> <arg choice="plain"><option>-h</option></arg> <arg choice="plain"><option>&doublehyphen;help</option></arg> </group> <arg><option>-c КОМАНДА1</option></arg> <arg rep="repeat"><option>-c КОМАНДА2</option></arg> <arg rep="repeat"><replaceable>ФАЙЛ</replaceable></arg>
sv: <command>kid3-cli</command> <arg><option>&doublehyphen;portable</option></arg> <arg><option>&doublehyphen;dbus</option></arg> <group> <arg choice="plain"><option>-h</option></arg> <arg choice="plain"><option>&doublehyphen;help</option></arg> </group> <arg><option>-c KOMMANDO1</option></arg> <arg rep="repeat"><option>-c KOMMANDO2</option></arg> <arg rep="repeat"><replaceable>FIL</replaceable></arg>

source: Options
it: Opzioni
ru: Параметры
sv: Väljare

source: Store configuration in file <filename>kid3.ini</filename> inside application folder.
it: Archiviare la configurazione nel file <filename>kid3.ini</filename> nella cartella dell'applicazione.
ru: Сохранить параметры в файл <filename>kid3.ini</filename> в каталоге приложения.
sv: Lagra inställningen i filen <filename>kid3.ini</filename> i programkatalogen.

source: If <filename><replaceable>FILE</replaceable></filename> is the path to a folder, it will be opened. If one or more file paths are given, their common folder is opened and the files are selected.
it: Se <filename><replaceable>FILE</replaceable></filename> è il percorso a una cartella, essa sarà aperta. Se sono specificati uno o più percorsi, la loro cartella comune è aperta e i file selezionati.
ru: Если <filename><replaceable>ФАЙЛ</replaceable></filename> — это путь к каталогу, то он будет открыт. Если указан один или несколько путей к файлам, откроется общий каталог, а файлы будут выделены.
sv: Om <filename><replaceable>FIL</replaceable></filename> är sökvägen för en katalog, som öppnas. Om en eller flera filsökvägar anges, öppnas deras gemensamma katalog och filerna markeras.

source: Show help about options.
it: Mostra la guida sulle opzioni.
ru: Показать справку о параметрах.
sv: Visa hjälp om väljare.

source: Show author information.
it: Mostra le informazioni sull'autore.
ru: Показать сведения об авторах приложения.
sv: Visa information om upphovsman.

source: Show version information.
it: Mostra le informazioni sulla versione.
ru: Показать сведения о версии приложения.
sv: Visa versionsinformation.

source: Show license information.
it: Mostra le informazioni sulla licenza.
ru: Показать сведения о лицензии приложения.
sv: Visa licensinformation.

source: The base file name of the desktop entry for this application.
it: Il nome file della voce del desktop per questa applicazione.
ru: Имя файла .desktop (без пути) для этого приложения.
sv: Basfilnamnet på skrivbordsposten för programmet.

source: Qt-options
it: Opzioni Qt
ru: Параметры Qt
sv: Qt-väljare

source: See <citerefentry><refentrytitle>qt5options</refentrytitle> <manvolnum>7</manvolnum></citerefentry>.
it: Vedere <citerefentry><refentrytitle>qt5options</refentrytitle> <manvolnum>7</manvolnum></citerefentry>.
ru: Смотрите <citerefentry><refentrytitle>qt5options</refentrytitle> <manvolnum>7</manvolnum></citerefentry>.
sv: Se <citerefentry><refentrytitle>qt5options</refentrytitle> <manvolnum>7</manvolnum></citerefentry>.

source: Activate the &DBus; interface.
it: Attivare l'interfaccia &DBus;.
ru: Активировать интерфейс &DBus;.
sv: Aktivera &DBus;-gränssnittet.

source: Execute a command. Multiple <option>-c</option> options are possible, they are executed in sequence. See the section about <link linkend="kid3-cli">kid3-cli</link> for a description of the available commands.
it: Eseguire un comando. Più opzioni <option>-c</option> sono possibili, sono eseguite in sequenza. Vedere la sezione su <link linkend="kid3-cli">kid3-cli</link> per una descrizione dei comandi disponibili.
ru: Выполнить команду. Предусмотрена возможность использования нескольких параметров <option>-c</option> для одной команды, и они будут выполняться последовательно. Описание доступных команд приводится в разделе «<link linkend="kid3-cli">kid3-cli</link>».
sv: Kör ett kommando. Flera <option>-c</option> väljare är möjliga, och de körs i en följd. Se avsnittet om <link linkend="kid3-cli">kid3-cli</link> för en beskrivning av tillgängliga kommandon.

source: Show help about options and commands.
it: Mostra la guida sulle opzioni e sui comandi.
ru: Показать справку о параметрах и командах.
sv: Visa hjälp om väljare och kommandon.

source: Introduction
it: Introduzione
ru: Введение
sv: Inledning

source: &kid3; is an application to edit the ID3v1 and ID3v2 tags in MP3 files in an efficient way. These tags can be edited by most MP3 players, but not in a very comfortable and efficient way. Moreover the tags in Ogg/Vorbis, Opus, DSF, FLAC, MPC, APE, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV, AIFF files and tracker modules (MOD, S3M, IT, XM) are supported too.
it: &kid3; è un'applicazione per modificare i tag ID3v1 e ID3v2 nei file MP3 in modo efficiente. Questi tag possono essere modificati dalla maggior parte dei lettori MP3, ma in modo non proprio comodo ed efficiente. Inoltre, sono supportati anche i tag nei file Ogg/Vorbis, Opus, DSF, FLAC, MPC, APE, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV, AIFF e nei moduli dei tracker (MOD, S3M, IT, XM).
ru: &kid3; — это приложение для эффективного редактирования тегов ID3v1 и ID3v2 в MP3-файлах. Большинство MP3-проигрывателей позволяют редактировать эти теги, но не настолько комфортным и простым способом. Более того, приложение поддерживает теги в файлах Ogg/Vorbis, Opus, DSF, FLAC, MPC, APE, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV, AIFF и модулях трекеров (MOD, S3M, IT, XM).
sv: &kid3; är ett program för att redigera ID3v1 och ID3v2 taggar i MP3 filer på ett effektivt sätt. Taggarna kan redigeras i de flesta MP3-spelare, men inte på ett särskilt bekvämt och effektiv sätt. Dessutom stöds också taggar i Ogg/Vorbis-, Opus-, DSF-, FLAC-, MPC-, APE-, MP4/AAC-, MP2-, Speex-, TrueAudio-, WavPack-, WMA-, WAV-, AIFF-filer och spårningsmoduler (MOD, S3M, IT, XM).

source: &kid3; does not grab nor encode MP3 files, but it is targeted to edit the ID3 tags of all files of an album in an efficient way, <abbrev>i.e.</abbrev> with as few mouse clicks and key strokes as possible. Where most other programs can edit either ID3v1 or ID3v2 tags, &kid3; has full control over both versions, can convert tags between the two formats and has access to all ID3v2 tags. Tags of multiple files can be set to the same value, <abbrev>e.g.</abbrev> the artist, album, year and genre of all files of an album typically have the same values and can be set together. If the information for the tags is contained in the file name, the tags can be automatically set from the file name. It is also possible to set the file name according to the tags found in the file in arbitrary formats.
it: &kid3; non acquisisce né codifica i file MP3, ma ha lo scopo di modificare i tag ID3 di tutti i file di un album in modo efficiente, cioè con il minor numero possibile di clic del mouse e di tasti. Dove la maggior parte degli altri programmi può modificare i tag ID3v1 o ID3v2, &kid3; ha il pieno controllo su entrambe le versioni, può convertire i tag tra i due formati e ha accesso a tutti i tag ID3v2. I tag di più file possono essere impostati sullo stesso valore, <abbrev>ad es.</abbrev> l'artista, l'album, l'anno e il genere di tutti i file di un album hanno generalmente gli stessi valori e possono essere impostati insieme. Se le informazioni per i tag sono contenute nel nome del file, i tag possono essere impostati automaticamente dal nome del file. È anche possibile impostare il nome del file in base ai tag trovati nel file in formati arbitrari.
ru: &kid3; не создаёт и не кодирует файлы в формате MP3, это приложение предназначено для редактирования тегов ID3 во всех файлах в альбоме с помощью нескольких щелчков кнопкой мыши или нажатий комбинаций клавиш. Большинство других программ позволяют редактировать теги только одного типа (либо ID3v1, либо ID3v2), в то время как &kid3; предоставляет возможность свободного редактирования и преобразования тегов обоих типов, а также позволяет получить доступ ко всем тегам ID3v2. Возможно установить одинаковые значения для тегов сразу в нескольких файлах, например, указать одинаковые значения для записей исполнителя, альбома, года и жанра для всех файлов в альбоме. Если информация для тегов содержится в имени файла, теги могут быть автоматически установлены на основе имени файла. Также возможно установить имя файла в соответствии с любыми тегами, найденными в этом файле.
sv: &kid3; griper eller kodar inte MP3-filer, men har som mål att redigera ID3-taggarna i alla filer i ett album på ett effektivt sätt, dvs. med så få musklick och tangentnedtryckningar som möjligt. Även om de flesta program kan redigera antingen ID3v1 eller ID3v2 taggar, har &kid3; fullständig kontroll över båda versionerna, kan konvertera taggar mellan de två formaten och kan komma åt alla ID3v2-taggar. Taggar i flera filer kan tilldelas samma värde, t.ex. artist, album, år och genre i alla filer i ett album har ofta samma värden och kan tilldelas tillsammans. Om informationen för taggarna ingår i filnamnet kan taggarna automatiskt tilldelas från filnamnet. Det är också möjligt att ändra filnamnet enligt taggarna som hittas i filen med godtyckliga format.

source: The editing task is further supported by automatic replacement of characters or substrings, for instance to remove illegal characters from filenames. Automatic control of upper and lower case characters makes it easy to use a consistent naming scheme in all tags.
it: L'attività di modifica è ulteriormente supportata dalla sostituzione automatica di caratteri o sotto-stringhe, ad esempio per rimuovere caratteri illegali dai nomi dei file. Il controllo automatico dei caratteri maiuscoli e minuscoli semplifica l'utilizzo di uno schema di denominazione coerente in tutti i tag.
ru: Функции редактирования также включают автоматическую замену символов или подстрок, например, изъятие некорректных символов из названий файлов. Автоматическое определение регистра символов упрощает использование однородной схемы именования для всех тегов.
sv: Redigeringsaktiviteten stöds ytterligare genom automatisk ersättning av tecken eller delsträngar, exempelvis för att ta bort ogiltiga tecken från filnamn. Automatisk kontroll av stora och små bokstäver gör det enkelt att använda en konsekvent namngivningsmetod för alla taggar.

source: The tag information for full albums can be taken from <ulink url="http://gnudb.org">gnudb.org</ulink>, <ulink url="http://musicbrainz.org">MusicBrainz</ulink>, <ulink url="http://discogs.com">Discogs</ulink>, <ulink url="http://www.amazon.com">Amazon</ulink> or other sources of track lists. The import format is freely configurable by regular expressions.
it: Le informazioni dei tag per interi album possono essere recuperate da <ulink url="http://gnudb.org">gnudb.org</ulink>, <ulink url="http://musicbrainz.org">MusicBrainz</ulink>, <ulink url="http://discogs.com">Discogs</ulink>, <ulink url="http://www.amazon.com">Amazon</ulink> o altre fonti di elenchi di tracce. Il formato di importazione è liberamente configurabile tramite espressioni regolari.
ru: Данные тегов полных альбомов доступны на <ulink url="http://gnudb.org">gnudb.org</ulink>, <ulink url="http://musicbrainz.org">MusicBrainz</ulink>, <ulink url="http://discogs.com">Discogs</ulink>, <ulink url="http://www.amazon.com">Amazon</ulink>, а также на других ресурсах. Формат импорта возможно настраивать произвольным образом с помощью регулярных выражений.
sv: Tagginformationen för hela album kan tas från <ulink url="http://gnudb.org">gnudb.org</ulink>, <ulink url="http://musicbrainz.org">MusicBrainz</ulink>, <ulink url="http://discogs.com">Discogs</ulink>, <ulink url="http://www.amazon.com">Amazon</ulink> eller andra källor för spårlistor. Importformatet är fritt inställningsbart med reguljära uttryck.

source: Please report any problems or feature requests to the author.
it: Segnalare qualsiasi problema o richiesta di funzionalità all'autore.
ru: Чтобы сообщить о найденной ошибке или предложить новую функцию, обратитесь к автору программы.
sv: Rapportera gärna eventuella problem eller önskemål till upphovsmannen.

source: Using &kid3;
it: Utilizzare &kid3;
ru: Работа с &kid3;
sv: Använda &kid3;

source: &kid3; features
it: Funzionalità di &kid3;
ru: Возможности &kid3;
sv: Funktioner i &kid3;

source: Edit ID3v1.1 tags
it: Modificare i tag ID3v1.1
ru: Редактирование тегов ID3v1.1
sv: Redigera ID3v1.1 taggar

source: Edit all ID3v2.3 and ID3v2.4 frames
it: Modificare tutti i frame ID3v2.3 e ID3v2.4
ru: Редактирование всех фреймов ID3v2.3 и ID3v2.4
sv: Redigera alla ID3v2.3 och ID3v2.4 ramar

source: Edit tags of multiple files
it: Modificare i tag di più file
ru: Одновременное редактирование тегов нескольких файлов
sv: Redigera taggar i flera filer

source: Convert between ID3v1 and ID3v2 tags
it: Convertire tra tag ID3v1 e ID3v2
ru: Преобразование тегов ID3v1 и ID3v2 между собой
sv: Konvertera mellan ID3v1 och ID3v2 taggar

source: Edit MP3, Ogg/Vorbis, Opus, DSF, FLAC, MPC, APE, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV and AIFF tags
it: Modificare i tag MP3, Ogg/Vorbis, Opus, DSF, FLAC, MPC, APE, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV and AIFF
ru: Редактирование тегов MP3, Ogg/Vorbis, Opus, DSF, FLAC, MPC, APE, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV и AIFF
sv: Redigera MP3-, Ogg/Vorbis-, Opus-, DSF-, FLAC-, MPC-, APE-, MP4/AAC-, MP2-, Speex-, TrueAudio-, WavPack-, WMA-, WAV- och AIFF-taggar

source: Generate tags from filename
it: Generare i tag dal nome file
ru: Создание тегов на основе имени файла
sv: Generera taggar från filnamn

source: Generate tags from the contents of tag fields
it: Generare i tag dal contenuto dei campi dei tag
ru: Создание тегов по содержимому полей тегов
sv: Generera taggar från innehållet i taggfält

source: Generate filename from tags
it: Generare il nome file dai tag
ru: Создание названий файлов по тегам
sv: Generera filnamn från taggar

source: Generate and change folder names from tags
it: Generare e cambiare il nome delle cartelle dai tag
ru: Создание и изменение имён каталогов по тегам
sv: Generera och ändra katalognamn från taggar

source: Generate playlist file
it: Generare file della scaletta
ru: Создание файлов списков воспроизведения
sv: Genererar spellistefil

source: Automatic case conversion and string translation
it: Conversione automatica delle maiuscole/minuscole e traduzione delle stringhe
ru: Автоматическое преобразование регистра и переноса строк
sv: Automatisk skiftlägeskonvertering och strängöversättning

source: Import from <ulink url="http://gnudb.org">gnudb.org</ulink>, <ulink url="http://musicbrainz.org">MusicBrainz</ulink>, <ulink url="http://discogs.com">Discogs</ulink>, <ulink url="http://www.amazon.com">Amazon</ulink> and other data sources
it: Importare da <ulink url="http://gnudb.org">gnudb.org</ulink>, <ulink url="http://musicbrainz.org">MusicBrainz</ulink>, <ulink url="http://discogs.com">Discogs</ulink>, <ulink url="http://www.amazon.com">Amazon</ulink> e altre fonti di dati
ru: Импорт данных из <ulink url="http://gnudb.org">gnudb.org</ulink>, <ulink url="http://musicbrainz.org">MusicBrainz</ulink>, <ulink url="http://discogs.com">Discogs</ulink>, <ulink url="http://www.amazon.com">Amazon</ulink> и других источников
sv: Importera från <ulink url="http://gnudb.org">gnudb.org</ulink>, <ulink url="http://musicbrainz.org">MusicBrainz</ulink>, <ulink url="http://discogs.com">Discogs</ulink>, <ulink url="http://www.amazon.com">Amazon</ulink> och andra datakällor

source: Export as CSV, &HTML;, playlist, Kover &XML; and other formats. Exported CSV files can be imported again.
it: Esportare come CSV, &HTML;, scaletta, Kover &XML; e altri formati. I file CSV esportati possono essere importati nuovamente.
ru: Экспорт данных в форматах CSV, &HTML;, списков воспроизведения, Kover &XML; и других. Экспортированные файлы в формате CSV возможно заново импортировать
sv: Exportera som CSV, &HTML;, spellista, Kover &XML; och andra format. Exporterade CSV-filer kan importeras igen.

source: Example Usage
it: Esempio d'uso
ru: Пример использования
sv: Exempel på användning
