Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: The filter can be used to display only those files which match certain criteria. This is helpful if you want to organize a large collection and only edit those files which are not in the desired scheme. The expression defining which files to display uses the same format codes which are used in the file name format, import and export.
it: Il filtro può essere utilizzato per visualizzare solo quei file che soddisfano determinati criteri. Ciò è utile se si desidera organizzare una raccolta di grandi dimensioni e modificare solo i file che non si trovano nello schema desiderato. L'espressione che definisce i file da visualizzare utilizza gli stessi codici di formato utilizzati nel formato del nome file, nell'importazione e nell'esportazione.
ru: Фильтр предоставляет возможность отображения только тех файлов, которые соответствуют определённым требованиям. Эта функция полезна при работе с большой коллекцией, она позволяет отредактировать только определённые файлы. В выражении, определяющем, какие файлы будут показаны, используются те же коды формата, что и для формата имени файла, импорта и экспорта.
sv: Filtret kan användas för att bara visa de filer som motsvarar vissa kriterier. Det är användbart om du vill organisera en stor samling och bara redigera filerna som inte har önskat format. Uttrycket som definierar vilka filer som ska visas använder samma formatkoder som används för filnamnsformat, import och export.

source: %p %{filepath} Absolute path to file
it: %p %{filepath} Percorso assoluto al file
ru: %p %{filepath} Абсолютный путь к файлу
sv: %p %{filepath} Absolut sökväg till fil

source: %w %{marked} Marked, is 1 if the file is marked (<abbrev>e.g.</abbrev> because of truncation or standard violation), empty otherwise
it: %w %{marked} Marcato, è 1 se il file è marcato (<abbrev>ad es.</abbrev> a causa di troncamento o violazione dello standard), vuoto altrimenti
ru: %w %{marked} Отмечено, равно 1, если файл содержит отметку (например, из-за усечения или нарушения стандарта), является пустым, если отметок нет
sv: %w %{marked} Markerad, är 1 om filen är markerad (<abbrev>t.ex.</abbrev> på grund av avkortning eller avvikelse från standarden), annars tom

source: %1a %1{artist}, ... Use the prefix 1 to get values of tag 1
it: %1a %1{artist}, ... Utilizzare il prefisso 1 per ottenere i valori di tag 1
ru: %1a %1{artist}, ... Использовать префикс 1, чтобы получить значения тега 1
sv: %1a %1{artist}, ... Använd prefix 1 för att få värdet på tagg 1

source: %2a %2{artist}, ... Use the prefix 2 to get values of tag 2
it: %2a %2{artist}, ... Utilizzare il prefisso 2 per ottenere i valori di tag 2
ru: %2a %2{artist}, ... Использовать префикс 2, чтобы получить значения тега 2
sv: %a %{artist}, ... Använd prefix 2 för att få värdet på tagg 2

source: These codes are replaced with the values for the file, and the resulting strings can be compared with the following operations:
it: Questi codici sono sostituiti con i valori per il file e le stringhe risultanti possono essere confrontate con le seguenti operazioni:
ru: Эти коды заменяются значениями для файла, и полученные строки можно будет сравнивать со следующими операциями:
sv: Koderna ersätts med filens värden, och resulterade strängarna kan jämföras med följande operationer:

source: s1 equals s2: true if s1 and s2 are equal.
it: s1 equals s2: vero se s1 e s2 sono uguali.
ru: s1 equals s2: выполняется, если s1 равно s2.
sv: s1 equals s2: true om s1 och s2 är lika.

source: s1 contains s2: true if s1 contains s2, <abbrev>i.e.</abbrev> s2 is a substring of s1.
it: s1 contains s2: vero se s1 contiene s2, cioè s2 è una sottostringa di s1.
ru: s1 contains s2: выполняется, если s1 содержит s2, то есть s2 — это подстрока s1.
sv: s1 contains s2: true om s1 innehåller s2, <abbrev>dvs.</abbrev> s2 är en delsträng av s1.

source: s matches re: true if s matches the regular expression re.
it: s matches re: vero se s verifica l'espressione regolare re.
ru: s matches re: выполняется, если s соответствует регулярному выражению re.
sv: s matches re: true om s matchar det reguljära uttrycket re.

source: True expressions are replaced by 1, false by 0. True values are represented by 1, true, on and yes, false values by 0, false, off and no. Boolean operations are not, and, or (in this order of precedence) and can be grouped by parentheses.
it: Le espressioni vere sono sostituite da 1, false da 0. I valori veri sono rappresentati da 1, true, on e yes, i valori falsi da 0, false, off e no. Le operazioni booleane sono not, and, or (in questo ordine di precedenza) e possono essere raggruppate tra parentesi.
ru: Выражения, вычисление которых даёт значение true, будут заменены на 1, а те, которые дают false, — на 0. Значение ИСТИНА (true) может быть представлено как 1, true, on и yes, значение ЛОЖЬ — 0, false, off и no. Логические операции not, and, or (в таком порядке приоритета) возможно группировать с помощью скобок.
sv: Sanna uttryck ersätts med 1, falska med 0. Sanna värden representeras med 1, true, on och yes. Falska värden av 0, false, off och no. Booleska operationer är not, and, or (i den rangordningen) och kan grupperas med parenteser.

source: Some filter rules are predefined and can serve as examples for your own expressions:
it: Alcune regole di filtro sono predefinite e possono servire da esempio per le proprie espressioni:
ru: Некоторые правила фильтрации уже предустановлены и могут служить примерами для пользовательских выражений:
sv: Några filterregler är fördefinierade och kan tjäna som exempel för dina egna uttryck:

source: <term>All</term>
it: <term>Tutto</term>
sv: <term>Alla</term>

source: When the file list is filtered - this is shown by "[filtered]" in the window title - and all files shall be displayed again, the filtering can be reverted using this filter. It uses an empty expression, but a true value would have the same effect.
it: Quando l'elenco dei file viene filtrato - questo è indicato da «[filtrato]» nel titolo della finestra - e tutti i file devono essere nuovamente visualizzati, il filtro può essere ripristinato utilizzando questo filtro.Utilizza un'espressione vuota, ma un valore vero avrebbe lo stesso effetto.
ru: Если к списку файлов был применён фильтр, в заголовке окна будет отображена надпись «[фильтровано]». Этот пункт позволяет снять фильтрацию, и все файлы снова будут отображаться. В соответствующем фильтре используется пустое выражение, но значение «true» для фильтра тоже приведёт к тому же результату.
sv: När fillistan är filtrerad (det visas med "[filtrerad]" i fönsterrubriken) och alla filer ska visas igen, kan filtreringen återställas med det här filtret. Det använder ett tomt uttryck, men ett sant värde skulle få samma effekt.

source: Filename Tag Mismatch
it: Mancata corrispondenza tra nome file e tag
sv: Filnamn tagg missanpassning

source: Tests if the file path conforms with the file name format. This rule is automatically adapted if the file name format changes.
it: Verifica se il percorso del file è conforme al formato del nome file. Questa regola viene adattata automaticamente se cambia il formato del nome file.
ru: Проверяет, соответствует ли путь к файлу формату названия этого файла. Это правило автоматически синхронизируется с изменениями в формате названий файлов.
sv: Testar om filsökvägen motsvarar filnamnsformatet. Regeln anpassas automatiskt om filnamnsformatet ändras.

source: No Tag 1
it: Nessun tag 1
sv: Ingen tagg 1

source: Displays only files which do not have a tag 1.
it: Visualizza solo i file che non hanno un tag 1.
ru: Отображает только те файлы, которые не содержат тег 1.
sv: Visa bara filer som inte har tagg 1.

source: No Tag 2
it: Nessun tag 2
sv: Ingen tagg 2

source: Displays only files which do not have a tag 2.
it: Visualizza solo i file che non hanno un tag 2.
ru: Отображает только те файлы, которые не содержат тег 2.
sv: Visa bara filer som inte har tagg 2.

source: ID3v2.3.0 Tag
it: Tag ID3v2.3.0
sv: ID3v2.3.0 tagg

source: Displays only files which have an ID3v2.3.0 tag.
it: Visualizza solo i file che non hanno un tag ID3v2.3.0.
ru: Отображает только те файлы, которые содержат тег ID3v2.3.0.
sv: Visa bara filer som inte har en ID3v2.3.0 tagg.

source: ID3v2.4.0 Tag
it: Tag ID3v2.4.0
sv: ID3v2.4.0 tagg

source: Displays only files which have an ID3v2.4.0 tag.
it: Visualizza solo i file che non hanno un tag ID3v2.4.0.
ru: Отображает только те файлы, которые содержат тег ID3v2.4.0.
sv: Visa bara filer som inte har en ID3v2.4.0 tagg.

source: Displays files with differences between tag 1 and tag2.
it: Visualizza i file con differenze tra tag 1 e tag 2.
ru: Отображает файлы с различиями между тегом 1 и тегом 2.
sv: Visar filer med skillnader mellan tagg 1 och tagg 2.

source: Displays files with identical tag 1 and tag 2.
it: Visualizza i file con tag 1 e tag 2 identici.
ru: Отображает файлы с одинаковыми тегом 1 и тегом 2.
sv: Visar filer med identiska tagg 1 och tagg 2.

source: Incomplete
it: Incompleto
sv: Ofullständig

source: Displays files with empty values in the standard tags (title, artist, album, date, track number, genre).
it: Visualizza i file con valori vuoti nei tag standard (titolo, artista, album, data, numero traccia, genere).
ru: Отображает файлы с пустыми значениями в стандартных тегах (заголовок, исполнитель, альбом, дата, номер дорожки, жанр).
sv: Visar filer med tomma värden i standardtaggarna (titel, artist, album, datum, spårnummer, genre).

source: No Picture
it: Nessuna immagine
sv: Ingen bild

source: Displays only files which do not have a picture.
it: Visualizza solo i file che non hanno un'immagine.
ru: Отображает только те файлы, которые не содержат обложку.
sv: Visa bara filer som inte har en bild.

source: Marked
it: Marcato
sv: Markerad

source: Displays only files which are marked because they violate the ID3 standard, are truncated or the picture is too large.
it: Visualizza solo i file che sono marcati perché violano lo standard ID3, sono troncati o l'immagine è troppo grande.
ru: Отображает только те файлы, которые отмечены, потому что они не соответствуют стандарту ID3, усечены или содержат слишком большое изображение обложки альбома.
sv: Visar bara filerna som är markerade eftersom de bryter mot ID3-standarden, är avkortade eller har en för stor bild.

source: Custom Filter
it: Filtro personalizzato
sv: Egna filter

source: To add your own filter, select this entry. For instance, if you want to have a filter for artists starting with "The", replace "Custom Filter" with the name "The Bands" and press <keycap>Enter</keycap>. Then insert the following expression into the line edit:
it: Per aggiungere il proprio filtro, selezionare questa voce. Ad esempio, se sidesidera avere un filtro per gli artisti che iniziano con «The», sostituire «Filtro personalizzato» con il nome «The Bands» e premere <keycap>Invio</keycap>. Quindi inserire la seguente espressione nel campo di testo:
ru: Выберите этот пункт, чтобы добавить собственный фильтр. Например, если требуется создать фильтр для исполнителей, названия которых начинаются со слова «The», замените текст «Custom Filter» на название «The-группы» и нажмите клавишу <keycap>Enter</keycap>. Вставьте следующее выражение в строку редактирования:
sv: Välj den här posten för att lägga till ditt eget filter. Om du exempelvis vill ha ett filter för artister som börjar med "The", ersätt "Eget filter" med namnet "The Bands" och tryck på <keycap>Enter</keycap>. Infoga därefter följande uttryck i radeditorn:

source: Then click <guibutton>Save Settings</guibutton>. Click <guibutton>Apply</guibutton> to filter the files. All files processed are displayed in the text view, with a "+" for those who match the filter and a "-" for the others. When finished, only the files with an artist starting with "The" are displayed, and the window title is marked with "[filtered]".
it: Quindi fare clic su <guibutton>Salva impostazioni</guibutton>. Fare clic su <guibutton>Applica</guibutton> per filtrare i file. Tutti i file elaborati sono visualizzati nella vista di testo, con un «+» per quelli che corrispondono al filtro e un «-» per gli altri. Al termine, sono visualizzati solo i file con un artista il cui nome inizia con «The» e il titolo della finestra è marcato con «[filtrato]».
ru: Затем нажмите кнопку <guibutton>Сохранить параметры</guibutton>. Чтобы применить фильтр к файлам, нажмите кнопку <guibutton>Применить</guibutton>. Все обработанные файлы отображаются в текстовом виде со знаком «+» для тех файлов, которые соответствуют фильтру, и «-» для остальных. По окончании отображаются только файлы с исполнителем, название которого начинается с «The», а в заголовке окна появляется надпись «[фильтровано]».
sv: Klicka därefter på <guibutton>Spara inställningar</guibutton>. Klicka på <guibutton>Verkställ</guibutton> för att filtrera filerna. Alla filer som behandlas visas i textvyn med ett "+" för de som motsvarar filtret och ett "-" för de övriga. När det är klart, visas bara filerna med en artist som börjar på "The", och fönsterrubriken är markerad med "[filtrerad]".

source: <guimenu>Tools</guimenu> <guimenuitem>Convert ID3v2.3 to ID3v2.4</guimenuitem>
it: <guimenu>Strumenti</guimenu> <guimenuitem>Converti ID3v2.3 in ID3v2.4</guimenuitem>
ru: <guimenu>Сервис</guimenu> <guimenuitem>Преобразовать ID3v2.3 в ID3v2.4</guimenuitem>
sv: <guimenu>Verktyg</guimenu> <guimenuitem>Konvertera till ID3v2.3 till ID3v2.4</guimenuitem>

source: If there are any ID3v2.3 tags in the selected files, they will be <action>converted to ID3v2.4</action> tags. Frames which are not supported by TagLib will be discarded. Only files without unsaved changes will be converted.
it: Se ci sono tag ID3v2.3 nei file selezionati, saranno <action>convertiti in tag ID3v2.4</action>. I frame che non sono supportati da TagLib saranno eliminati. Saranno convertiti solo i file senza modifiche non salvate.
ru: Если в выделенных файлах содержатся теги ID3v2.3, они будут <action>преобразованы в теги ID3v2.4</action>. Фреймы, которые не поддерживаются библиотекой TagLib, не будут учитываться. Преобразовываются только файлы без несохранённых изменений.
sv: Om det finns några ID3v2.3 taggar i de markerade filerna <action>konverteras de till ID3v2.4</action> taggar. Ramar som inte stöds av TagLib kastas. Bara filer utan osparade ändringar konverteras.

source: <guimenu>Tools</guimenu> <guimenuitem>Convert ID3v2.4 to ID3v2.3</guimenuitem>
it: <guimenu>Strumenti</guimenu> <guimenuitem>Converti ID3v2.4 in ID3v2.3</guimenuitem>
ru: <guimenu>Сервис</guimenu> <guimenuitem>Преобразовать ID3v2.4 в ID3v2.3</guimenuitem>
sv: <guimenu>Verktyg</guimenu> <guimenuitem>Konvertera till ID3v2.4 till ID3v2.3</guimenuitem>

source: If there are any ID3v2.4 tags in the selected files, they will be <action>converted to ID3v2.3</action> tags. Only files without unsaved changes will be converted.
it: Se ci sono tag ID3v2.4 nei file selezionati, saranno <action>convertiti in tag ID3v2.3</action>. Saranno convertiti solo i file senza modifiche non salvate.
ru: Если в выделенных файлах содержатся теги ID3v2.4, они будут <action>преобразованы в теги ID3v2.3</action>. Преобразовываются только файлы без несохранённых изменений.
sv: Om det finns några ID3v2.4 taggar i de markerade filerna <action>konverteras de till ID3v2.3</action> taggar. Bara filer utan osparade ändringar konverteras.

source: <guimenu>Tools</guimenu> <guimenuitem>Play</guimenuitem>
it: <guimenu>Strumenti</guimenu> <guimenuitem>Riproduci</guimenuitem>
ru: <guimenu>Сервис</guimenu> <guimenuitem>Воспроизведение</guimenuitem>
sv: <guimenu>Verktyg</guimenu> <guimenuitem>Spela</guimenuitem>

source: This opens a simple toolbar to play audio files. It contains buttons for the basic operations (<guibutton>Play/Pause</guibutton>, <guibutton>Stop playback</guibutton>, <guibutton>Previous Track</guibutton>, <guibutton>Next Track</guibutton>, <guibutton>Close</guibutton>), sliders for position and volume and a display of the current position. If multiple files are selected, the selected tracks are played, else all files will be played.
it: Si apre una semplice barra degli strumenti per riprodurre file audio. Contiene i pulsanti per le operazioni di base (<guibutton>Riproduci/Pausa</guibutton>, <guibutton>Interrompi riproduzione</guibutton>, <guibutton>Traccia precedente</guibutton>, <guibutton>Traccia successiva</guibutton>, <guibutton>Chiudi</guibutton>), cursori per posizione e volume e un indicatore della posizione attuale. Se si selezionati più file, le tracce selezionate sono riprodotte, altrimenti saranno riprodotti tutti i file.
ru: Открывает простую панель инструментов для воспроизведения аудиофайлов. Панель содержит кнопки для стандартных действий (<guibutton>Воспроизвести или приостановить</guibutton>, <guibutton>Остановить воспроизведение</guibutton>, <guibutton>Предыдущая дорожка</guibutton>, <guibutton>Следующая дорожка</guibutton>, <guibutton>Закрыть</guibutton>), ползунки для регулирования позиции и громкости, а также индикатор текущей позиции. Если выбрано несколько файлов, будут воспроизводиться выбранные дорожки. Если же ничего не выбрано, будут воспроизводиться все файлы.
sv: Visar en enkel verktygsrad för att spela ljudfiler. Den innehåller knappar för grundfunktionerna (<guibutton>Spela/Paus</guibutton>, <guibutton>Stoppa uppspelning</guibutton>, <guibutton>Föregående spår</guibutton>, <guibutton>Nästa spår</guibutton>, <guibutton>Stäng</guibutton>), skjutreglage för position och volym, samt visning av aktuell position. Om flera filer är markerade, spelas de markerade spåren, annars spelas alla filer.

source: The Settings Menu
it: Il menu Impostazioni
ru: Меню «Настройка»
sv: Menyn Inställningar

source: <guimenu>Settings</guimenu> <guimenuitem>Show Toolbar</guimenuitem>
it: <guimenu>Impostazioni</guimenu> <guimenuitem>Mostra la barra degli strumenti</guimenuitem>
ru: <guimenu>Настройка</guimenu> <guimenuitem>Показать панель инструментов</guimenuitem>
sv: <guimenu>Inställningar</guimenu> <guimenuitem>Visa verktygsrad</guimenuitem>

source: Toggles displaying of the toolbar.
it: Commuta la visualizzazione della barra degli strumenti.
ru: Переключает отображение панели инструментов.
sv: Ändrar visning av verktygsraden.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
it: <guimenu>Impostazioni</guimenu> <guimenuitem>Mostra la barra di stato</guimenuitem>
ru: <guimenu>Настройка</guimenu> <guimenuitem>Показать строку состояния</guimenuitem>
sv: <guimenu>Inställningar</guimenu> <guimenuitem>Visa statusrad</guimenuitem>

source: <action>Toggles displaying of the statusbar</action>, which displays longer actions such as opening or saving a folder.
it: <action>Commuta la visualizzazione della barra di stato</action>, che visualizza azioni più lunghe come l'apertura o il salvataggio di una cartella.
ru: <action>Переключает отображение строки состояния</action>, в которой показаны более длительные действия, такие как открытие или сохранение каталога.
sv: <action>Ändrar visning av statusraden</action>, som visar längre åtgärder som att öppna eller spara en katalog.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Picture</guimenuitem>
it: <guimenu>Impostazioni</guimenu> <guimenuitem>Mostra immagine</guimenuitem>
ru: <guimenu>Настройка</guimenu> <guimenuitem>Показывать изображение</guimenuitem>
sv: <guimenu>Inställningar</guimenu> <guimenuitem>Visa bild</guimenuitem>

source: Toggles displaying of the album cover art preview picture.
it: Commuta la visualizzazione dell'immagine di anteprima della copertina dell'album.
ru: Переключает отображение обложки.
sv: Ändrar visning av förhandsgranskningsbilden av albumomslag.

source: <guimenu>Settings</guimenu> <guimenuitem>Auto Hide Tags</guimenuitem>
it: <guimenu>Impostazioni</guimenu><guimenuitem>Nascondi automaticamente i tag</guimenuitem>
ru: <guimenu>Настройка</guimenu> <guimenuitem>Автоматически скрывать теги</guimenuitem>
sv: <guimenu>Inställningar</guimenu> <guimenuitem>Dölj taggar automatiskt</guimenuitem>

source: Empty tags are automatically hidden if this option is active. The <guilabel>File</guilabel>, <guilabel>Tag 1</guilabel> and <guilabel>Tag 2</guilabel> sections can be manually collapsed and expanded by clicking on the corresponding <guibutton>-</guibutton>/<guibutton>+</guibutton> buttons.
it: I tag vuoti sono automaticamente nascosti se questa opzione è attiva. Le sezioni <guilabel>File</guilabel>, <guilabel>Tag 1</guilabel> e <guilabel>Tag 2</guilabel> possono essere compresse manualmente ed espanse facendo clic sui pulsanti corrispondenti <guibutton>-</guibutton>/<guibutton>+</guibutton>.
ru: Если флажок установлен, пустые теги будут скрыты автоматически. Кнопки <guibutton>-</guibutton>/<guibutton>+</guibutton> позволяют вручную свернуть или развернуть разделы <guilabel>Файл</guilabel>, <guilabel>Тег 1</guilabel> и <guilabel>Тег 2</guilabel>.
sv: Tomma taggar är automatiskt dolda om alternativet är aktivt. Sektionerna <guilabel>Fil</guilabel>, <guilabel>Tagg 1</guilabel> och <guilabel>Tagg 2</guilabel> kan dras ihop och expanderas manuellt genom att klicka på motsvarande knappar <guibutton>-</guibutton>/<guibutton>+</guibutton>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcut keys...</guimenuitem>
it: <guimenu>Impostazioni</guimenu> <guimenuitem>Configurare scorciatoie da tastiera...</guimenuitem>
ru: <guimenu>Настройка</guimenu> <guimenuitem>Комбинации клавиш...</guimenuitem>
sv: <guimenu>Inställningar</guimenu> <guimenuitem>Anpassa snabbtangenter...</guimenuitem>

source: Opens a dialog to assign keyboard shortcuts for most of the program functions. There are even functions without corresponding menu or button available, <abbrev>e.g.</abbrev> next file, previous file, select all.
it: Apre una finestra per assegnare le scorciatoie da tastiera per la maggior parte delle funzioni del programma. Ci sono anche funzioni senza menu o pulsante corrispondente disponibili, <abbrev>ad es.</abbrev> file successivo, file precedente, selezionare tutto.
ru: Открывает диалог настройки комбинаций клавиш для большинства функциональных возможностей программы. Доступны даже функции без соответствующего пункта меню или кнопки, например, переход к следующему файлу, предыдущему файлу, выбор всех файлов.
sv: Visar en dialogruta för att tilldela snabbtangenter för de flesta av programmets funktioner. Det finns till och med funktioner utan motsvarande meny eller knapp tillgängliga, <abbrev>t.ex.</abbrev> nästa fil, föregående fil, markera alla.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &kid3;...</guimenuitem>
it: <guimenu>Impostazioni</guimenu> <guimenuitem>Configura &kid3;...</guimenuitem>
ru: <guimenu>Настройка</guimenu> <guimenuitem>Настроить &kid3;...</guimenuitem>
sv: <guimenu>Inställningar</guimenu> <guimenuitem>Anpassa &kid3;...</guimenuitem>

source: Opens the <action>configuration dialog</action>, which consists of pages for tags, files, user actions, and network settings.
it: Apre la <action>finestra di configurazione</action>, che consiste di pagine per tag, azioni dell'utente e impostazioni di rete.
ru: Открывает <action>диалог настройки параметров приложения</action>, который содержит разделы для настройки тегов, файлов, команд пользователя и параметров сети.
sv: Visar <action>inställningsdialogrutan</action>, som består av sidor för taggar, filer, användaråtgärder och nätverksinställningar.
