Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: <guimenu>File</guimenu> <guimenuitem>Automatic Import...</guimenuitem>
it: <guimenu>File</guimenu> <guimenuitem>Importazione automatica...</guimenuitem>
ru: <guimenu>Файл</guimenu> <guimenuitem>Автоматический импорт...</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Automatisk import...</guimenuitem>

source: <action>Automatic Import</action> allows one to import information for multiple albums from various web services. If folders are selected in the file list, track data for the selected folders will be imported. If no folder is selected, all folders in the file list will be imported.
it: <action>Importazione automatica</action> consente di importare informazioni per più album da vari servizi Web. Se le cartelle sono selezionate nell'elenco dei file, saranno importati i dati di traccia per le cartelle selezionate. Se non è selezionata alcuna cartella, saranno importate tutte le cartelle nell'elenco dei file.
ru: <action>Автоматический импорт</action> позволяет импортировать данные для нескольких альбомов с различных веб-сервисов. Если в списке файлов выбраны каталоги, будут импортированы данные дорожек для выделенных каталогов. Если не выделен ни один каталог, будут импортированы данные для всех каталогов в списке файлов.
sv: <action>Automatisk import</action> gör att man kan importera information från flera album på diverse webbtjänster. Om kataloger är markerade i fillistan, importeras spårdata för de markerade katalogerna. Om inga kataloger är markerade, importeras alla kataloger i fillistan.

source: The tag type (Tag 1, Tag 2, Tag 1 and Tag 2) can be selected using the <guilabel>Destination</guilabel> combo box.
it: Il tipo di tag (tag 1, tag 2, tag 1 e tag 2) può essere selezionato utilizzando la casella combinata <guilabel>Destinazione</guilabel>.
ru: Тип тега («Тег 1», «Тег 2», «Тег 1 и тег 2») выбирается в раскрывающемся списке <guilabel>Место назначения</guilabel>.
sv: Taggtypen (Tagg 1, Tagg 2, Tagg 1 och tagg 2) kan väljas med kombinationsrutan <guilabel>Mål</guilabel>.

source: Profiles determine which servers will be contacted to fetch album information. Some profiles are predefined (All, MusicBrainz, Discogs, Cover Art), custom profiles can be added using the <guibutton>Add</guibutton> button at the right of the <guilabel>Profile</guilabel> combo box.
it: I profili determinano quali server saranno contattati per recuperare le informazioni sull'album. Alcuni profili sono predefiniti (Tutti, MusicBrainz, Discogs, Copertina), i profili personalizzati possono essere aggiunti utilizzando il pulsante <guibutton>Aggiungi</guibutton> a destra della casella combinata <guilabel>Profilo</guilabel>.
ru: Профили указывают, к каким серверам следует обратиться, чтобы получить информацию об альбоме. Некоторые профили предустановлены («All», «MusicBrainz», «Discogs», «Cover Art»); чтобы добавить дополнительные профили, воспользуйтесь кнопкой <guibutton>Добавить</guibutton>, расположенной справа от раскрывающегося списка <guilabel>Профиль</guilabel>.
sv: Profiler bestämmer vilka servrar som kontaktas för att hämta albuminformation. Vissa profiler är fördefinierade (Alla, MusicBrainz, Discogs, Omslag), och egna profiler kan läggas till genom att använda knappen <guibutton>Lägg till</guibutton> till höger om kombinationsrutan <guilabel>Profil</guilabel>.

source: The table below shows the servers which will be used when importing album information using the selected profile. The import process for an album is finished if all required information has been found, so the order of the rows in the table is important. It can be changed using the <guibutton>Move Up</guibutton> and <guibutton>Move Down</guibutton> buttons. <guibutton>Edit</guibutton> can be used to change an existing entry. The <guibutton>Server</guibutton> selection offers the same servers as can be used in the import functions. <guilabel>Standard Tags</guilabel>, <guilabel>Additional Tags</guilabel>, <guilabel>Cover Art</guilabel> determine the information which shall be fetched from the server. Finally, <guilabel>Accuracy</guilabel> is the minimum accuracy which must be achieved to accept the imported data. If the accuracy is insufficient, the next server in the list will be tried. The same dialog containing the server properties appears when <guibutton>Add</guibutton> is clicked to add a new server entry. Existing entries can be deleted using <guibutton>Remove</guibutton>.
it: La tabella seguente mostra i server che saranno utilizzati durante l'importazione delle informazioni sull'album utilizzando il profilo selezionato. Il processo di importazione di un album è terminato se sono state trovate tutte le informazioni richieste, quindi l'ordine delle righe nella tabella è importante. Può essere modificato utilizzando i pulsanti <guibutton>Sposta su</guibutton> e <guibutton>Sposta giù</guibutton>. <guibutton>Modifica</guibutton> può essere utilizzato per modificare una voce esistente. La selezione <guibutton>Server</guibutton> offre gli stessi server che possono essere utilizzati nelle funzioni di importazione. <guilabel>Tag standard</guilabel>, <guilabel>Tag aggiuntivi</guilabel>, <guilabel>Copertina</guilabel> determinano le informazioni che devono essere recuperate dal server. Infine, <guilabel>Precisione</guilabel> è l'accuratezza minima che deve essere raggiunta per accettare i dati importati. Se la precisione non è sufficiente, sarà tentato il server successivo nell'elenco. La stessa finestra contenente le proprietà del server appare quando si fa clic su <guibutton>Aggiungi</guibutton> per aggiungere una nuova voce dei server. Le voci esistenti possono essere eliminate utilizzando <guibutton>Rimuovi</guibutton>.
ru: В таблице ниже приведён список серверов, которые будут использоваться при импорте информации об альбоме с помощью выбранного профиля. Процесс импорта данных альбома завершается после получения всей необходимой информации, поэтому порядок строк в таблице имеет значение. Изменить порядок позволяют кнопки <guibutton>Переместить вверх</guibutton> и <guibutton>Переместить вниз</guibutton>. Кнопка <guibutton>Изменить...</guibutton> позволяет внести изменения в существующую запись. В столбце <guibutton>Сервер</guibutton> представлены те же серверы, что и в функциях импорта. Флажки <guilabel>Стандартные теги</guilabel>, <guilabel>Дополнительные теги</guilabel>, <guilabel>Обложки</guilabel> определяют информацию, которая будет получена с сервера. В столбце <guilabel>Точность</guilabel> указывается точность, которой требуется достичь при импорте данных. Если заданный уровень точности не будет достигнут, приложение попытается получить данные со следующего сервера. Аналогичный диалог со свойствами сервера появляется при нажатии кнопки <guibutton>Добавить...</guibutton> для добавления новой записи сервера. Кнопка <guibutton>Убрать</guibutton> позволяет удалить существующие записи.
sv: Tabellen nedan visar servrarna som används när albuminformation importeras med användning av den valda profilen. Importprocessen för ett album är klar om all nödvändig information har hittas, så radernas ordning i tabellen är viktig. Den kan ändras genom att använda knapparna <guibutton>Flytta upp</guibutton> och <guibutton>Flytta ner</guibutton>. <guibutton>Redigera</guibutton> kan användas för att ändra en befintlig post. Valet <guibutton>Server</guibutton> erbjuder samma servrar som kan användas av importfunktionerna. <guilabel>Standardtaggar</guilabel>, <guilabel>Ytterligare taggar</guilabel>, <guilabel>Omslag</guilabel> bestämmer informationen som ska hämtas från servern. Till sist är <guilabel>Noggrannhet</guilabel> den minimala noggrannheten som måste uppnås för att acceptera importerad data. Om noggrannheten är otillräcklig, provas nästa server i listan. Samma dialogruta som innehåller serveregenskaperna dyker upp när <guibutton>Lägg till</guibutton> klickas för att lägga till en ny serverpost. Befintliga poster kan tas bort genom att använda <guibutton>Ta bort</guibutton>.

source: To launch an automatic batch import with the selected profile, click <guibutton>Start</guibutton>. Details about the running import are displayed at the top of the dialog. The process can be aborted with the <guibutton>Abort</guibutton> button.
it: Per avviare un'importazione in serie automatica con il profilo selezionato, fare clic su <guibutton>Avvia</guibutton>. I dettagli sull'importazione in esecuzione sono visualizzati nella parte superiore della finestra. Il processo può essere interrotto con il pulsante <guibutton>Interrompi</guibutton>.
ru: Чтобы запустить автоматический пакетный импорт с выбранным профилем, нажмите кнопку <guibutton>Начать</guibutton>. Подробные сведения о запущенном импорте отображаются в верхней части диалогового окна. Чтобы прервать процесс, нажмите кнопку <guibutton>Прервать</guibutton>.
sv: Klicka på <guibutton>Starta</guibutton> för att starta en automatisk import i bakgrunden med den valda profilen. Detaljinformation om pågående import visas längst upp i dialogrutan. Processen kan avbrytas med knappen <guibutton>Avbryt</guibutton>.

source: <guimenu>File</guimenu> <guimenuitem>Browse Cover Art...</guimenuitem>
it: <guimenu>File</guimenu> <guimenuitem>Preleva copertina...</guimenuitem>
ru: <guimenu>Файл</guimenu> <guimenuitem>Найти обложки...</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Bläddra bland omslag...</guimenuitem>

source: The <action>Browse Cover Art</action> dialog helps to find album cover art. <guilabel>Artist/Album</guilabel> is filled from the tags if possible. <guilabel>Source</guilabel> offers a variety of websites with album cover art. The &URL; with artist and album as parameters can be found beneath the name. &URL;-encoded values for artist and album can be inserted using "<userinput>%u{artist}</userinput>" and "<userinput>%u{album}</userinput>", other values from the tags are possible too, as described in <link linkend="configure-kid3">Configure &kid3;</link>, <guilabel>User Actions</guilabel>. More sources can be entered after the entry "Custom Source" by replacing "Custom Source" with the source's name, pressing <keycap>Enter</keycap>, then inserting the &URL; and finally pressing <guibutton>Save Settings</guibutton>. The resulting browser command is displayed at the top of the dialog and can be started by clicking <guibutton>Browse</guibutton>. The browser, which can be configured in the settings, is started with the selected source. A cover image can then be dragged from the browser into the &kid3; window and will be set in the picture frame of the selected files.
it: La finestra <action>Sfoglia copertina</action> aiuta a trovare la copertina dell'album. <guilabel>Artista/Album</guilabel> viene riempito dai tag, se possibile. <guilabel>Fonte</guilabel> offre una varietà di siti web con copertine di album. L'&URL; con artista e album come parametri si trova sotto il nome. I valori codificati come &URL; per artista e album possono essere inseriti utilizzando «<userinput>%u{artist}</userinput>» e «<userinput>% u{album}</userinput>», sono possibili altri valori dai tag anche, come descritto in <link linkend="configure-kid3">Configura &kid3;</link>, <guilabel>Azioni dell'utente</guilabel>. Altre fonti possono essere inserite dopo la voce «Fonte personalizzata» sostituendo «Fonte personalizzata» con il nome della fonte, premendo <keycap>Invio</keycap>, quindi inserendo &URL; e infine premendo <guibutton>Salva impostazioni</guibutton>. Il comando del browser risultante viene visualizzato nella parte superiore della finestra e può essere avviato facendo clic su <guibutton>Sfoglia</guibutton>. Il browser, che può essere configurato nelle impostazioni, viene avviato con la fonte selezionata. Un'immagine di copertina può quindi essere trascinata dal browser nella finestra di &kid3; e sarà impostato nella cornice dei file selezionati.
ru: Диалог <action>«Найти обложки»</action> позволяет найти и загрузить обложки альбомов. Поля <guilabel>Исполнитель и альбом</guilabel> заполняются автоматически, если в тегах доступны соответствующие данные. В разделе <guilabel>Источник</guilabel> доступно большое количество веб-сайтов с обложками. Под названием источника расположена &URL;-ссылка, в которой в качестве параметров указаны исполнитель и альбом. Чтобы вставить значения артиста и альбома в кодировке &URL;, воспользуйтесь командами «<userinput>%u{artist}</userinput>» и «<userinput>%u{album}</userinput>». Команды для вставки других значений из тегов доступны в разделе «<link linkend="configure-kid3">Настройка &kid3;</link>» (описание вкладки <guilabel>Команды пользователя</guilabel>). Чтобы добавить дополнительные источники обложек, замените запись «Custom Source» названием нового источника и нажмите клавишу <keycap>Enter</keycap>; после этого следует указать &URL;-адрес и нажать кнопку <guibutton>Сохранить параметры</guibutton>. Результат будет отображён в верхней части диалога, а чтобы открыть соответствующий адрес в браузере по умолчанию, указанном в параметрах, воспользуйтесь кнопкой <guibutton>Браузер</guibutton>. Изображение обложки возможно перетащить из окна браузера в окно &kid3;, после чего оно будет сохранено во фрейме изображения выбранных файлов.
sv: Dialogrutan <action>Bläddra bland omslag</action> hjälper till att hitta albumomslag. <guilabel>Artist/Album</guilabel> fylls i från taggarna om möjligt. <guilabel>Källa</guilabel> erbjuder ett antal webbplatser med albumomslag. Webbadressen med artist och album som parametrar finns under namnet. Webbadresskodade värden för artist och album kan infogas genom att använda "<userinput>%u{artist}</userinput>" och "<userinput>%u{album}</userinput>". Andra värden från taggarna är också möjliga, som beskrivs i <link linkend="configure-kid3">Anpassa &kid3;</link>, <guilabel>Användaråtgärder</guilabel>. Fler källor kan matas in efter posten "Egen källa" genom att ersätta "Egen källa" med källans namn, trycka på <keycap>Enter</keycap>, därefter infoga webbadressen, och slutligen klicka på <guibutton>Spara inställningar</guibutton>. Det resulterande webbläsarkommandot visas längst upp i dialogrutan och kan utföras genom att klicka på <guibutton>Bläddra</guibutton>. Webbläsaren, som kan anpassas i inställningarna, startas med den valda källan. En omslagsbild kan sedan dras från webbläsaren till fönstret i &kid3; och tilldelas till de markerade filernas bildram.

source: Because not all browsers support drag and drop of images and the pictures on websites often have a &URL;, in such cases &kid3; will receive the &URL; and not the picture. If the &URL; points to a picture, it will be downloaded. However, if the &URL; refers to some other web resource, it has to be translated to the corresponding picture. Such mappings are defined in the table <guilabel>&URL; extraction</guilabel>. The left column <guilabel>Match</guilabel> contains a regular expression which is compared with the &URL;. If it matches, the captured expressions in parentheses are inserted into the pattern of the right <guilabel>Picture &URL;</guilabel> column (at the positions marked with \1 <abbrev>etc.</abbrev>). The replaced regular expression contains the &URL; of the picture. By this means cover art can be imported from Amazon, Google Images, <abbrev>etc.</abbrev> using drag and drop. It is also possible to define your own mappings.
it: Poiché non tutti i browser supportano il trascinamento della selezione delle immagini e le immagini sui siti web spesso hanno un &URL;, in questi casi &kid3; riceverà l'&URL; e non l'immagine. Se l'&URL; punta a un'immagine, essa sarà scaricata. Tuttavia, se l'&URL; si riferisce ad altre risorse web, deve essere tradotto nell'immagine corrispondente. Tali associazioni sono definite nella tabella <guilabel>Estrazione &URL;</guilabel>. La colonna di sinistra <guilabel>Corrispondenza</guilabel> contiene un'espressione regolare che viene confrontata con l'&URL;. Se corrisponde, le espressioni catturate tra parentesi sono inserite nel modello della colonna destra <guilabel>Immagine e &URL;</guilabel> (nelle posizioni marcate con \1 <abbrev>ecc.</abbrev>). L'espressione regolare sostituita contiene l'&URL; della foto. In questo modo la copertina può essere importata da Amazon, Google Immagini, <abbrev>ecc.</abbrev> utilizzando il trascinamento della selezione. È anche possibile definire le proprie associazioni.
ru: Так как не все браузеры поддерживают функцию перетаскивания изображений, а многие изображения на веб-сайтах представлены в виде &URL;-адресов, в таких случаях &kid3; получит не изображение, а его &URL;-адрес. Если &URL;-адрес указывает на изображение, оно будет загружено, но, если &URL;-адрес указывает на какой-либо интернет-источник, его придётся преобразовать в соответствующее изображение. Такие привязки указаны в таблице <guilabel>Извлечение &URL;-адреса</guilabel>. Левый столбец <guilabel>Соответствие</guilabel> содержит регулярные выражения, которые сравниваются с &URL;-адресами. Если программе удаётся установить соответствие, захваченные выражения в скобках вставляются в шаблон в правый столбец <guilabel>&URL;-адрес изображения</guilabel> (в позиции, указанные заменителями \1 и так далее). Заменённое регулярное выражение содержит &URL;-адрес изображения. Такой способ позволяет импортировать обложки из Amazon, Google Images и так далее. Также возможно указать собственные соответствия.
sv: Eftersom inte alla webbläsare stöder drag och släpp av bilder, och bilderna på webbplatser har ofta en webbadress. I sådana fall tar &kid3; emot webbadressen och inte bilden. Om webbadressen pekar på en bild, laddas den ner. Om webbadressen dock refererar till någon annan webbresurs, måste den översättas till motsvarande bild. Sådana avbildningar definieras i tabellen <guilabel>Webbadressextrahering</guilabel>. Den vänstra kolumnen <guilabel>Matcha</guilabel> innehåller ett reguljärt uttryck som jämförs med webbadressen. Om det matchar, infogas de infångade uttrycken inom parenteser i den högra kolumnens mönster <guilabel>Bildwebbadress</guilabel> (i positionerna markerade med \1 <abbrev>etc.</abbrev>). Det ersatta reguljära uttrycket innehåller bildens webbadress. På detta sätt kan omslag importeras från Amazon, Google bilder, <abbrev>etc.</abbrev> genom att använda drag och släpp. Det är också möjligt att definiera dina egna avbildningar.

source: <guimenu>File</guimenu> <guimenuitem>Export...</guimenuitem>
it: <guimenu>File</guimenu> <guimenuitem>Esporta...</guimenuitem>
ru: <guimenu>Файл</guimenu> <guimenuitem>Экспорт...</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Exportera...</guimenuitem>

source: The <action>Export Dialog</action> is used to store data from the tags in a file or the clipboard. The editor at the top shows a preview of the data to export. If the export data contain tabulator characters, the export is displayed in a table. The data will be generated from the tags in the current folder according to the configured format.
it: La <action>Finestra Esporta</action> viene utilizzata per archiviare i dati dai tag in un file o negli appunti. L'editor in alto mostra un'anteprima dei dati da esportare. Se i dati di esportazione contengono caratteri di tabulazione, l'esportazione viene visualizzata in una tabella. I dati saranno generati dai tag nella cartella attuale in base al formato configurato.
ru: <action>Диалог экспорта</action> используется для сохранения данных из тегов в файле или в буфере обмена. В верхней части окна редактора доступен предварительный просмотр данных для экспорта. Если данные экспорта содержат символы табуляции, данные будут показаны в виде таблицы. Данные генерируются из тегов в текущем каталоге в соответствии с настроенным форматом.
sv: <action>Exportdialogrutan</action> används för att lagra data från taggarna i en fil eller på klippbordet. Editorn längst upp visar en förhandsgranskning av data att exportera. Om exporterad data innehåller tabulatortecken, visas exporten i en tabell. Data genereras från taggarna i aktuell katalog enligt det inställda formatet.

source: The format settings are similar as in the Import dialog: The topmost field contains the title (<abbrev>e.g.</abbrev> "CSV unquoted"), followed by the header, which will be generated at the begin of the file. The track data follows; it is used for every track. Finally, the trailer can be used to generate some finishing text.
it: Le impostazioni del formato sono simili a quelle della finestra Importa: il campo più in alto contiene il titolo (<abbrev>ad es.</abbrev> «CSV non quotato»), seguito dall'intestazione, che sarà generata all'inizio del file. Di seguito sono riportati i dati della traccia; è usato per ogni traccia. Infine, il trailer può essere utilizzato per generare del testo finale.
ru: Параметры форматирования аналогичны параметрам диалога «Импорт»: верхнее поле содержит название формата (например, «CSV unquoted»), следом идёт заголовок, который будет создан в начале файла. Далее следуют данные дорожки (используются для каждой дорожки). Последнее поле позволяет создать какой-либо завершающий текстовый фрагмент.
sv: Formatinställningarna liknar dem i importdialogrutan: Det översta fältet innehåller titeln (<abbrev>t.ex.</abbrev> "CSV unquoted"), följd av huvudet, som genereras i början av filen. Spårdata följer, och den används för varje spår. Till sist kan avslutningen användas för att generera någon avslutande text.

source: The format fields do not contain regular expressions as in the Import dialog, but only output format expressions with special %-expressions, which will be replaced by values from the tags. The whole thing works like the file name format, and the same codes are used plus some additional codes. Not only the codes listed below but all tag frame names can be used.
it: I campi del formato non contengono espressioni regolari come nella finestra Importa, ma solo espressioni di formato del risultato con speciali espressioni che iniziano con il carattere %, che saranno sostituite dai valori dei tag. Il tutto funziona come il formato del nome file e gli stessi codici sono utilizzati più alcuni codici aggiuntivi. È possibile utilizzare non solo i codici elencati di seguito, ma tutti i nomi dei frame dei tag.
ru: В полях форматирования не должно содержаться регулярных выражений, как в диалоговом окне «Импорт»; там должны быть только выражения форматирования результата со специальными заменителями с символом «%», которые будут заменены значениями из соответствующих тегов. Всё это работает так же, как форматирование названия файла, то есть используются те же коды вместе с дополнительными. Могут использоваться не только коды, перечисленные далее, но и коды с названиями фреймов тегов.
sv: Formatfälten innehåller inte reguljära uttryck som i importdialogrutan, men bara formatuttryck för utdata med speciella %-uttryck, som ersätts med värden från taggarna. Det hela fungerar som filnamnsformat, och samma koder används samt några ytterligare. Alla taggramnamn kan användas, inte bara koderna som listas nedan.

source: %f %{file} File name
it: %f %{file} Nome file
ru: %f %{file} Имя файла
sv: %f %{file} Filnamn

source: %p %{filepath} Path
it: %p %{filepath} Percorso
ru: %p %{filepath} Путь
sv: %p %{filepath} Sökväg

source: %{modificationdate} Modification date
it: %{modificationdate} Data di modifica
ru: %{modificationdate} Дата изменения
sv: %{modificationdate} Ändringsdatum

source: %{creationdate} Creation date
it: %{creationdate} Data di creazione
ru: %{creationdate} Дата создания
sv: %{creationdate} Skapad datum

source: %{dirname} Folder name
it: %{dirname} Nome della cartella
ru: %{dirname} Имя каталога
sv: %{dirname} Katalognamn

source: %d %{duration} Duration in minutes:seconds
it: %d %{duration} Durata in minuti:secondi
ru: %d %{duration} Длительность в минутах:секундах
sv: %d %{duration} Längd i minuter:sekunder
