Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: Copy the unsynchronized lyrics to the clipboard, just go to the <guilabel>Lyrics</guilabel> row in the frame table and press <keycombo>&Ctrl;<keycap>C</keycap></keycombo>.
it: Copiare i testi non sincronizzati negli appunti, basta portarsi alla riga <guilabel>Testi</guilabel> nella tabella dei frame premere <keycombo>&Ctrl;<keycap>C</keycap></keycombo>.
ru: Скопируйте несинхронизированный текст в буфер обмена, перейдите к строке <guilabel>Текст</guilabel> в таблице фреймов и нажмите комбинацию клавиш <keycombo>&Ctrl;<keycap>C</keycap></keycombo>.
sv: Kopiera den osynkroniserade sångtexten till klippbordet. Gå bara till raden <guilabel>Sångtext</guilabel> i ramtabellen och tryck på <keycombo>&Ctrl;<keycap>C</keycap></keycombo>.

source: Add a synchronized lyrics frame (<guibutton>Add...</guibutton>, <guilabel>Synchronized Lyrics</guilabel>, <guibutton>OK</guibutton>), click <guibutton>From Clipboard</guibutton>.
it: Aggiungere un frame di testi sincronizzato (<guibutton>Aggiungi...</guibutton>, <guilabel>Testi sincronizzati</guilabel>, <guibutton>OK</guibutton>), fare clic su <guibutton>Dagli appunti</guibutton>.
ru: Добавьте фрейм синхронизированного текста (<guibutton>Добавить...</guibutton>, <guilabel>Синхронизированный текст</guilabel>, <guibutton>OK</guibutton>), затем нажмите кнопку <guibutton>Из буфера обмена</guibutton>.
sv: Lägg till en synkroniserad sångtextram (<guibutton>Lägg till...</guibutton>, <guilabel>Synkroniserad sångtext</guilabel>, <guibutton>Ok</guibutton>), klicka på <guibutton>Från klippbord</guibutton>.

source: Now all lines from the unsynchronized lyrics are in the table, all time stamps are invalid (0:0:0.00). You can delete empty entries beforehand.
it: Ora tutte le righe dei testi non sincronizzati sono nella tabella, tutte le marche temporali non sono valide (0:0:0.00). È possibile eliminare in anticipo le voci vuote.
ru: После этого в таблицу будут добавлены все строки несинхронизированного текста, при этом все метки времени будут некорректными (0:0:0.00). Перед продолжением возможно удалить пустые записи.
sv: Nu finns alla raderna från den osynkroniserade sångtexten i tabellen, med alla tidsstämplar ogiltiga (0:0:0.00). Tomma poster kan tas bort i förväg.

source: Start playing the song by clicking the play button <guibutton>&#9658;</guibutton> in the play toolbar at the bottom of the main window.
it: Iniziare a riprodurre il brano facendo clic sul pulsante di riproduzione <guibutton>&#9658;</guibutton> nella barra degli strumenti di riproduzione nella parte inferiore della finestra principale.
ru: Запустите воспроизведение песни с помощью кнопки <guibutton>&#9658;</guibutton> на панели воспроизведения в нижней части главного окна.
sv: Starta uppspelning av sången genom att klicka på uppspelningsknappen <guibutton>&#9658;</guibutton> i uppspelningsverktygsraden längst ner i huvudfönstret.

source: When the next lyrics line with invalid timestamp comes, click <guibutton>Add</guibutton> or press <keycombo>&Alt;<keycap>A</keycap></keycombo>, the timestamp will be updated.
it: Quando viene visualizzata la riga del testo successiva con marca temporale non valida, fare clic su <guibutton>Aggiungi</guibutton> o premere <keycombo>&Alt;<keycap>A</keycap></keycombo>, la marca temporale sarà aggiornata.
ru: Когда появится следующая строка текста с некорректной меткой времени, нажмите кнопку <guibutton>Добавить</guibutton> или комбинацию клавиш <keycombo>&Alt;<keycap>A</keycap></keycombo>, и метка будет обновлена.
sv: När nästa sångtextrad med ogiltig tidsstämpel, klicka på <guibutton>Lägg till</guibutton> eller tryck på <keycombo>&Alt;<keycap>A</keycap></keycombo>, så uppdateras tidsstämpeln.

source: Continue like this until all timestamps are set. If you missed something, stop playback and clear the timestamps using the <keycap>Delete</keycap> key or by selecting them and using <guimenuitem>Clear</guimenuitem> from the context menu. To restart playback from a given timestamp, use <guimenuitem>Seek to position</guimenuitem> from the context menu.
it: Continuare così fino a quando non sono impostate tutte le marche temporali. Se si è perso qualcosa, fermare la riproduzione e cancellare le marche temporali utilizzando il tasto <keycap>Elimina</keycap> o selezionandoli e utilizzando <guimenuitem>Cancella</guimenuitem> dal menu contestuale. Per riavviare la riproduzione da una determinata marca temporale, utilizzare <guimenuitem>Scorri alla posizione</guimenuitem> dal menu contestuale.
ru: Повторяйте это действие, пока не будут установлены все метки времени. Если что-то оказалось пропущено, остановите воспроизведение и очистите метки с помощью клавиши <keycap>Delete</keycap> или путём выделения меток и выбора пункта <guimenuitem>Очистить</guimenuitem> в контекстном меню. Чтобы возобновить воспроизведение с определённой метки, воспользуйтесь функцией контекстного меню <guimenuitem>Прокрутка до положения</guimenuitem>.
sv: Fortsätt på detta sätt tills alla tidsstämplar är uppdaterade. Om du missade någonting, stoppa uppspelningen och nollställ tidsstämplarna med tangenten <keycap>Delete</keycap> eller genom att markera dem och använda <guimenuitem>Rensa</guimenuitem> i den sammanhangsberoende menyn. För att starta om uppspelning från en given tidsstämpel, använd <guimenuitem>Gå till position</guimenuitem> från den sammanhangsberoende menyn.

source: The File Menu
it: Il menu File
ru: Меню «Файл»
sv: Menyn Arkiv

source: <shortcut> <keycombo>&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
it: <shortcut> <keycombo>&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Apri...</guimenuitem>
ru: <shortcut> <keycombo>&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Файл</guimenu> <guimenuitem>Открыть...</guimenuitem>
sv: <shortcut> <keycombo>&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Arkiv</guimenu> <guimenuitem>Öppna...</guimenuitem>

source: <action>Opens a folder.</action> All files matching the selected file name filter will be displayed in the file listbox and the chosen file is selected.
it: <action>Apre una cartella.</action> Tutti i file corrispondenti al filtro del nome file selezionato saranno visualizzati nell'elenco dei file e il file scelto sarà selezionato.
ru: <action>Открывает каталог.</action> В списке файлов будут отображаться все файлы, соответствующие выбранному фильтру имён файлов, а выбранный файл будет выделен.
sv: <action>Öppnar en katalog.</action> Alla filer som matchar den markerade filens namnfilter visas i fillistrutan och den valda filen markeras.

source: <guimenu>File</guimenu> <guimenuitem>Open Recent</guimenuitem>
it: <guimenu>File</guimenu> <guimenuitem>Apri recente</guimenuitem>
ru: <guimenu>Файл</guimenu> <guimenuitem>Последние файлы</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Öppna senaste</guimenuitem>

source: Opens a recently opened folder.
it: Apre una cartella aperta di recente.
ru: Открывает последний открытый каталог.
sv: Öppnar en nyligen öppnad katalog.

source: <shortcut> <keycombo>&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open Folder...</guimenuitem>
it: <shortcut> <keycombo>&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Apri cartella...</guimenuitem>
ru: <shortcut> <keycombo>&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Файл</guimenu> <guimenuitem>Открыть каталог...</guimenuitem>
sv: <shortcut> <keycombo>&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Arkiv</guimenu> <guimenuitem>Öppna katalog...</guimenuitem>

source: <action>Opens a folder.</action> All files matching the selected file name filter will be displayed in the file listbox.
it: <action>Apre una cartella.</action> Tutti i file che corrispondono al nome del file selezionato saranno visualizzati nell'elenco.
ru: <action>Открывает каталог.</action> В списке файлов будут отображаться все файлы, соответствующие выбранному фильтру имён файлов.
sv: <action>Öppnar en katalog.</action> Alla filer som matchar den markerade filens namnfilter visas i fillistrutan.

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>Reload</guimenuitem>
it: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>Ricarica</guimenuitem>
ru: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Файл</guimenu> <guimenuitem>Обновить</guimenuitem>
sv: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Arkiv</guimenu> <guimenuitem>Läs in igen</guimenuitem>

source: <action>Reload folder.</action> Modified files have to be saved before. Expanded subfolders will be collapsed.
it: <action>Ricaricare la cartella.</action> I file modificati devono essere salvati prima. Le sottocartelle espanse saranno contratte.
ru: <action>Обновляет каталог.</action> Перед обновлением следует сохранить изменённые файлы. Развёрнутые вложенные папки будут свёрнуты.
sv: <action>Uppdatera katalog.</action> Ändrade filer måste först sparas. Expanderade underkataloger dras ihop.

source: <shortcut> <keycombo>&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
it: <shortcut> <keycombo>&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Salva</guimenuitem>
ru: <shortcut> <keycombo>&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Файл</guimenu> <guimenuitem>Сохранить</guimenuitem>
sv: <shortcut> <keycombo>&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Arkiv</guimenu> <guimenuitem>Spara</guimenuitem>

source: <action>Saves all changed files in the folder.</action> The changed files are marked with a disk symbol in the file listbox. If any file names have been changed, those files will be renamed.
it: <action>Salvare tutti i file modificati nella cartella.</action> I file modificati sono contrassegnati con un simbolo del disco nell'elenco dei file. Se sono stati modificati nomi di file, questi file saranno rinominati.
ru: <action>Сохраняет все изменённые файлы в каталоге.</action> Изменённые файлы отмечены значком дискеты в списке файлов. Если были изменены названия файлов, файлы будут соответствующим образом переименованы.
sv: <action>Sparar alla ändrade filer i katalogen.</action> De ändrade filerna är markerade med en disksymbol i fillistrutan. Om några filnamn har ändrats, byts namnen på de filerna.

source: <guimenu>File</guimenu> <guimenuitem>Revert</guimenuitem>
it: <guimenu>File</guimenu><guimenuitem>Scarta modifiche</guimenuitem>
ru: <guimenu>Файл</guimenu> <guimenuitem>Отменить изменения</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Återställ</guimenuitem>

source: <action>Reverts the changes of one or multiple files.</action> If no files are selected in the file listbox, the changes of all files will be reverted, else only the changes of the selected files are reverted.
it: <action>Ripristina le modifiche di uno o più file.</action> Se non viene selezionato alcun file nell'elenco dei file, le modifiche di tutti i file saranno ripristinate, altrimenti saranno ripristinate solo le modifiche dei file selezionati.
ru: <action>Отменяет изменения одного или нескольких файлов.</action> Если в списке файлов не было выделено ни одного файла, будут отменены изменения всех файлов. Если же в списке имеются выделенные файлы, будут отменены изменения только этих файлов.
sv: <action>Återställer ändringarna av en eller flera filer.</action> Om inga filer är markerade i fillistrutan återställs ändringarna av alla filer, annars återställs bara ändringar av de markerade filerna.

source: <guimenu>File</guimenu> <guimenuitem>Import...</guimenuitem>
it: <guimenu>File</guimenu> <guimenuitem>Importa...</guimenuitem>
ru: <guimenu>File</guimenu> <guimenuitem>Импорт...</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Importera...</guimenuitem>

source: The <action>Import dialog</action> can be used to import data directly from a freedb.org server, from a MusicBrainz server, from Discogs, Amazon or other sources of album track lists in textual format.
it: La <action>Finestra di importazione</action> può essere utilizzata per importare i dati direttamente da un server freedb.org, da un server MusicBrainz, da Discogs, Amazon o altre fonti di elenchi di tracce di album in formato testuale.
ru: <action>Диалог импорта</action> позволяет импортировать данные непосредственно с сервера freedb.org, сервера MusicBrainz, Discogs, Amazon или из других источников списков воспроизведения в альбомах, которые предоставляют данные в текстовом формате.
sv: <action>Importdialogrutan</action> kan användas för att direkt importera data från en freedb.org server, från en MusicBrainz server, från Discogs, Amazon eller andra källor för albumspårlistor med textformat.

source: Import from a freedb.org server is possible using a dialog which appears when <guibutton>From Server:</guibutton> <guibutton>gnudb.org</guibutton> is selected. The artist and album name to search for can be entered in the two topmost fields, the albums which match the query will be displayed when <guibutton>Find</guibutton> is clicked and the results from <ulink url="http://www.gnudb.org">www.gnudb.org</ulink> are received. Importing the track data for an album is done by double-clicking the album in the list. The freedb.org server to import from can be selected as well as the CGI path. The imported data is displayed in the preview table of the import dialog. When satisfied with the displayed tracks, they can be imported by terminating the import dialog with <guibutton>OK</guibutton>.
it: L'importazione da un server freedb.org è possibile utilizzando una finestra che appare quando è selezionato <guibutton>Dal server:</guibutton> <guibutton>gnudb.org</guibutton>. L'artista e il nome dell'album da cercare possono essere digitati nei due campi più in alto, gli album che corrispondono alla query saranno visualizzati quando si fa clic su <guibutton>Trova</guibutton> e i risultati da <ulink url="http: //www.gnudb.org">www.gnudb.org</ulink> sono ricevuti. L'importazione dei dati delle tracce per un album viene eseguita facendo doppio clic sull'album nell'elenco. È possibile selezionare sia il server freedb.org da cui importare sia il percorso CGI. I dati importati sono visualizzati nella tabella di anteprima della finestra di importazione. Se soddisfatti delle tracce visualizzate, possono essere importati chiudendo la finestra di importazione con <guibutton>OK</guibutton>.
ru: Чтобы импортировать данные с сервера freedb.org, в диалоге импорта выберите в меню <guibutton>С сервера...</guibutton> вариант <guibutton>gnudb.org</guibutton>. В появившемся диалоговом окне введите в два верхних поля данные для поиска исполнителя и названия альбома; альбомы, соответствующие запросу, будут отображены после нажатия кнопки <guibutton>Найти</guibutton> и получения результатов с сайта <ulink url="http://www.gnudb.org">www.gnudb.org</ulink>. Импорт данных дорожек для альбома выполняется двойным щелчком левой кнопкой мыши по альбому в списке. Для импорта данных возможно выбрать как сервер freedb.org, так и путь CGI. Импортированные данные будут отображаться в таблице предварительного просмотра диалога импорта. Если отображаемые результаты удовлетворяют требованиям, запустите процесс импорта, закрыв диалоговое окно с помощью кнопки <guibutton>OK</guibutton>.
sv: Import från en freedb.org server är möjlig genom att använda en dialogruta som dyker upp när <guibutton>Från server:</guibutton> <guibutton>gnudb.org</guibutton> väljes. Artisten och albumnamnet att söka efter kan skrivas in i de två översta fälten, och albumen som matchar frågan visas när <guibutton>Sök</guibutton> klickas och resultaten från <ulink url="http://www.gnudb.org">www.gnudb.org</ulink> tas emot. Import av spårdata för ett album görs genom att dubbelklicka på albumet i listan. Vilken freedb.org server att använda för import kan väljas, samt CGI-sökvägen. Importerad data visas i förhandsgranskningstabellen i importdialogrutan. När du är nöjd med de visade spåren kan de importeras genom att avsluta importdialogrutan med <guibutton>Ok</guibutton>.

source: A search on the Discogs server can be performed using <guibutton>Discogs</guibutton>. As in the <guibutton>gnudb.org</guibutton> dialog, you can enter artist and album and then choose from a list of releases. A <guilabel>Token</guilabel> can be entered to use the RESTful Discogs API instead of their web interface, which is often changed, thereby breaking the import parser. You have to register for an account on <ulink url="https://www.discogs.com/">Discogs</ulink> and then generate a token on their web site (Settings/Developers, Generate new token). Don't forget to <guibutton>Save Settings</guibutton> after entering the token in order to use it in subsequent requests too. If <guilabel>Standard Tags</guilabel> is marked, the standard information is imported, <abbrev>e.g.</abbrev> artist, album, and title. If <guilabel>Additional Tags</guilabel> is marked, more information is imported if available, <abbrev>e.g.</abbrev> performers, arrangers, or the publisher. If <guilabel>Cover Art</guilabel> is marked, cover art will be downloaded if available.
it: Una ricerca sul server di Discogs può essere eseguita utilizzando <guibutton>Discogs</guibutton>. Come nella finestra di <guibutton>gnudb.org</guibutton>, è possibile digitare artista e album e quindi scegliere da un elenco di versioni. Un <guilabel>Token</guilabel> può essere inserito per utilizzare l'API RESTful Discogs invece dell'interfaccia web, spesso modificata, impedendo così il funzionamento dell'analizzatore di importazione. È necessario registrare un account su <ulink url="https://www.discogs.com/">Discogs</ulink> e poi generare un token sul sito web (Impostazioni/Programmatori, Genera token). Non dimenticare <guibutton>Salva impostazioni</guibutton> dopo aver inserito il token per utilizzarlo nelle successive richieste. Se <guilabel>Tag standard</guilabel> è marcata, le informazioni standard vengono importate, <abbrev>ad es.</abbrev> artista, album e titolo. Se <guilabel>Tag aggiuntivi</guilabel> è marcata, vengono importate ulteriori informazioni se disponibili, <abbrev>ad es.</abbrev> interpreti, arrangiatori o editore. Se <guilabel>Copertina</guilabel> è marcata, la copertina sarà scaricata se disponibile.
ru: Чтобы выполнить поиск на сервере Discogs, выберите в раскрывающемся списке вариант <guibutton>Discogs</guibutton>. Как и в диалоге поиска <guibutton>gnudb.org</guibutton>, следует указать исполнителя и название альбома, а затем выбрать нужный вариант из списка альбомов. Возможно ввести <guilabel>Токен</guilabel>, чтобы использовать программный интерфейс RESTful Discogs API вместо веб-интерфейса, который часто меняется, тем самым нарушая работу анализатора импорта. Потребуется создать учётную запись на сайте <ulink url="https://www.discogs.com/">Discogs</ulink>, затем там же сгенерировать токен (Настройки/Разработчикам, Сгенерировать токен). Не забудьте нажать кнопку <guibutton>Сохранить параметры</guibutton> после ввода токена, чтобы использовать его и в последующих запросах. Если установлен флажок <guilabel>Стандартные теги</guilabel>, будет импортирована стандартная информация, например, об исполнителе, альбоме и названиях дорожек. Если установлен флажок <guilabel>Дополнительные теги</guilabel>, будет также импортирована доступная дополнительная информация, например, об аккомпанементе, аранжировщиках или издателе. Если установлен флажок <guilabel>Обложка</guilabel>, также будет загружено изображение обложки альбома (если оно доступно).
sv: En sökning på Discogs server kan utföras genom att använda <guibutton>Discogs</guibutton>. Som i dialogrutan <guibutton>gnudb.org</guibutton>, kan du mata in artist och album och sedan välja bland en lista av utgåvor. En <guilabel>Symbol</guilabel> kan matas in för att använda programmeringsgränssnittet RESTful i Discogs istället för deras webbgränssnitt, vilket ofta ändras, och därigenom tar sönder importtolkningen. Du måste registrera för att få ett konto på <ulink url="https://www.discogs.com/">Discogs</ulink>, och sedan generera en symbol på deras webbplats (Settings/Developers, Generate new token). Glöm inte att <guibutton>Spara inställningar</guibutton> efter att ha matat in symbolen för att också kunna använda den i efterföljande frågor. Om <guilabel>Standardtaggar</guilabel> är markerat, importeras standardinformationen, <abbrev>t.ex.</abbrev> artist, album och titel. Om <guilabel>Ytterligare taggar</guilabel> är markerat, importeras mer information om tillgängligt, <abbrev>t.ex.</abbrev> utövare, arrangör eller utgivare. Om <guilabel>Omslag</guilabel> är markerat, laddas omslaget ner om tillgängligt.

source: A search on Amazon can be performed using <guibutton>Amazon</guibutton>. As in the <guibutton>gnudb.org</guibutton> dialog, you can enter artist and album and then choose from a list of releases. If <guilabel>Additional Tags</guilabel> is marked, more information is imported if available, <abbrev>e.g.</abbrev> performers, arrangers, or the publisher. If <guilabel>Cover Art</guilabel> is marked, cover art will be downloaded if available.
it: Una ricerca su Amazon può essere eseguita utilizzando <guibutton>Amazon</guibutton>. Come nella finestra di <guibutton>gnudb.org</guibutton>, è possibile inserire artista e album e quindi scegliere da un elenco di versioni. Se <guilabel>Tag aggiuntivi</guilabel> è marcata, vengono importate ulteriori informazioni se disponibili, <abbrev>ad es.</abbrev> interpreti, arrangiatori o editore. Se <guilabel>Copertina</guilabel> è marcata, la copertina sarà scaricata se disponibile.
ru: Чтобы выполнить поиск на Amazon, выберите в раскрывающемся списке вариант <guibutton>Amazon</guibutton>. Как и в диалоге поиска <guibutton>gnudb.org</guibutton>, следует указать исполнителя и название альбома, а затем выбрать нужный вариант из списка альбомов. Если установлен флажок <guilabel>Дополнительные теги</guilabel>, будет импортирована доступная дополнительная информация, например, об аккомпанементе, аранжировщиках или издателе. Если установлен флажок <guilabel>Обложка</guilabel>, также будет загружено изображение обложки альбома (если оно доступно).
sv: En sökning på Amazon kan utföras genom att använda <guibutton>Amazon</guibutton> Som i dialogrutan <guibutton>gnudborg</guibutton>, kan du mata in artist och album och sedan välja bland en lista av utgåvor. Om <guilabel>Ytterligare taggar</guilabel> är markerat, importeras mer information om tillgängligt, t.ex. utövare, arrangör eller utgivare. Om <guilabel>Omslag</guilabel> är markerat, laddas omslaget ner om tillgängligt.

source: You can search in the same way in the release database of MusicBrainz using <guibutton>From MusicBrainz Release</guibutton>. The workflow is the same as described for <guibutton>From gnudb.org</guibutton>.
it: È possibile cercare nello stesso modo nella banca dati delle uscite di MusicBrainz utilizzando <guibutton>Da MusicBrainz Release</guibutton>. Il flusso è lo stesso descritto per <guibutton>Da gnudb.org</guibutton>.
ru: Таким же образом производится поиск в базе данных альбомов MusicBrainz (выберите в раскрывающемся списке вариант <guibutton>MusicBrainz (релиз)</guibutton>). Рабочий процесс аналогичен процессу, описанному для функции импорта с сервера <guibutton>gnudb.org</guibutton>.
sv: Du kan söka på samma väg i MusicBrainz utgivningsdatabas genom att använda <guibutton>Från MusicBrainz Release</guibutton>. Arbetsflödet är samma som beskrivs för <guibutton>Från gnudb.org</guibutton>.
