Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: Credits and License
it: Riconoscimenti e licenza
ru: Авторские права и лицензия
sv: Tack till och licens

source: Program written by Urs Fleisch <email>ufleisch@users.sourceforge.net</email>
it: Programma scritto da Urs Fleisch <email>ufleisch@users.sourceforge.net</email>
ru: Автор программы: Urs Fleisch <email>ufleisch@users.sourceforge.net</email>
sv: Program skrivet av Urs Fleisch <email>ufleisch@users.sourceforge.net</email>

source: CREDIT_FOR_TRANSLATORS
it: <para>Traduzione: Vincenzo Reale <email>smart2128vr@gmail.com</email></para>
ru: <para>Перевод на русский язык: Мария Шикунова <email>translation-team@basealt.ru</email></para><para>Редактирование перевода: Олеся Герасименко<email>translation-team@basealt.ru</email></para>
sv: <para>Översättning Stefan Asserhäll <email>stefan.asserhall@bredband.net</email></para>

source: Installation
it: Installazione
ru: Установка

source: How to obtain &kid3;
it: Come ottenere &kid3;
ru: Как получить &kid3;
sv: Hur man skaffar &kid3;

source: &kid3; can be found at <ulink url="https://kid3.kde.org">https://kid3.kde.org</ulink>.
it: &kid3; è disponibile su <ulink url="https://kid3.kde.org">https://kid3.kde.org</ulink>.
ru: Приложение &kid3; доступно для загрузки на сайте <ulink url="https://kid3.kde.org">https://kid3.kde.org</ulink>.
sv: &kid3; finns på <ulink url="https://kid3.kde.org">https://kid3.kde.org</ulink>.

source: Requirements
it: Requisiti
ru: Требования
sv: Krav

source: &kid3; needs <ulink url="https://www.qt.io">&Qt;</ulink>. <ulink url="http://www.kde.org">&kde;</ulink> is recommended but not necessary, as &kid3; can also be compiled as a &Qt; application. &kid3; can be compiled for systems where these libraries are available, <abbrev>e.g.</abbrev> for GNU/&Linux;, &Windows; and &macOS;. To tag Ogg/Vorbis files, <ulink url="http://xiph.org/ogg/">libogg</ulink>, <ulink url="http://xiph.org/vorbis/">libvorbis and libvorbisfile</ulink> are required, for FLAC files <ulink url="http://flac.sourceforge.net">libFLAC++ and libFLAC</ulink>. <ulink url="http://id3lib.sourceforge.net">id3lib</ulink> is used for MP3 files. These four formats are also supported by <ulink url="http://taglib.github.io/">TagLib</ulink>, which can also handle Opus, MPC, APE, MP2, Speex, TrueAudio, WavPack, WMA, WAV, AIFF files and tracker modules. To import from acoustic fingerprints, <ulink url="http://acoustid.org/chromaprint">Chromaprint</ulink> and <ulink url="http://libav.org/">libav</ulink> are used.
it: &kid3; necessita di <ulink url="https://www.qt.io">&Qt;</ulink>. <ulink url="http://www.kde.org">&kde;</ulink> è consigliato, ma non necessario, poiché &kid3; può anche essere compilato come applicazione &Qt;. &kid3; può essere compilato per sistemi in cui sono disponibili queste librerie, <abbrev>ad es.</abbrev> per GNU/&Linux;, &Windows; e &macOS;. Per applicare tag ai file Ogg/Vorbis, <ulink url="http://xiph.org/ogg/">libogg</ulink>, <ulink url="http://xiph.org/vorbis/">libvorbis e libvorbisfile</ulink> sono necessarie, per i file FLAC <ulink url="http://flac.sourceforge.net">libFLAC ++ e libFLAC</ulink>. <ulink url="http://id3lib.sourceforge.net">id3lib</ulink> è utilizzata per i file MP3. Questi quattro formati sono supportati anche da <ulink url="http://taglib.github.io/">TagLib</ulink>, che può gestire anche Opus, MPC, APE, MP2, Speex, TrueAudio, WavPack, WMA, WAV, file AIFF e moduli tracker. Per importare da impronte digitali acustiche, sono utilizzate <ulink url="http://acoustid.org/chromaprint">Chromaprint</ulink> e <ulink url="http://libav.org/">libav</ulink> .
ru: Для работы &kid3; требуется наличие библиотек <ulink url="https://www.qt.io">&Qt;</ulink>. Рекомендуется использовать <ulink url="http://www.kde.org">&kde;</ulink>, но это не обязательно, так как &kid3; возможно собрать как программу, которая зависит только от &Qt;. &kid3; возможно собрать для систем, где доступны эти библиотеки, например, для GNU/&Linux;, &Windows; и &macOS;. Чтобы присваивать теги файлам Ogg/Vorbis, требуются библиотеки <ulink url="http://xiph.org/ogg/">libogg</ulink>, <ulink url="http://xiph.org/vorbis/">libvorbis и libvorbisfile</ulink>, для работы с файлами FLAC — <ulink url="http://flac.sourceforge.net">libFLAC++ и libFLAC</ulink>. Библиотека <ulink url="http://id3lib.sourceforge.net">id3lib</ulink> используется для работы с файлами MP3. Эти четыре формата также поддерживаются библиотекой <ulink url="http://taglib.github.io/">TagLib</ulink>, которая может обрабатывать файлы Opus, MPC, APE, MP2, Speex, TrueAudio, WavPack, WMA, WAV, AIFF и модули трекеров. Для импорта акустических отпечатков используются <ulink url="http://acoustid.org/chromaprint">Chromaprint</ulink> и <ulink url="http://libav.org/">libav</ulink>.
sv: &kid3; behöver <ulink url="https://www.qt.io">&Qt;</ulink>, <ulink url="http://www.kde.org">&kde;</ulink> rekommenderas men är inte nödvändigt, eftersom &kid3; också kan kompileras som ett &Qt;-program. &kid3; kan kompileras för system där dessa bibliotek är tillgängliga, <abbrev>t.ex.</abbrev> för GNU/&Linux;, &Windows; och &macOS;. För att hantera Ogg/Vorbis-filer, behövs <ulink url="http://xiph.org/ogg/">libogg</ulink>, <ulink url="http://xiph.org/vorbis/">libvorbis och libvorbisfile</ulink>, för FLAC-filer behövs <ulink url="http://flac.sourceforge.net">libFLAC++ och libFLAC</ulink>, <ulink url="http://id3lib.sourceforge.net">id3lib</ulink> används för MP3-filer. Dessa fyra format stöds också av <ulink url="http://taglib.github.io/">TagLib</ulink>, som också kan hantera Opus-, MPC-, APE-, MP2-, Speex-, TrueAudio-, WavPack-, WMA-, WAV-, AIFF-filer och tracker-moduler. För att importera från akustiska fingeravtryck används <ulink url="http://acoustid.org/chromaprint">Chromaprint</ulink> och <ulink url="http://libav.org/">libav</ulink>.

source: &kid3; is available for most &Linux; distributions, &Windows; and &macOS;. Links can be found on <ulink url="https://kid3.kde.org"> https://kid3.kde.org</ulink>.
it: &kid3; è disponibile per la maggior parte delle distribuzioni &Linux;, &Windows; e &macOS;. I collegamenti sono disponibili su <ulink url="https://kid3.kde.org"> https://kid3.kde.org</ulink>.
ru: Программа &kid3; доступна для большинства дистрибутивов &Linux;, &Windows; и &macOS;. Ссылки для загрузки находятся на сайте <ulink url="https://kid3.kde.org"> https://kid3.kde.org</ulink>.
sv: &kid3; är tillgängligt för de flesta &Linux;-distributioner, &Windows; och &macOS;. Länkar finns på <ulink url="https://kid3.kde.org"> https://kid3.kde.org</ulink>.

source: Compilation and Installation
it: Compilazione e installazione
ru: Сборка и установка
sv: Kompilering och installation

source: You can compile &kid3; with or without &kde;. Without &kde;, &kid3; is a simple &Qt; application and lacks some configuration and session features.
it: È possibile compilare &kid3; con o senza &kde;. Senza &kde;, &kid3; è una semplice applicazione &Qt; e manca di alcune funzionalità di configurazione e sessione.
ru: Приложение &kid3; может быть собрано с библиотеками &kde; или без них. Без библиотек &kde; &kid3; является простым приложением &Qt;, в котором отсутствуют некоторые возможности по настройке приложения и сеансов работы с ним.
sv: &kid3; kan kompileras med eller utan &kde;. Utan &kde; är &kid3; ett enkelt &Qt;-program och saknar några inställnings- och sessionsfunktioner.

source: For a &kde; version, go into the top folder and type
it: Per una versione di &kde;, spostarsi nella cartella principale e digitare
ru: Чтобы собрать версию с библиотеками &kde;, перейдите в каталог верхнего уровня и введите
sv: För en &kde;-version, gå till toppkatalogen och skriv

source: To compile for different versions of &Qt; or &kde;, set the corresponding <userinput>cmake</userinput> options.
it: Compilare per diverse versioni di &Qt; oppure &kde;, impostare le corrispondenti opzioni di <userinput>cmake</userinput>.
ru: Чтобы собрать нестандартную версию с использованием библиотек &Qt; или &kde;, укажите соответствующие параметры <userinput>cmake</userinput>.
sv: Ställ in motsvarande alternativ i <userinput>cmake</userinput> för att kompilera för andra versioner av &Qt; eller &kde;.

source: If not all libraries are present, &kid3; is built with reduced functionality. So you should take care to have all desired development packages installed. On the other side, <userinput>cmake</userinput>-options control which libraries are compiled in. The default is <userinput>-DWITH_TAGLIB:BOOL=ON -DWITH_MP4V2:BOOL=OFF -DWITH_ID3LIB:BOOL=ON -DWITH_CHROMAPRINT:BOOL=ON -DWITH_VORBIS:BOOL=ON -DWITH_FLAC:BOOL=ON </userinput>. These options can be disabled using <userinput>OFF</userinput>.
it: Se non sono presenti tutte le librerie, &kid3; è compilato con funzionalità ridotta. Quindi è necessario aver cura di avere tutti i pacchetti di sviluppo desiderati installati. Dall'altro lato, le opzioni di <userinput>cmake</userinput> controllano quali librerie sono compilate. L'impostazione predefinita è <userinput>-DWITH_TAGLIB:BOOL=ON -DWITH_MP4V2:BOOL=OFF -DWITH_ID3LIB:BOOL=ON -DWITH_CHROMAPRINT:BOOL=ON -DWITH_VORBIS:BOOL=ON -DWITH_FLAC:BOOL=ON</userinput>. Queste opzioni possono essere disabilitate utilizzando <userinput>OFF</userinput>.
ru: Если доступны не все библиотеки, программа &kid3; будет собрана с ограниченными функциональными возможностями, поэтому рекомендуется установить все необходимые пакеты перед сборкой. С другой стороны, с помощью параметров <userinput>cmake</userinput> возможно управлять перечнем библиотек, которые будут использованы при сборке. По умолчанию это: <userinput>-DWITH_TAGLIB:BOOL=ON -DWITH_MP4V2:BOOL=OFF -DWITH_ID3LIB:BOOL=ON -DWITH_CHROMAPRINT:BOOL=ON -DWITH_VORBIS:BOOL=ON -DWITH_FLAC:BOOL=ON</userinput>. Чтобы отключить эти опции, установите параметры в значение <userinput>OFF</userinput>.
sv: Om alla bibliotek inte är närvarande, byggs &kid3; med reducerad funktionalitet. Så du bör vara noga med att alla önskade utvecklingspaket är installerade. Å andra sidan, styr <userinput>cmake</userinput>-alternativ vilka bibliotek som kompileras med. Förval är <userinput>-DWITH_TAGLIB:BOOL=ON -DWITH_MP4V2:BOOL=OFF -DWITH_ID3LIB:BOOL=ON -DWITH_CHROMAPRINT:BOOL=ON -DWITH_VORBIS:BOOL=ON -DWITH_FLAC:BOOL=ON </userinput>. Alternativen kan inaktiveras genom att använda <userinput>OFF</userinput>.

source: To build &kid3; as a &Qt; application without &kde;, use the <userinput>cmake</userinput> option <userinput>-DWITH_APPS=Qt</userinput>. To build both a &kde; and a &Qt; application, set <userinput>-DWITH_APPS="Qt;KDE"</userinput>.
it: Per compilare &kid3; come un'applicazione &Qt; senza &kde;, utilizzare l'opzione <userinput>-DWITH_APPS=Qt</userinput> di <userinput>cmake</userinput>. Per compilare sia un'applicazione &kde; che una &Qt;,impostare <userinput>-DWITH_APPS="Qt;KDE"</userinput>.
ru: Чтобы собрать &kid3; как приложение &Qt; без библиотек &kde;, воспользуйтесь командой <userinput>cmake</userinput> с параметром <userinput>-DWITH_APPS=Qt</userinput>. Чтобы собрать &kid3; как приложение &kde; и &Qt;, укажите параметр <userinput>-DWITH_APPS="Qt;KDE"</userinput>.
sv: För att bygga &kid3; som ett &Qt;-program utan &kde;, använd alternativet<userinput>-DWITH_APPS=Qt</userinput> i <userinput>cmake</userinput>. För att både bygga ett &kde;- och ett &Qt;-program, använd <userinput>-DWITH_APPS="Qt;KDE"</userinput>.

source: To use a specific &Qt; installation, set <userinput>-DQT_QMAKE_EXECUTABLE=/path/to/qmake</userinput>.
it: Per utilizzare un'installazione specifica di &Qt;, impostare <userinput>-DQT_QMAKE_EXECUTABLE=/percorso/a/qmake</userinput>.
ru: Чтобы воспользоваться определённым набором установленных библиотек &Qt;, укажите <userinput>-DQT_QMAKE_EXECUTABLE=/путь/к/qmake</userinput>.
sv: För att använda en specifik &Qt;-installation, ställ in <userinput>-DQT_QMAKE_EXECUTABLE=/sökväg/till/qmake</userinput>.

source: Generation of RPM-Packages is supported by the file <filename>kid3.spec</filename>, for &Debian; Packages, the script <filename>build-deb.sh</filename> is available.
it: La generazione di pacchetti RPM è supportata dal file <filename>kid3.spec</filename>, per i pacchetti &Debian;, è disponibile lo script <filename>build-deb.sh</filename>.
sv: Att generera RPM-paket stöds av filen <filename>kid3.spec</filename>. För &Debian;-paket är skriptet <filename>build-deb.sh</filename> tillgängligt.

source: The &Qt; application can also be compiled for &Windows; and &macOS;. The script <filename>buildlibs.sh</filename> can be used to download and build all required libraries and create a &kid3; package.
it: L'applicazione &Qt; può essere compilata anche per &Windows; e &macOS;. Lo script <filename>buildlibs.sh</filename> può essere utilizzato per scaricare e compilare tutte le librerie necessarie e crea un pacchetto di &kid3;.
sv: &Qt;-programmet kan också kompileras för &Windows; och &macOS;. Skriptet <filename>buildlibs.sh</filename> kan användas för att ladda ner och bygga alla nödvändiga bibliotek och skapa ett &kid3;-paket.

source: Configuration
it: Configurazione
ru: Настройка
sv: Inställning

source: With &kde;, the settings are stored in <filename>.config/kid3rc</filename>. As a &Qt; application, this file is in <filename>.config/Kid3/Kid3.conf</filename>. On &Windows;, the configuration is stored in the registry. on &macOS; in a plist file.
it: Con &kde;, le impostazioni sono archiviate in <filename>.config/kid3rc</filename>. Come applicazione &Qt;, questo file è in <filename>.config/Kid3/Kid3.conf</filename>. Su &Windows;. la configurazione è archiviata nel registro, su &macOS; in un file plist.
sv: Med &kde;, lagras inställningarna i <filename>.config/kid3rc</filename>. Som ett &Qt;-program, finns filen i <filename>.config/Kid3/Kid3.conf</filename>. På &Windows;, lagras inställningarna i registret, och på &macOS; i en plist-fil.

source: The environment variable <varname>KID3_CONFIG_FILE</varname> can be used to set the path of the configuration file.
it: La variabile di ambiente <varname>KID3_CONFIG_FILE</varname> può essere utilizzata per impostare il percorso del file di configurazione.
ru: Переменная среды <varname>KID3_CONFIG_FILE</varname> позволяет указать путь к файлу конфигурации.
sv: Miljövariabeln <varname>KID3_CONFIG_FILE</varname> kan användas för att ange inställningsfilens sökväg.

source: &DBus; Interface
it: Interfaccia &DBus;
ru: Интерфейс &DBus;
sv: &DBus; gränssnitt

source: &DBus; Examples
it: Esempi di &DBus;
ru: Примеры &DBus;
sv: &DBus;-exempel

source: On &Linux; a &DBus;-interface can be used to control &kid3; by scripts. Scripts can be written in any language with &DBus;-bindings (<abbrev>e.g.</abbrev> in Python) and can be added to the <guilabel>User Actions</guilabel> to extend the functionality of &kid3;.
it: Su &Linux;. un'interfaccia &DBus; può essere utilizzata per controllare &kid3; tramite script. Gli script possono essere scritti in qualsiasi linguaggio con associazioni &DBus; (<abbrev>ad es.</abbrev> in Python) e possono essere aggiunti alle <guilabel>Azioni dell'utente</guilabel> per estendere le funzionalità di &kid3;.
ru: В системах &Linux; управление &kid3; посредством сценариев доступно с помощью интерфейса &DBus;. Привязки к &DBus; позволяет создать сценарии на любом языке программирования (например, на Python). Эти сценарии затем возможно добавить в раздел <guilabel>Команды пользователя</guilabel> для расширения функциональных возможностей &kid3;.
sv: På &Linux; kan ett &DBus;-gränssnitt användas för att styra &kid3; med skript. Skript kan skrivas i vilket språk som helst med &DBus;-gränssnitt (<abbrev>t.ex.</abbrev> i Python) och kan läggas till i <guilabel>Användaråtgärder</guilabel> för att utöka funktionaliteten i &kid3;.

source: The artist in tag 2 of the current file can be set to the value "One Hit Wonder" with the following code:
it: L'artista nel tag 2 del file attuale può essere impostato sul valore «One Hit Wonder» con il seguente codice:
ru: Чтобы установить значение «One Hit Wonder» в поле исполнителя в теге 2, воспользуйтесь следующим кодом:
sv: Artisten i tagg 2 för aktuell fil kan tilldelas värdet "Dagslända" med följande kod:

source: or easier with &Qt;'s <command>qdbus</command> (<command>qdbusviewer</command> can be used to explore the interface in a &GUI;):
it: o più semplicemente con <command>qdbus</command> di &Qt; (<command>qdbusviewer</command> può essere utilizzato per esplorare l'interfaccia in una &GUI;):
ru: или, что проще, примените команду &Qt; <command>qdbus</command> (для изучения графического интерфейса приложения предназначена команда <command>qdbusviewer</command>):
sv: eller enklare med &Qt;:s <command>qdbus</command> (<command>qdbusviewer</command> kan användas för att utforska gränssnittet i ett grafiskt användargränssnitt):

source: &DBus; API
it: API &DBus;
ru: Программный интерфейс &DBus;
sv: &DBus; programmeringsgränssnitt

source: The &DBus; API is specified in <filename>org.kde.Kid3.xml</filename>. The &kid3; interface has the following methods:
it: Le API &DBus; è specificata in <filename>org.kde.Kid3.xml</filename>. L'interfaccia di &kid3; ha i seguenti metodi:
ru: Программный интерфейс &DBus; определён в файле <filename>org.kde.Kid3.xml</filename>. В интерфейсе &kid3; предусмотрены следующие методы:
sv: Programmeringsgränssnittet för &DBus; specificeras i <filename>org.kde.Kid3.xml</filename>. Gränssnittet i &kid3; har följande metoder:

source: Open file or folder
it: Aprire un file o una cartella
ru: Открытие файлов или каталогов
sv: Öppna fil eller katalog

source: <funcdef>boolean <function>openDirectory</function></funcdef> <paramdef>string <parameter>path</parameter></paramdef>
it: <funcdef>boolean <function>openDirectory</function></funcdef> <paramdef>string <parameter>percorso</parameter></paramdef>

source: path
it: percorso
sv: sökväg

source: path to file or folder
it: percorso a un file o a una cartella
ru: путь к файлу или каталогу
sv: sökväg till fil eller katalog

source: Returns true if OK.
it: Restituisce vero se OK.
ru: Возвращает true, если выполнено успешно.
sv: Returnerar true om ok.

source: Unload the tags of all files which are not modified or selected
it: Scaricare i tag di tutti i file che non sono stati modificati o selezionati
ru: Выгрузка тегов всех файлов, которые не были изменены или выбраны
sv: Ladda ur taggarna för alla filer som inte är ändrade eller markerade

source: Save all modified files
it: Salvare tutti i file modificati
ru: Сохранение всех изменённых файлов
sv: Spara alla ändrade filer

source: Get a detailed error message provided by some methods
it: Ricevere un messaggio di errore dettagliato fornito da alcuni metodi
ru: Получение подробного сообщения об ошибке, предоставляемого некоторыми методами
sv: Hämta ett detaljerat felmeddelande som tillhandahålls av vissa metoder

source: Returns detailed error message.
it: Restituisce il messaggio di errore dettagliato.
ru: Возвращает подробное сообщение об ошибке.
sv: Returnerar detaljerat felmeddelande.

source: Revert changes in the selected files
it: Ripristina le modifiche nei file selezionati
ru: Отмена изменений в выбранных файлах
sv: Ångrar ändringar i markerade filer

source: Start an automatic batch import
it: Avvia un'importazione in serie automatica
ru: Запуск автоматического пакетного импорта
sv: Starta en automatisk import i bakgrunden

source: <funcdef>boolean <function>batchImport</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>profileName</parameter></paramdef>
it: <funcdef>boolean <function>batchImport</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>NomeProfilo</parameter></paramdef>

source: tag mask (bit 0 for tag 1, bit 1 for tag 2)
it: maschera del tag (bit 0 per tag 1, bit 1 per tag 2)
ru: маска тега (бит 0 для тега 1, бит 1 для тега 2)
sv: taggmask (bit 0 för tagg 1, bit 1 för tagg 2)

source: name of batch import profile to use
it: nome del profilo di importazione in serie da utilizzare
ru: название профиля пакетного импорта для использования
sv: namn på bakgrundsimportprofil att använda

source: Import tags from a file
it: Importare i tag da un file
ru: Импорт тегов из файла
sv: Importera taggar från en fil

source: <funcdef>boolean <function>importFromFile</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>path</parameter></paramdef> <paramdef>int32 <parameter>fmtIdx</parameter></paramdef>
it: <funcdef>boolean <function>importFromFile</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>percorso</parameter></paramdef> <paramdef>int32 <parameter>fmtIdx</parameter></paramdef>

source: tag bit (1 for tag 1, 2 for tag 2)
it: bit del tag (1 per tag 1, 2 per tag 2)
ru: маска тега (бит 0 для тега 1, бит 1 для тега 2)
sv: taggbit (1 för tagg 1, 2 för tagg 2)

source: path of file
it: percorso del file
ru: путь к файлу
sv: sökväg till fil

source: index of format
it: Indice di formato
ru: индекс формата
sv: formatets index

source: Import tags from other tags
it: Importare i tag da altri tag
ru: Импорт тегов из других тегов
sv: importera taggar från andra taggar

source: <funcdef><function>importFromTags</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>source</parameter></paramdef> <paramdef>string <parameter>extraction</parameter></paramdef>
it: <funcdef><function>importFromTags</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>origine</parameter></paramdef> <paramdef>string <parameter>estrazione</parameter></paramdef>

source: source
it: origine
sv: källa

source: format to get source text from tags
it: formato per ottenere il testo originale dai tag
ru: формат для получения исходного текста из тегов
sv: format för att hämta källtext från taggar

source: extraction
it: estrazione
sv: extrahering

source: regular expression with frame names and captures to extract from source text
it: espressione regolare con i nomi dei frame e le catture per estrarre il testo originale
ru: регулярное выражение с названиями фреймов и группами скобок для извлечения совпадений из исходного текста
sv: reguljärt uttryck med ramnamn och infångningar för att extraheara från källtext

source: Import tags from other tags on selected files
it: Importare i tag da altri tag sui file selezionati
ru: Импорт тегов из других тегов выбранных файлов
sv: importera taggar från andra taggar för markerade filer

source: <funcdef>array <function>importFromTagsToSelection</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>source</parameter></paramdef> <paramdef>string <parameter>extraction</parameter></paramdef>
it: <funcdef>array <function>importFromTagsToSelection</function></funcdef> <paramdef>int32 <parameter>tagMask</parameter></paramdef> <paramdef>string <parameter>origine</parameter></paramdef> <paramdef>string <parameter>estrazione</parameter></paramdef>

source: extracted value for "%{__return}(.+)"
it: valore estratto per «%{__return}(.+)»
ru: извлечённое значение для «%{__return}(.+)»
sv: extraherat värde för "%{__return}(.+)"

source: Download album cover art
it: Scaricare la copertina dell'album
ru: Загрузка обложки альбома
sv: Ladda ner albumomslag

source: &URL; of picture file or album art resource
it: &URL; di un'immagine o di una copertina
ru: &URL;-адрес файла изображения или источника изображения
sv: Webbadress till bildfil eller albumomslagsresurs

source: true to add the image to all files in the folder
it: vero per aggiungere l'immagine a tutti i file nella cartella
ru: true, если изображение следует добавить во все файлы в каталоге
sv: true för att lägga till bilden i alla filer i katalogen
