Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: Import from a MusicBrainz server is possible using the dialog which appears when <guibutton>From MusicBrainz Fingerprint</guibutton> is selected. The Server can be selected as in the freedb import dialog. Below is a table displaying the imported track data. The right column shows the state of the MusicBrainz query, which starts with "Pending" when the dialog is opened. Then the fingerprint is looked up and if it does not yield a result, another lookup using the tags in the file is tried. Thus it can be helpful for a successful MusicBrainz query to store known information (<abbrev>e.g.</abbrev> artist and album) in the tags before the import. If a result was found, the search ends in the state "Recognized", otherwise nothing was found or multiple ambiguous results and one of them has to be selected by the user. <guibutton>OK</guibutton> and <guibutton>Apply</guibutton> use the imported data, <guibutton>Cancel</guibutton> closes the dialog. The closing can take a while since the whole MusicBrainz machinery has to be shut down.
it: L'importazione da un server MusicBrainz è possibile utilizzando la finestra che appare quando è selezionato <guibutton>Da MusicBrainz Fingerprint</guibutton>. Il server può essere selezionato come nella finestra di importazione freedb. Segue una tabella che mostra i dati delle tracce importate. La colonna di destra mostra lo stato della query MusicBrainz, che inizia con «In sospeso» quando viene aperta la finestra. Quindi viene cercata l'impronta digitale e se non produce un risultato, viene tentata un'altra ricerca utilizzando i tag nel file. Pertanto, può essere utile che una query MusicBrainz riuscita memorizzi informazioni note (<abbrev>ad es.</abbrev> artista e album) nei tag prima dell'importazione. Se è stato trovato un risultato, la ricerca termina nello stato «Riconosciuto», altrimenti non è stato trovato nulla o più risultati ambigui e uno di essi deve essere selezionato dall'utente. <guibutton>OK</guibutton> e <guibutton>Applica</guibutton> utilizzano i dati importati, <guibutton>Annulla</guibutton> chiude la finestra. La chiusura può richiedere del tempo poiché tutto il meccanismo di MusicBrainz deve essere spento.
ru: Чтобы импортировать данные с сервера MusicBrainz, воспользуйтесь диалогом, который появляется при выборе в меню варианта <guibutton>MusicBrainz (отпечаток)</guibutton>. Выбор сервера аналогичен выбору в диалоге импорта из freedb. Ниже располагается таблица, отображающая импортированные данные дорожек. Правый столбец содержит состояние запроса MusicBrainz (при первом открытии диалога — «В ожидании»). Производится поиск отпечатка, и, если результата не будет, приложение попробует провести другой поиск с использованием тегов файла. Таким образом, для успешного поиска в MusicBrainz желательно сохранить имеющиеся данные (например, данные об исполнителе и альбоме) в метках перед импортом. Если соответствующая запросу запись была найдено, поиск завершится с состоянием «Распознано». Если же найти такую запись не удастся, будет показано уведомление об отсутствии результатов или несколько неточных соответствий, из которых пользователю потребуется выбрать нужный вариант. Кнопки <guibutton>OK</guibutton> и <guibutton>Применить</guibutton> позволяют использовать импортированные данные, а кнопка <guibutton>Отмена</guibutton> закрывает диалог. Закрытие может занять некоторое время, так как потребуется отключить весь механизм MusicBrainz.
sv: Import från en MusicBrainz server är möjlig genom att använda dialogrutan som dyker upp när <guibutton>Från MusicBrainz Fingerprint</guibutton> väljes. Servern kan väljas som i freedb importdialogrutan. Nedan visas en tabell som visar importerad spårdata. Den högra kolumnen visar tillståndet för förfrågan till MusicBrainz, vilket börjar med "Väntande" när dialogrutan öppnas. Därefter slås fingeravtrycket upp och om det inte ger något resultat, görs en annan uppslagning med taggarna i filen. Sålunda kan det vara till hjälp för en lyckad MusicBrainz uppslagning att lagra känd information (t.ex. artist och album) i taggarna innan importen. Om ett resultat hittas, slutar sökningen i tillståndet "Igenkänd", annars hittades ingenting eller hittades flera tvetydiga resultat och ett av dem måste väljas av användaren. <guibutton>Ok</guibutton> och <guibutton>Verkställ</guibutton> använder importerad data, medan <guibutton>Avbryt</guibutton> stänger dialogrutan. Stängningen kan ta en stund, eftersom hela MusicBrainz maskineri måste stängas av.

source: For the import of textual data, <guibutton>From File/Clipboard</guibutton> opens a subdialog, where several preconfigured import formats are available. The first two, "CSV unquoted" and "CSV quoted" can be used to import data which was exported by the Export dialog. The CSV data can be edited with a spreadsheet, and shall be written using tabs as delimiters. Import should then be possible using "CSV quoted", which is more flexible than "CSV unquoted". However, its fields cannot contain any double quotes. If you only export from &kid3; and import later, "CSV unquoted" can be used as a simple format for this purpose. Note that there are also "Export CSV" and "Import CSV" commands in the context menu of the file list, which use scripts to export and import CSV data in a more complete, powerful and flexible way.
it: Per l'importazione di dati testuali, <guibutton>Da file/appunti</guibutton> apre una sotto-finestra, in cui sono disponibili diversi formati di importazione preconfigurati. I primi due, «CSV non quotato» e «CSV quotato» possono essere utilizzati per importare dati esportati dalla finestra Esporta. I dati CSV possono essere modificati con un foglio di calcolo e devono essere scritti utilizzando le tabulazioni come delimitatori. L'importazione dovrebbe quindi essere possibile utilizzando «CSV quotato», che è più flessibile di «CSV non quotato». Tuttavia, i suoi campi non possono contenere virgolette doppie. Se si esporta solo da &kid3; e si importa in seguito, «CSV non quotato» può essere utilizzato come formato semplice per questo scopo. Si noti che ci sono anche i comandi «Esporta CSV» e «Importa CSV» nel menu contestuale dell'elenco dei file, che utilizzano gli script per esportare e importare i dati CSV in un modo più completo, potente e flessibile.
ru: Для импорта текстовых данных предназначен вложенный диалог, который вызывается нажатием кнопки <guibutton>Из файла или буфера обмена...</guibutton>. В этом диалоге доступны несколько предустановленных форматов импорта. Первые два, «CSV unquoted» и «CSV quoted», используются для импорта данных, которые ранее были экспортированы с помощью диалога экспорта. Эти данные возможно редактировать с помощью электронной таблицы. Они должны быть сохранены с использованием символов табуляции в качестве разделителей. После такой обработки данные возможно импортировать с использованием формата «CSV quoted». Этот формат позволяет выполнять более тонкую настройку, чем «CSV unquoted», однако его поля не должны содержать двойных кавычек. Если производится только экспорт из &kid3; для дальнейшего импорта, рекомендуется использовать формат «CSV unquoted». Обратите внимание, что в контекстном меню списка файлов также есть пункты «Экспорт CSV» и «Импорт CSV», предусматривающие использование сценариев для более полной, эффективной и гибкой обработки данных CSV при экспорте и импорте.
sv: För att importera textdata, öppnar <guibutton>Från fil/klippbord</guibutton> en underdialogruta där flera förinställda importformat är tillgängliga. De två första, "CSV unquoted" och "CSV quoted" kan användas för att importera data som exporterades med exportdialogrutan. CSV-data kan redigera med ett kalkylark, och måste skrivas ut genom att använda tabulator som avgränsare. Import ska sedan vara möjlig genom att använda "CSV quoted", som är flexiblare än "CSV unquoted". Dock kan dess fält inte innehålla några dubbla citationstecken. Om du bara exporterar från &kid3; och importerar senare, kan "CSV unquoted" användas som ett enkelt format i detta syfte. Observera att det också finns kommandona "Exportera CSV" och "Importera CSV" i fillistans sammanhangsberoende meny, som använder skript för att exportera och importera CSV-data på ett fullständigare, kraftfullare och flexiblare sätt.

source: The next format, "freedb &HTML; text", can be used to copy information from an &HTML; page of <ulink url="http://freedb.org">freedb.org</ulink>. Search an album in freedb and if the desired information is displayed in the web browser, copy the contents to the clipboard. Then click the <guibutton>From Clipboard</guibutton> button and the imported tracks will be displayed in the preview table at the top of the dialog. If you are satisfied with the imported data, terminate the dialog with <guibutton>OK</guibutton>, which will insert the data into the tags of the current folder. The destination (<guilabel>Tag 1</guilabel>, <guilabel>Tag 2</guilabel> or <guilabel>Tag 1 and Tag 2</guilabel>) can be selected with a combo box. The files in the current folder should be in the correct track order to get their tags assigned. This is the case if they are numbered.
it: Il formato successivo, «testo &HTML; di freedb», può essere usato per copiare informazioni da un pagina &HTML; di <ulink url="http://freedb.org">freedb.org</ulink>. Cercare un album in freedb e se le informazioni desiderate sono visualizzate nel browser web, copiare il contenuto negli appunti. Quindi fare clic sul pulsante <guibutton>Dagli appunti</guibutton> e le tracce importate saranno visualizzate nella tabella di anteprima nella parte superiore della finestra. Se si è soddisfatti dei dati importati, chiudere la finestra con <guibutton>OK</guibutton>, che inserirà i dati nei tag della cartella attuale. La destinazione (<guilabel>Tag 1</guilabel>, <guilabel>Tag 2</guilabel> o <guilabel>Tag 1 e tag 2</guilabel>) può essere selezionata con una casella combinata. I file nella cartella attuale devono essere nell'ordine di traccia corretto per ottenere i tag assegnati. Questo è il caso se sono numerati.
ru: Ещё один формат, «freedb &HTML; text», используется для копирования информации с &HTML;-страницы <ulink url="http://freedb.org">freedb.org</ulink>. Найдите альбом во freedb и, если нужная информация отобразится в браузере, скопируйте содержимое в буфер обмена. Затем нажмите кнопку <guibutton>Из буфера обмена</guibutton>, и в таблице предварительного просмотра в верхней части диалога будут отображены импортированные дорожки. Если импортированные данные соответствуют ожидаемому результату, закройте диалог с помощью кнопки <guibutton>OK</guibutton>, что позволит вставить данные в теги в текущем каталоге. Место назначения (<guilabel>Тег 1</guilabel>, <guilabel>Тег 2</guilabel> или <guilabel>Тег 1 и тег 2</guilabel>) указывается с помощью раскрывающегося списка. Для корректного присваивания тегов файлы должны быть расположены в правильном порядке. Обеспечить такой порядок возможно путём нумерации файлов.
sv: Nästa format, "freedb &HTML;-text" kan användas för att kopiera information från en &HTML;-sida på <ulink url="http://freedb.org">freedb.org</ulink>. Sök efter ett album på freedb, så visas önskad information i webbläsaren. Kopiera innehållet till klippbordet. Klicka därefter på knappen <guibutton>Från klippbord</guibutton> så visas de importerade spåren i förhandsgranskningstabellen längst upp i dialogrutan. Om du är nöjd med importerad data, avsluta dialogrutan med <guibutton>Ok</guibutton>, vilket infogar data i den aktuella katalogens taggar. Målet (<guilabel>Tagg 1</guilabel>, <guilabel>Tagg 2</guilabel> eller <guilabel>Tagg 1 och tagg 2</guilabel>) kan väljas med en kombinationsruta. Filerna i den aktuella katalogen ska vara i rätt ordning för att få sina taggar tilldelade. Det är fallet om de är numrerade.

source: The next preconfigured import format, "freedb &HTML; source", can be used, if the data is available as an &HTML; document. Import is possible using the <guibutton>From File</guibutton> button, which opens a file selector, or copying its contents from an editor and then importing from clipboard. This format can be useful for offline import, although the &HTML; document could also be opened in a browser and then be imported in the first format via the clipboard.
it: Il formato successivo di importazione preconfigurato, «codice &HTML; di freedb», può essere utilizzato, se i dati sono disponibili come documento &HTML;. L'importazione è possibile utilizzando il pulsante <guibutton>Da file</guibutton>, che apre un selettore di file o ne copia il contenuto da un editor e quindi importa dagli appunti. Questo formato può essere utile per l'importazione non in linea, sebbene il documento &HTML; può anche essere aperto in un browser e quindi importato nel primo formato tramite gli appunti.
ru: Следующий предустановленный формат импорта — это «freedb &HTML; source». Этот формат возможно использовать, когда данные хранятся в формате &HTML;. Импорт производится с помощью кнопки <guibutton>Из файла</guibutton>, которая открывает окно выбора файла, или путём копирования содержимого файла из редактора с последующим импортом из буфера обмена. Этот формат может быть полезен для автономного импорта, хотя документ &HTML; также возможно открыть в браузере, а затем импортировать в первом формате с помощью буфера обмена.
sv: Nästa förinställda importformat, "freedb &HTML;-källkod", kan användas om data är tillgängligt som ett &HTML;-dokument. Import är möjlig genom att använda knappen <guibutton>Från fil</guibutton>, som öppnar en filväljare, eller genom att kopiera innehållet från en editor och sedan importera från klippbordet. Formatet kan vara användbart för nerkopplad import, även om &HTML;-dokumentet också skulle kunna öppnas i en webbläsare och sedan importeras med det första formatet via klippbordet.

source: More preconfigured formats, <abbrev>e.g.</abbrev> "Track Title Time", are available. An empty custom format can be created with <guibutton>Add</guibutton> to be set by the user. Two lines below the format name can be set with a regular expression to capture the fields from the import text. The first regular expression will be parsed once per document to gather per-album data such as artist, album, year and genre. The second line is tried to match from the start of the document to the end to get track data, usually number and title. The regular expressions include all the features offered by &Qt;, which is most of the what Perl offers. Bracketing constructs "(..)" create capture buffers for the fields to import and are preceded by &kid3; specific codes to specify which field to capture. The codes are the same as used for the filename format, besides the codes listed below, any frame name is possible:
it: Sono disponibili altri formati preconfigurati, <abbrev>ad es.</abbrev> «Titolo traccia Tempo». Un formato personalizzato vuoto può essere creato con <guibutton>Aggiungi</guibutton> per essere impostato dall'utente. Due righe sotto il nome del formato possono essere impostate con un'espressione regolare per acquisire i campi dal testo di importazione. La prima espressione regolare sarà analizzata una volta per ogni documento per raccogliere dati per album come artista, album, anno e genere. Si tenta di far corrispondere la seconda riga dall'inizio del documento alla fine per ottenere i dati della traccia, generalmente numero e titolo. Le espressioni regolari includono tutte le funzionalità offerte da &Qt; che è la maggior parte di ciò che Perl offre. I costrutti con parentesi «(..)» creano buffer di acquisizione per i campi da importare e sono preceduti da codici specifici di &kid3; per specificare quale campo acquisire. I codici sono gli stessi utilizzati per il formato del nome file, oltre ai codici elencati di seguito, è possibile qualsiasi nome di frame:
ru: Доступны и другие предустановленные форматы, например, «Track Title Time». Чтобы создать собственный формат и позже настроить его, воспользуйтесь кнопкой <guibutton>Добавить</guibutton>. В двух строках под названием формата возможно указать регулярные выражения для захвата полей из импортируемого текста. Первое регулярное выражение будет проанализировано один раз для каждого документа для получения таких данных о каждом альбоме, как имя исполнителя, название альбома, год выхода и жанр. Вторая строка анализируется с начала документа и до конца, чтобы получить данные дорожки (её номер и заголовок). Регулярные выражения включают в себя все функции, предоставляемые &Qt;, то есть большинство возможностей регулярных выражений Perl. Использование скобок «(..)» позволяет создать буферы захвата для полей для импорта. Перед ними возможно указывать специальные коды &kid3; для захвата конкретных полей. Эти коды аналогичны кодам для формата имён файлов, и помимо кодов, перечисленных далее, возможно использовать любое название фрейма:
sv: Fler förinställda format, t.ex. "Spår titel tid" är tillgängliga. Ett tomt eget format kan skapas med <guibutton>Lägg till</guibutton> för att sedan ställas in av användaren. Två rader nedanför kan formatnamnet ställas in med ett reguljärt uttryck för att lagra fälten från den importerade texten. Det första reguljära uttrycket tolkas en gång per dokument för att samla in data för varje album, såsom artist, album, år och genre. Den andra raden försöker matcha från dokumentets början till slut för att hämta spårdata, oftast nummer och titel. De reguljära uttrycken inkluderar alla funktioner som erbjuds av &Qt;, vilket är det mesta som Perl erbjuder. Parenteskonstruktioner "(..)" skapar tagningsbuffertar för fälten att importera och föregås av &kid3; specifika koder för att ange vilket fält som ska lagras. Koderna är samma som används för filnamnsformat, förutom koderna listade nedan, är alla ramnamn möjliga:

source: %t %{track} Track
it: %t %{track} Traccia
ru: %t %{track} Дорожка
sv: %t %{track} Spår

source: %d %{duration} Duration
it: %d %{duration} Durata
ru: %d %{duration} Длительность
sv: %d %{duration} Längd

source: For example, a track regular expression (second line) to import from an <filename class="extension">.m3u</filename> playlist could be "<literal>%{track}(\d+)\s+%{title}(\S[^\r\n]*)\.mp3[\r\n]</literal>". All formats can be changed by editing the regular expressions and the name and then clicking <guibutton>Save Settings</guibutton>. They will be stored in the <filename>kid3rc</filename> file in the configuration folder. This file can be directly edited to have more import formats or it can be deleted to revert to the default formats. Formats can be deleted using <guibutton>Remove</guibutton>.
it: Ad esempio, un'espressione regolare della traccia (seconda riga) da importare da una scaletta <filename class="extension">.m3u</filename> potrebbe essere «<literal>%{track}(\d+) \s +%{title}(\S [^\r\n]*)\.mp3[\r\n]</literal> ». Tutti i formati possono essere cambiati modificando le espressioni regolari e il nome e quindi facendo clic su <guibutton>Salva impostazioni</guibutton>. Saranno memorizzati nel file <filename>kid3rc</filename> nella cartella di configurazione. Questo file può essere direttamente modificato per avere più formati di importazione o può essere eliminato per ripristinare i formati predefiniti. I formati possono essere eliminati utilizzando <guibutton>Rimuovi</guibutton>.
ru: Например, регулярное выражение дорожки (вторая строка) для импорта из списка воспроизведения <filename class="extension">.m3u</filename> может выглядеть как «<literal>%{track}(\d+)\s+%{title}(\S[^\r\n]*)\.mp3[\r\n]</literal>». Все форматы возможно изменить путём редактирования регулярных выражений и названия и последующего нажатия кнопки <guibutton>Сохранить параметры</guibutton>. Они будут храниться в файле <filename>kid3rc</filename> в каталоге конфигурации. Этот файл возможно отредактировать напрямую для получения большего количества форматов импорта или удалить для возврата к форматам по умолчанию. Чтобы удалить форматы, воспользуйтесь кнопкой <guibutton>Убрать</guibutton>.
sv: Exempelvis kan ett reguljärt uttryck för spår (andra raden) för att importera från en <filename class="extension">.m3u</filename>-spellista vara "<literal>%{track}(\d+)\s+%{title}(\S[^\r\n]*)\.mp3[\r\n]</literal>". Alla format kan ändras genom att redigera de reguljära uttrycken och namnet, och därefter klicka på <guibutton>Spara inställningar</guibutton>. De lagras i filen <filename>kid3rc</filename> i inställningskatalogen. Filen kan redigeras direkt för att få fler importformat, eller kan tas bort för att återgå till standardformaten. Format kan tas bort genom att använda <guibutton>Ta bort</guibutton>.

source: <guilabel>Accuracy</guilabel> shows an estimation of how good the imported information matches the given tracks. It uses track durations or file names to calculate the level of similarity in percent. <guilabel>Cover Art</guilabel> shows the &URL; of the album cover image which will be downloaded.
it: <guilabel>Precisione</guilabel> mostra una stima della corrispondenza tra le informazioni importate e le tracce fornite. Utilizza la durata delle tracce o i nomi dei file per calcolare il livello di somiglianza in percentuale. <guilabel> Copertina </guilabel> mostra l'&URL; dell'immagine di copertina dell'album che sarà scaricata.
ru: Параметр <guilabel>Точность</guilabel> отображает оценку того, насколько хорошо импортированные данные соответствуют заданным дорожкам. Степень соответствия в процентах основана на длительности дорожек или названиях файлов. Параметр <guilabel>Обложки</guilabel> показывает &URL;-адреса изображений обложек альбомов, которые будут загружены.
sv: <guilabel>Noggrannhet</guilabel> visar en uppskattning av hur bra den importerade informationen motsvarar givna spår. Den använder spårlängder eller filnamn för att beräkna likhetsnivån i procent. <guilabel>Omslag</guilabel> visar webbadressen för albumets omslagsbild som kommer att laddas ner.

source: To check whether the imported tracks match the current set of files, the duration of the imported tracks can be compared with the duration of the files. This option can be enabled with the check box <guibutton>Check maximum allowable time difference (sec):</guibutton> and the maximum tolerated difference in time can be set in seconds. If a mismatch in a length is detected, the length is displayed with a red background in the preview table.
it: Per verificare se le tracce importate corrispondono all'insieme attuale di file, è possibile confrontare la durata delle tracce importate con la durata dei file. Questa opzione può essere abilitata con la casella di selezione <guibutton>Controlla la differenza di tempo massima consentita (sec):</guibutton> e la differenza massima tollerata nel tempo può essere impostata in secondi. Se viene rilevata una mancata corrispondenza in una lunghezza, la lunghezza viene visualizzata con uno sfondo rosso nella tabella di anteprima.
ru: Чтобы проверить, соответствуют ли импортированные данные дорожек текущему набору файлов, следует сравнить длительность импортированных дорожек с длительностью этих файлов. Для этого служит флажок <guibutton>Проверять максимальную допустимую разницу во времени (в секундах):</guibutton>, который позволяет указать максимально допустимую погрешность в секундах. Если приложение обнаружит несоответствие длительности, данные о длительности будут обозначены красным фоном в таблице предварительного просмотра.
sv: För att kontrollera om de importerade spåren motsvarar aktuell uppsättning filer, kan de importerade spårens längd jämföras med filernas längd. Alternativet kan aktiveras med kryssrutan <guibutton>Kontrollera maximal tillåten tidsskillnad (s):</guibutton> och den maximalt tolererade tidsskillnaden kan ställas in i sekunder. Om en avvikelse i längd detekteras visas den med en röd bakgrund i förhandsgranskningstabellen.
