Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: %u %{url} &URL;
ru: %u %{url} &URL;-адрес
sv: %u %{url} Webbadress

source: %b %{bitrate} Bit rate in kbit/s
ru: %b %{bitrate} Скорость передачи в кбит/с
sv: %b %{bitrate} Bithastighet i kbit/s

source: <command>select</command> <group> <arg choice="plain">all</arg> <arg choice="plain">none</arg> <arg choice="plain">first</arg> <arg choice="plain">previous</arg> <arg choice="plain">next</arg> <arg choice="plain" rep="repeat"><replaceable>FILE</replaceable></arg> </group>
ru: <command>select</command> <group> <arg choice="plain">all</arg> <arg choice="plain">none</arg> <arg choice="plain">first</arg> <arg choice="plain">previous</arg> <arg choice="plain">next</arg> <arg choice="plain" rep="repeat"><replaceable>ФАЙЛ</replaceable></arg> </group>
sv: <command>select</command> <group> <arg choice="plain">all</arg> <arg choice="plain">none</arg> <arg choice="plain">first</arg> <arg choice="plain">previous</arg> <arg choice="plain">next</arg> <arg choice="plain" rep="repeat"><replaceable>FIL</replaceable></arg> </group>

source: <prompt>kid3-cli&gt; </prompt><userinput>get</userinput><computeroutput> File: MPEG 1 Layer 3 192 kbps 44100 Hz Joint Stereo Name: 01 Intro.mp3 Tag 1: ID3v1.1 Title Intro Artist One Hit Wonder Album Let's Tag Date 2013 Track Number 1 Genre Pop</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>get title</userinput><computeroutput> Intro</computeroutput>
ru: <prompt>kid3-cli&gt; </prompt><userinput>get</userinput><computeroutput> Файл: MPEG 1 Layer 3 192 kbps 44100 Hz Joint Stereo Название: 01 Intro.mp3 Тег 1: ID3v1.1 Заголовок Intro Исполнитель One Hit Wonder Альбом Let's Tag Дата 2013 Номер дорожки 1 Жанр Pop</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>get title</userinput><computeroutput> Intro</computeroutput>
sv: <prompt>kid3-cli&gt; </prompt><userinput>get</userinput><computeroutput> File: MPEG 1 Layer 3 192 kbps 44100 Hz Joint Stereo Name: 01 Början.mp3 Tag 1: ID3v1.1 Title Intro Artist Dagslända Album Låt oss tagga Date 2013 Track Number 1 Genre Pop</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>get title</userinput><computeroutput> Intro</computeroutput>

source: <command>albumart</command> <arg choice="req"><replaceable>URL</replaceable></arg> <arg>all</arg>
ru: <command>albumart</command> <arg choice="req"><replaceable>URL-АДРЕС</replaceable></arg> <arg>all</arg>
sv: <command>albumart</command> <arg choice="req"><replaceable>WEBBADRESS</replaceable></arg> <arg>all</arg>

source: <prompt>kid3-cli&gt; </prompt><userinput>filter '%{title} contains "tro"'</userinput><computeroutput> Started /home/urs/One Hit Wonder - Let's Tag + 01 Intro.mp3 - 02 We Only Got This One.mp3 + 03 Outro.mp3 Finished</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> 1-- 01 Intro.mp3 1-- 03 Outro.mp3</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>filter All</userinput><computeroutput> Started /home/urs/One Hit Wonder - Let's Tag + 01 Intro.mp3 + 02 We Only Got This One.mp3 + 03 Outro.mp3 Finished</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> 1-- 01 Intro.mp3 12- 02 We Only Got This One.mp3 1-- 03 Outro.mp3</computeroutput>
ru: <prompt>kid3-cli&gt; </prompt><userinput>filter '%{title} contains "tro"'</userinput><computeroutput> Запуск /home/urs/One Hit Wonder - Let's Tag + 01 Intro.mp3 - 02 We Only Got This One.mp3 + 03 Outro.mp3 Завершено</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> 1-- 01 Intro.mp3 1-- 03 Outro.mp3</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>filter All</userinput><computeroutput> Запуск /home/urs/One Hit Wonder - Let's Tag + 01 Intro.mp3 + 02 We Only Got This One.mp3 + 03 Outro.mp3 Завершено</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> 1-- 01 Intro.mp3 12- 02 We Only Got This One.mp3 1-- 03 Outro.mp3</computeroutput>
sv: <prompt>kid3-cli&gt; </prompt><userinput>filter '%{title} contains "tro"'</userinput><computeroutput> Started /home/urs/Dagslända - Låt oss tagga + 01 Början.mp3 - 02 Vi har bara den här.mp3 + 03 Slutet.mp3 Finished</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> 1-- 01 Början.mp3 1-- 03 Slutet.mp3</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>filter All</userinput><computeroutput> Started /home/urs/Dagslända - Låt oss tagga + 01 Början.mp3 + 02 Vi har bara den här.mp3 + 03 Slutet.mp3 Finished</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> 1-- 01 Början.mp3 12- 02 Vi har bara den här.mp3 1-- 03 Slutet.mp3</computeroutput>

source: Shell
ru: Оболочка
sv: Skal

source: 01 Intro.mp3
sv: 01 Början.mp3

source: 02 We Only Got This One.mp3
sv: 02 Vi har bara den här.mp3

source: 03 Outro.mp3
sv: 03 Slutet.mp3

source: TITLE
sv: TITEL

source: WM/AlbumTitle
sv: WM/Albumtitel

source: DATE
sv: DATUM

source: Tag 1 != Tag 2
sv: Tagg 1 != Tagg 2

source: Tag 1 == Tag 2
sv: Tagg 1 == Tagg 2

source: <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> 1-- 01 Intro.mp3 > 12- 02 We Only Got This One.mp3 *1-- 03 Outro.mp3</computeroutput>
sv: <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> 1-- 01 Början.mp3 > 12- 02 Vi har bara den här.mp3 *1-- 03 Slutet.mp3</computeroutput>

source: <prompt>kid3-cli&gt; </prompt><userinput>select first</userinput> <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> > 1-- 01 Intro.mp3 12- 02 We Only Got This One.mp3 *1-- 03 Outro.mp3</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>select next</userinput> <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> 1-- 01 Intro.mp3 > 12- 02 We Only Got This One.mp3 *1-- 03 Outro.mp3</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>select *.mp3</userinput> <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> > 1-- 01 Intro.mp3 > 12- 02 We Only Got This One.mp3 >*1-- 03 Outro.mp3</computeroutput>
sv: <prompt>kid3-cli&gt; </prompt><userinput>select first</userinput> <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> > 1-- 01 Början.mp3 12- 02 Vi har bara den här.mp3 *1-- 03 Slutet.mp3</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>select next</userinput> <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> 1-- 01 Början.mp3 > 12- 02 Vi har bara den här.mp3 *1-- 03 Slutet.mp3</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>select *.mp3</userinput> <prompt>kid3-cli&gt; </prompt><userinput>ls</userinput><computeroutput> > 1-- 01 Början.mp3 > 12- 02 Vi har bara den här.mp3 >*1-- 03 Slutet.mp3</computeroutput>

source: <prompt>kid3-cli&gt; </prompt><userinput>set performer[0] 'Liza don Getti (soprano)'</userinput> <prompt>kid3-cli&gt; </prompt><userinput>set performer[1] 'Joe Barr (piano)'</userinput>
sv: <prompt>kid3-cli&gt; </prompt><userinput>set performer[0] 'Liza don Getti (sopran)'</userinput> <prompt>kid3-cli&gt; </prompt><userinput>set performer[1] 'Joe Barr (piano)'</userinput>

source: dbus-send --dest=org.kde.kid3 --print-reply=literal \ /Kid3 org.kde.Kid3.setFrame int32:2 string:'Artist' \ string:'One Hit Wonder'
sv: dbus-send --dest=org.kde.kid3 --print-reply=literal \ /Kid3 org.kde.Kid3.setFrame int32:2 string:'Artist' \ string:'Dagslända'

source: qdbus org.kde.kid3 /Kid3 setFrame 2 Artist \ 'One Hit Wonder'
sv: qdbus org.kde.kid3 /Kid3 setFrame 2 Artist \ 'Dagslända'

source: import dbus kid3 = dbus.SessionBus().get_object( 'org.kde.kid3', '/Kid3') kid3.setFrame(2, 'Artist', 'One Hit Wonder')
sv: import dbus kid3 = dbus.SessionBus().get_object( 'org.kde.kid3', '/Kid3') kid3.setFrame(2, 'Artist', 'Dagslända')

source: use Net::DBus; $kid3 = Net::DBus->session->get_service( "org.kde.kid3")->get_object( "/Kid3", "org.kde.Kid3"); $kid3->setFrame(2, "Artist", "One Hit Wonder");
sv: use Net::DBus; $kid3 = Net::DBus->session->get_service( "org.kde.kid3")->get_object( "/Kid3", "org.kde.Kid3"); $kid3->setFrame(2, "Artist", "Dagslända");

source: <replaceable>url</replaceable>
sv: <replaceable>webbadress</replaceable>

source: quit
sv: avsluta
