Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: script.properties(obj): String with Qt properties script.writeFile(filePath, data): Write data to file, true if OK script.readFile(filePath): Read data from file script.removeFile(filePath): Delete file, true if OK script.fileExists(filePath): true if file exists script.fileIsWritable(filePath): true if file is writable script.getFilePermissions(filePath): Get file permission mode bits script.setFilePermissions(filePath, modeBits): Set file permission mode bits script.classifyFile(filePath): Get class of file (folder "/", symlink "@", exe "*", file " ") script.renameFile(oldName, newName): Rename file, true if OK script.copyFile(source, dest): Copy file, true if OK script.makeDir(path): Create folder, true if OK script.removeDir(path): Remove folder, true if OK script.tempPath(): Path to temporary folder script.musicPath(): Path to music folder script.listDir(path, [nameFilters], [classify]): List folder entries script.system(program, [args], [msecs]): Synchronously start a system command, [exit code, standard output, standard error] if not timeout script.systemAsync(program, [args], [callback]): Asynchronously start a system command, callback will be called with [exit code, standard output, standard error] script.getEnv(varName): Get value of environment variable script.setEnv(varName, value): Set value of environment variable script.getQtVersion(): Qt version string, <abbrev>e.g.</abbrev> "5.4.1" script.getDataMd5(data): Get hex string of the MD5 hash of data script.getDataSize(data): Get size of byte array script.dataToImage(data, [format]): Create an image from data bytes script.dataFromImage(img, [format]): Get data bytes from image script.loadImage(filePath): Load an image from a file script.saveImage(img, filePath, [format]): Save an image to a file, true if OK script.imageProperties(img): Get properties of an image, map containing "width", "height", "depth" and "colorCount", empty if invalid image script.scaleImage(img, width, [height]): Scale an image, returns scaled image
it: script.properties (oggetto): stringa con proprietà Qt script.writeFile (percorsoFile, dati): scrivere i dati nel file, vero se OK script.readFile (percorsoFile): leggere i dati dal file script.removeFile (percorsoFile): eliminare il file, vero se OK script.fileExists (percorsoFile): vero se il file esiste script.fileIsWritable (percorsoFile): vero se il file è scrivibile script.getFilePermissions (percorsoFile): ottenere bit dei permessi del file script.setFilePermissions (percorsoFile, bitModalità): impostare i bit dei permessi del file script.classifyFile (percorsoFile): ottenere la classe del file (cartella "/", collegamento simbolico "@", exe "*", file " ") script.renameFile (vecchioNome, nuovoNome): rinominare il file, vero se OK script.copyFile (origine, destinazione): copiare il file, vero se OK script.makeDir (percorso): creare la cartella, vero se OK script.removeDir (percorso): rimuovere la cartella, vero se OK script.tempPath (): percorso della cartella temporanea script.musicPath (): percorso della cartella musicale script.listDir (percorso, [filtriNome], [classificare]): elencare le voci della cartella script.system (programma, [arg], [msec]): avviare un comando di sistema in modo sincrono, [codice di uscita, standard output, standard error] se non scade il tempo limite script.systemAsync (programma, [arg], [callback]): avviare un comando di sistema in modo comando asincrono, la callback sarà invocata con [codice di uscita, standard output, standard error] script.getEnv (nomeVar): ottenere il valore della variabile d'ambiente script.setEnv (nomeVar, valore): impostare il valore della variabile d'ambiente script.getQtVersion (): stringa versione Qt, <abbrev>ad es.</abbrev> "5.4.1" script.getDataMd5 (dati): ottenere la stringa esadecimale dell'hash MD5 dei dati script.getDataSize (dati): ottenere la dimensione dell'array di byte script.dataToImage (dati, [formato]): creare un'immagine da byte di dati script.dataFromImage (img, [formato]): ottenere byte di dati dall'immagine script.loadImage (percorsoFile): caricare un'immagine da un file script.saveImage (img, percorsoFile, [formato]): salvare un'immagine in un file, vero se OK script.imageProperties (img): ottenere le proprietà di un'immagine, una mappa contenente "larghezza", "altezza", "profondità" e "colorCount", vuoto se l'immagini non è valida script.scaleImage (img, larghezza, [altezza]): ridimensionare un'immagine, restituisce un'immagine ridimensionata
ru: script.properties(obj): строка со свойствами Qt script.writeFile(filePath, data): записать данные в файл, true, если успешно script.readFile(filePath): прочитать данные из файла script.removeFile(filePath): удалить файл, true, если успешно script.fileExists(filePath): true, если файл существует script.fileIsWritable(filePath): true, если файл доступен для записи script.getFilePermissions(filePath): получить биты режима доступа к файлу script.setFilePermissions(filePath, modeBits): указать биты режима доступа к файлу script.classifyFile(filePath): получить класс файла (каталог — «/», символическая ссылка — «@», exe — «*», файл « ») script.renameFile(oldName, newName): переименовать файл, true, если успешно script.copyFile(source, dest): скопировать файл, true, если успешно script.makeDir(path): создать каталог, true, если успешно script.removeDir(path): удалить каталог, true, если успешно script.tempPath(): путь к временному каталогу script.musicPath(): путь к каталогу с файлами музыки script.listDir(path, [nameFilters], [classify]): список записей в каталоге script.system(program, [аргументы], [миллисекунды]): синхронно запустить системную команду, [код выхода, стандартный вывод, стандартная ошибка], если не превышено время ожидания script.systemAsync(program, [аргументы], [обратный вызов]): асинхронно запустить системную команду, обратный вызов будет выполнен данными [код выхода, стандартный вывод, стандартная ошибка] script.getEnv(varName): получить значение переменной среды script.setEnv(varName, value): указать значение переменной среды script.getQtVersion(): строка версии Qt, например, «5.4.1» script.getDataMd5(data): получить шестнадцатеричную строку хеша данных MD5 script.getDataSize(data): получить размер байтового массива script.dataToImage(data, [формат]): создать изображение из байтов данных script.dataFromImage(img, [формат]): получить байты данных из изображения script.loadImage(filePath): загрузить изображение из файла script.saveImage(img, filePath, [формат]): сохранить изображение в файл, true, если успешно script.imageProperties(img): получить свойства изображения, карту, содержащую значения «width», «height», «depth» и «colorCount», возвращает пустое значение ,если изображение недействительно script.scaleImage(img, width, [высота]): масштабировать изображение, возвращает масштабированное изображение
sv: script.properties(obj): Sträng med Qt-egenskaper script.writeFile(filePath, data): Skriv data i filen, true om ok script.readFile(filePath): Läs data från fil script.removeFile(filePath): Ta bort fil, true om ok script.fileExists(filePath): true om filen finns script.fileIsWritable(filePath): true om filen är skrivbar script.getFilePermissions(filePath): Hämta filrättighetsbitar script.setFilePermissions(filePath, modeBits): Tilldela filrättighetsbitar script.classifyFile(filePath): Hämta filklassen (katalog "/", symbolisk länk "@", exe "*", file " ") script.renameFile(oldName, newName): Byt namn på fil, true om ok script.copyFile(source, dest): Kopiera fil, true om ok script.makeDir(path): Skapa katalog, true om ok script.removeDir(path): Ta bort katalog, true om ok script.tempPath(): Sökväg till temporär katalog script.musicPath(): Sökväg till musikfolder script.listDir(path, [nameFilters], [classify]): Lista katalogposter script.system(program, [args], [msecs]): Starta ett systemkommando synkront, [avslutningskod, standardutmatning, standardfelutmatning] om tidsgräns inte överskrids script.systemAsync(program, [args], [callback]): Starta ett systemkommando asynkront, återanrop görs med [avslutningskod, standardutmatning, standardfelutmatning] script.getEnv(varName): Hämta värde på miljövariabel script.setEnv(varName, value): Tilldela miljövariabel värde script.getQtVersion(): Qt-versionssträng, t.ex. "5.4.1" script.getDataMd5(data): Hämta hexadecimal sträng med MD5-kondensat för data script.getDataSize(data): Hämta storlek på bytefält script.dataToImage(data, [format]): Skapa en bild från data script.dataFromImage(img, [format]): Hämta data från en bild script.loadImage(filePath): Läs in en bild från en fil script.saveImage(img, filePath, [format]): Spara en bild i en fil, true om ok script.imageProperties(img): Hämta egenskaper för en bild, avbildning med "width", "height", "depth" och "colorCount", tom om ogiltig bild script.scaleImage(img, width, [height]): Skala en bild, returnerar skalad bild

source: Application Context
it: Contesto dell'applicazione
ru: Контекст приложений
sv: Programsammanhang

source: Using QML, a large part of the &kid3; functions are accessible. The API is similar to the one used for <link linkend="dbus-api">&DBus;</link>. For details, refer to the respective notes.
it: Utilizzando QML, gran parte delle funzioni di &kid3; sono accessibili. L'API è simile a quella utilizzata per <link linkend="dbus-api">&DBus;</link>. Per i dettagli, consultare le rispettive note.
ru: При использовании QML доступна большая часть функциональных возможностей &kid3;. Программный интерфейс похож на тот, что используется для <link linkend="dbus-api">&DBus;</link>. Для получения более подробной информации обратитесь к соответствующим заметкам.
sv: Med användning av QML, är en stor del av funktionerna i &kid3; tillgängliga. Programmeringsgränssnittet liknar det som används för <link linkend="dbus-api">&DBus;</link>. För detaljerad information, se respektive anmärkningar.

source: app.openDirectory(path): Open folder app.unloadAllTags(): Unload all tags app.saveDirectory(): Save folder app.revertFileModifications(): Revert app.importTags(tag, path, fmtIdx): Import file app.importFromTags(tag, source, extraction): Import from tags app.importFromTagsToSelection(tag, source, extraction): Import from tags of selected files app.downloadImage(url, allFilesInDir): Download image app.exportTags(tag, path, fmtIdx): Export file app.writePlaylist(): Write playlist app.getPlaylistItems(path): Get items of a playlist app.setPlaylistItems(path, items): Set items of a playlist app.selectAllFiles(): Select all app.deselectAllFiles(): Deselect app.firstFile([select], [onlyTaggedFiles]): To first file app.nextFile([select], [onlyTaggedFiles]): To next file app.previousFile([select], [onlyTaggedFiles]): To previous file app.selectCurrentFile([select]): Select current file app.selectFile(path, [select]): Select a specific file app.getSelectedFilePaths([onlyTaggedFiles]): Get paths of selected files app.requestExpandFileList(): Expand all app.applyFilenameFormat(): Apply filename format app.applyTagFormat(): Apply tag format app.applyTextEncoding(): Apply text encoding app.numberTracks(nr, total, tag, [options]): Number tracks app.applyFilter(expr): Filter app.convertToId3v23(): Convert ID3v2.4.0 to ID3v2.3.0 app.convertToId3v24(): Convert ID3v2.3.0 to ID3v2.4.0 app.getFilenameFromTags(tag): Filename from tags app.getTagsFromFilename(tag): Filename to tags app.getAllFrames(tag): Get object with all frames app.getFrame(tag, name): Get frame app.setFrame(tag, name, value): Set frame app.getPictureData(): Get data from picture frame app.setPictureData(data): Set data in picture frame app.copyToOtherTag(tag): Tags to other tags app.copyTags(tag): Copy app.pasteTags(tag): Paste app.removeTags(tag): Remove app.playAudio(): Play app.readConfig(): Read configuration app.applyChangedConfiguration(): Apply configuration app.dirName: Folder name app.selectionInfo.fileName: File name app.selectionInfo.filePath: Absolute file path app.selectionInfo.detailInfo: Format details app.selectionInfo.tag(Frame.Tag_1).tagFormat: Tag 1 format app.selectionInfo.tag(Frame.Tag_2).tagFormat: Tag 2 format app.selectionInfo.formatString(tag, format): Substitute codes in format string app.selectFileName(caption, dir, filter, saveFile): Open file dialog to select a file app.selectDirName(caption, dir): Open file dialog to select a folder
it: app.openDirectory(percorso): aprire una cartella app.unloadAllTags(): scaricare tutti i tag app.saveDirectory(): salvare una cartella app.revertFileModifications(): ripristinare app.importTags(tag, percorso, fmtIdx): importare i file app.importFromTags(tag, origine, estrazione): importare dai tag app.importFromTagsToSelection(tag, origine, estrazione): importare dai tag dei file selezionati app.downloadImage(url, allFilesInDir): scaricare un'immagine app.exportTags(tag, percorso, fmtIdx): esportare i file app.writePlaylist(): scaricare una scaletta app.getPlaylistItems(percorso): ottenere gli elementi di una scaletta app.setPlaylistItems(percorso, elementi): impostare gli elementi id una scaletta app.selectAllFiles(): selezionare tutto app.deselectAllFiles(): deselezionare app.firstFile([selezione], [soloFileConTag]): al primo file app.nextFile([selezione], [soloFileConTag]): al file successivo app.previousFile([selezione], [soloFileConTag]): al file precedente app.selectCurrentFile([selezione]): selezionare un file attuale app.selectFile(path, [selezione]): selezionare un file specifico app.getSelectedFilePaths([soloFileConTag]): ottenere i percorsi dei file selezionati app.requestExpandFileList(): espandere tutto app.applyFilenameFormat(): applicare il formato ai nomi dei file app.applyTagFormat(): applicare il formato al tag app.applyTextEncoding(): applicare la codifica del testo app.numberTracks(nr, totale, tag, [opzioni]): Numerare le tracce app.applyFilter(espressione): filtro app.convertToId3v23(): convertire ID3v2.4.0 in ID3v2.3.0 app.convertToId3v24(): convertire ID3v2.3.0 in ID3v2.4.0 app.getFilenameFromTags(tag): nomi dei file dai tag app.getTagsFromFilename(tag): nomi dei file ai tag app.getAllFrames(tag): ottenere oggetti con tutti i frame app.getFrame(tag, nome): ottenere un frame app.setFrame(tag, nome, valore): impostare un frame app.getPictureData(): ottenere i dati da un frame di immagine app.setPictureData(dati): impostare i dati in un frame di immagine app.copyToOtherTag(tag): tag ad altri tag app.copyTags(tag): copiare app.pasteTags(tag): incollare app.removeTags(tag): Rimuovere app.playAudio(): Riprodurre app.readConfig(): Leggere la configurazione app.applyChangedConfiguration(): Applicare la configurazione app.dirName: Nome della cartella app.selectionInfo.fileName: Nome del file app.selectionInfo.filePath: Percorso assoluto del file app.selectionInfo.detailInfo: Dettagli di formato app.selectionInfo.tag(Frame.Tag_1).tagFormat: Formato tag 1 app.selectionInfo.tag(Frame.Tag_2).tagFormat: Formato tag 2 app.selectionInfo.formatString(tag, formato): Sostituire i codici nella stringa di formato app.selectFileName(titolo, cartella, filtro, saveFile): Aprire la finestra per selezionare un file app.selectDirName(titolo, cartella): Aprire la finestra per selezionare una cartella
ru: app.openDirectory(path): открыть каталог app.unloadAllTags(): выгрузить все теги app.saveDirectory(): сохранить каталог app.revertFileModifications(): отменить app.importTags(tag, path, fmtIdx): импортировать файл app.importFromTags(tag, source, extraction): импортировать из тегов app.importFromTagsToSelection(tag, source, extraction): импортировать из тегов выделенных файлов app.downloadImage(url, allFilesInDir): загрузить изображение app.exportTags(tag, path, fmtIdx): экспортировать файл app.writePlaylist(): записать список воспроизведения app.getPlaylistItems(path): получить элементы списка воспроизведения app.setPlaylistItems(path, items): установить элементы списка воспроизведения app.selectAllFiles(): выделить все app.deselectAllFiles(): снять выделение app.firstFile([select], [onlyTaggedFiles]): до первого файла app.nextFile([select], [onlyTaggedFiles]): до следующего файла app.previousFile([select], [onlyTaggedFiles]): до предыдущего файла app.selectCurrentFile([select]): выделить текущий файл app.selectFile(path, [select]): выделить указанный файл app.getSelectedFilePaths([onlyTaggedFiles]): получить пути к выделенным файлам app.requestExpandFileList(): развернуть все app.applyFilenameFormat(): применить формат имени файла app.applyTagFormat(): применить формат тега app.applyTextEncoding(): применить кодировку текста app.numberTracks(nr, total, tag, [options]): пронумеровать дорожки app.applyFilter(expr): отфильтровать app.convertToId3v23(): преобразовать ID3v2.4.0 в ID3v2.3.0 app.convertToId3v24(): преобразовать ID3v2.3.0 в ID3v2.4.0 app.getFilenameFromTags(tag): получить имя файла из тегов app.getTagsFromFilename(tag): получить теги из имени файла app.getAllFrames(tag): получить объект со всеми фреймами app.getFrame(tag, name): получить фрейм app.setFrame(tag, name, value): установить фрейм app.getPictureData(): получить данные из фрейма изображения app.setPictureData(data): указать данные во фрейме изображения app.copyToOtherTag(tag): скопировать данные тегов в другие теги app.copyTags(tag): копировать app.pasteTags(tag): вставить app.removeTags(tag): удалить app.playAudio(): воспроизвести app.readConfig(): прочитать конфигурацию app.applyChangedConfiguration(): применить конфигурацию app.dirName: имя каталога app.selectionInfo.fileName: имя файла app.selectionInfo.filePath: абсолютный путь к файлу app.selectionInfo.detailInfo: описание формата app.selectionInfo.tag(Frame.Tag_1).tagFormat: формат тега 1 app.selectionInfo.tag(Frame.Tag_2).tagFormat: формат тега 2 app.selectionInfo.formatString(tag, format): заменить коды в строке формата app.selectFileName(caption, dir, filter, saveFile): открыть диалоговое окно для выбора файла app.selectDirName(caption, dir): открыть диалоговое окно для выбора каталога
sv: app.openDirectory(path): Öppna katalog app.unloadAllTags(): Ladda ur alla taggar app.saveDirectory(): Spara katalog app.revertFileModifications(): Ångra app.importTags(tag, path, fmtIdx): Importera filer app.importFromTags(tag, source, extraction): Importera från taggar app.importFromTagsToSelection(tag, source, extraction): Importera från taggar från markerade filer app.downloadImage(url, allFilesInDir): Ladda ner bild app.exportTags(tag, path, fmtIdx): Exportera filer app.writePlaylist(): Skriv spellista app.getPlaylistItems(path): Hämta objekt i en spellista app.setPlaylistItems(path, items): Tilldela objekt i en spellista app.selectAllFiles(): Markera alla app.deselectAllFiles(): Avmarkera app.firstFile([select], [onlyTaggedFiles]): Till första fil app.nextFile([select], [onlyTaggedFiles]): Till nästa fil app.previousFile([select], [onlyTaggedFiles]): Till föregående fil app.selectCurrentFile([select]): Markera aktuell fil app.selectFile(path, [select]): Markera en specifik fil app.getSelectedFilePaths([onlyTaggedFiles]): Hämta sökvägar för markerade filer app.requestExpandFileList(): Expandera alla app.applyFilenameFormat(): Använd filnamnsformat app.applyTagFormat(): Verkställ taggformat app.applyTextEncoding(): Verkställ textkodning app.numberTracks(nr, total, tag, [options]): Nummerspår app.applyFilter(expr): Filtrera app.convertToId3v23(): Konvertera ID3v2.4.0 till ID3v2.3.0 app.convertToId3v24(): Konvertera ID3v2.3.0 till ID3v2.4.0 app.getFilenameFromTags(tag): Filnamn från taggar app.getTagsFromFilename(tag): Filnamn till taggar app.getAllFrames(tag): Hämta object med alla ramar app.getFrame(tag, name): Hämta ram app.setFrame(tag, name, value): Tilldela ram app.getPictureData(): Hämta data från bildram app.setPictureData(data): Tilldela data i bildram app.copyToOtherTag(tag): Taggar till andra taggar app.copyTags(tag): Kopiera app.pasteTags(tag): Klistra in app.removeTags(tag): Ta bort app.playAudio(): Spela app.readConfig(): Läs inställning app.applyChangedConfiguration(): Verkställ inställning app.dirName: Katalognamn app.selectionInfo.fileName: Filnamn app.selectionInfo.filePath: Absolut filsökväg app.selectionInfo.detailInfo: Formatdetaljer app.selectionInfo.tag(Frame.Tag_1).tagFormat: Tagg 1 format app.selectionInfo.tag(Frame.Tag_2).tagFormat: Tagg 2 format app.selectionInfo.formatString(tag, format): Ersätt koder i formatsträng app.selectFileName(caption, dir, filter, saveFile): Öppna fildialogruta för att markera en fil app.selectDirName(caption, dir): Öppna fildialogruta för att markera en katalog

source: For asynchronous operations, callbacks can be connected to signals.
it: Per operazioni asincrone, le callback possono essere collegate ai segnali.
ru: Для асинхронных действий обратные вызовы возможно связывать с сигналами.
sv: För asynkrona operationer, kan återanrop anslutas till signaler.

source: Configuration Objects
it: Oggetti di configurazione
ru: Объекты конфигурации
sv: Inställningsobjekt

source: The different configuration sections are accessible via methods of <function>configs</function>. Their properties can be listed in the QML console. <screen width="80"> script.properties(configs.networkConfig()) </screen> Properties can be set:
it: Le diverse sezioni di configurazione sono accessibili tramite i metodi di <function>configs</function>. Le loro proprietà possono essere elencate nella console QML. <screen width="80"> script.properties (configs.networkConfig()) </screen> È possibile impostare le proprietà:
ru: Доступ к различным разделам конфигурации обеспечивается с помощью методов <function>configs</function>. Список их свойств возможно просмотреть с помощью консоли QML. <screen width="80"> script.properties(configs.networkConfig()) </screen> Могут быть установлены такие свойства:
sv: De olika inställningsdelarna kan kommas åt via metoder kallade <function>configs</function>. Deras egenskaper kan listas i QML-konsolen. <screen width="80"> script.properties(configs.networkConfig()) </screen> Egenskaperna kan ställas in:

source: <command>kid3</command> <group> <arg choice="plain"><option>&doublehyphen;help</option></arg> <arg choice="plain"><option>&doublehyphen;author</option></arg> <arg choice="plain"><option>&doublehyphen;version</option></arg> <arg choice="plain"><option>&doublehyphen;license</option></arg> <arg choice="plain"><option>&doublehyphen;desktopfile <filename>FILE</filename></option></arg> </group> <arg rep="repeat"><replaceable>FILE</replaceable></arg>
ru: <command>kid3</command> <group> <arg choice="plain"><option>&doublehyphen;help</option></arg> <arg choice="plain"><option>&doublehyphen;author</option></arg> <arg choice="plain"><option>&doublehyphen;version</option></arg> <arg choice="plain"><option>&doublehyphen;license</option></arg> <arg choice="plain"><option>&doublehyphen;desktopfile <filename>ФАЙЛ</filename></option></arg> </group> <arg rep="repeat"><replaceable>ФАЙЛ</replaceable></arg>
sv: <command>kid3</command> <group> <arg choice="plain"><option>&doublehyphen;help</option></arg> <arg choice="plain"><option>&doublehyphen;author</option></arg> <arg choice="plain"><option>&doublehyphen;version</option></arg> <arg choice="plain"><option>&doublehyphen;license</option></arg> <arg choice="plain"><option>&doublehyphen;desktopfile <filename>FIL</filename></option></arg> </group> <arg rep="repeat"><replaceable>FIL</replaceable></arg>

source: FILE
ru: ФАЙЛ
sv: FIL

source: &doublehyphen;desktopfile <filename>FILE</filename>
ru: &doublehyphen;desktopfile <filename>ФАЙЛ</filename>
sv: &doublehyphen;desktopfile <filename>FIL</filename>

source: File
ru: Файл
sv: Fil

source: %l %{album} Album
ru: %l %{album} Альбом

source: Tag 1
ru: Тег 1
sv: Tagg 1

source: Tag 2
ru: Тег 2
sv: Tagg 2

source: Tag 3
ru: Тег 3
sv: Tagg 3

source: Album
ru: Альбом

source: Compilation
ru: Сборник

source: <entry>Copyright</entry>
ru: <entry>Авторские права</entry>

source: Remixer
ru: Ремиксер
