Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: Set the tag frames from the file names, for example <userinput>totag '%{albumartist} - %{album}/%{track} %{title}' 2</userinput>. If no format is specified, the format set in the &GUI; is used. If the format of the filename does not match this pattern, a few other commonly used formats are tried.
it: Impostare i frame dei tag dai nomi dei file, ad esempio <userinput>totag '%{albumartist} - %{album}/%{track}%{title}' 2</userinput>. Se non si specificato alcun formato, è utilizzato il formato impostato nella &GUI;. Se il formato del nome file non corrisponde a questo modello, vengono provati altri formati comunemente utilizzati.
ru: Установить содержание фреймов тегов на основе названий файлов, например, <userinput>totag '%{albumartist} - %{album}/%{track} %{title}' 2</userinput>. Если формат не указан, будет использован формат, установленный в графическом интерфейсе. Если формат названия файла не соответствует указанному шаблону, будет предпринята попытка использовать другие распространённые форматы.
sv: Tilldela taggramar från filnamnen, exempelvis <userinput>totag '%{albumartist} - %{album}/%{track} %{title}' 2</userinput>. Om inget format anges, används formatet inställt i det grafiska användargränssnittet. Om filnamnets format inte matchar mönstret, provas några andra ofta använda format.

source: Tag to other tag
it: Tag in altro tag
ru: Тег в другой тег
sv: Tagg till annan tagg

source: <command>syncto</command> <arg choice="req"><replaceable>TAG-NUMBER</replaceable></arg>
it: <command>syncto</command> <arg choice="req"><replaceable>NUMERO-TAG</replaceable></arg>
ru: <command>syncto</command> <arg choice="req"><replaceable>НОМЕР-ТЕГА</replaceable></arg>
sv: <command>syncto</command> <arg choice="req"><replaceable>TAGGNUMMER</replaceable></arg>

source: Copy the tag frames from one tag to the other tag, <abbrev>e.g.</abbrev> to set the ID3v2 tag from the ID3v1 tag, use <userinput>syncto 2</userinput>.
it: Copiare i frame dei tag da un tag all'altro tag, <abbrev>ad es.</abbrev> per impostare il tag ID3v2 dal tag ID3v1, utilizzare <userinput>syncto 2</userinput>.
ru: Копировать фреймы тега из одного тега в другой; например, чтобы заполнить тег ID3v2 данными из тега ID3v1, воспользуйтесь командой <userinput>syncto 2</userinput>.
sv: Kopiera taggramarna från en tagg till den andra taggen, använd <abbrev>t.ex.</abbrev> <userinput>syncto 2</userinput> för att tilldela ID3v2-taggen från ID3v1-taggen.

source: Copy
it: Copia
ru: Копировать
sv: Kopiera

source: <command>copy</command> <arg><replaceable>TAG-NUMBER</replaceable></arg>
it: <command>copy</command> <arg><replaceable>NUMERO-TAG</replaceable></arg>
ru: <command>copy</command> <arg><replaceable>НОМЕР-ТЕГА</replaceable></arg>
sv: <command>copy</command> <arg><replaceable>TAGGNUMMER</replaceable></arg>

source: Copy the tag frames of the selected file to the internal copy buffer. They can then be set on another file using the <command>paste</command> command.
it: Copiare i frame dei tag dei file selezionati nel buffer interno di copia. Essi possono essere impostati su un altro file utilizzando il comando <command>paste</command>.
ru: Скопировать фреймы тега выбранного файла во внутренний буфер обмена. Команда <command>paste</command> позволяет установить эти фреймы в другой файл.
sv: Kopiera de markerade filernas taggramar till den interna kopieringsbufferten. De kan därefter tilldelas till en annan fil genom att använda kommandot <command>paste</command>.

source: To copy only a subset of the frames, use the "selected" pseudo field with the <command>set</command> command. For example, to copy only the disc number and copyright frames, use
it: Per copiare solo un sottoinsieme dei frame, utilizzare lo pseudo-campo «selected» con il comando <command>set</command>. Ad esempio, per copiare solo il numero del disco e i frame del copyright, utilizzare
ru: Чтобы скопировать только подмножество фреймов, воспользуйтесь псевдополем «selected» с командой <command>set</command>. Например, чтобы скопировать только фреймы номера диска и авторских прав, воспользуйтесь командой
sv: För att bara kopiera en delmängd av ramarna, använd pseudofältet "selected" med kommandot <command>set</command>. För att exempelvis bara kopiera skivnummer- och copyrightramar, använd

source: Paste
it: Incolla
ru: Вставить
sv: Klistra in

source: <command>paste</command> <arg><replaceable>TAG-NUMBER</replaceable></arg>
it: <command>paste</command> <arg><replaceable>NUMERO-TAG</replaceable></arg>
ru: <command>paste</command> <arg><replaceable>НОМЕР-ТЕГА</replaceable></arg>
sv: <command>paste</command> <arg><replaceable>TAGGNUMMER</replaceable></arg>

source: Set tag frames from the contents of the <command>copy</command> buffer in the selected files.
it: Impostare i frame dei tag dal contenuto del buffer <command>copy</command> nei file selezionati.
ru: Заполнить данные фреймов тегов выделенных файлов на основе содержимого буфера <command>copy</command>.
sv: Tilldela taggramar från innehållet i <command>copy</command>-bufferten för de markerade filerna.

source: Remove
it: Rimuovi
ru: Убрать
sv: Ta bort

source: <command>remove</command> <arg><replaceable>TAG-NUMBER</replaceable></arg>
it: <command>remove</command> <arg><replaceable>NUMERO-TAG</replaceable></arg>
ru: <command>remove</command> <arg><replaceable>НОМЕР-ТЕГА</replaceable></arg>
sv: <command>remove</command> <arg><replaceable>TAGGNUMMER</replaceable></arg>

source: Remove a tag.
it: Rimuovere un tag.
ru: Удалить тег.
sv: Ta bort en tagg.

source: It is possible to remove only a subset of the frames by selecting them as described in the <link linkend="cli-copy"><command>copy</command> command</link>.
it: È possibile rimuovere solo un sottoinsieme dei frame selezionandoli come descritto nel comando <link linkend="cli-copy"><command>copy</command></link>.
ru: Возможно удалить только подмножество фреймов путём их выделения, как указано в описании <link linkend="cli-copy">команды <command>copy</command></link>.
sv: Det är möjligt att bara ta bort en delmängd av ramarna genom att markera dem som beskrivs för <link linkend="cli-copy">kommandot <command>copy</command></link>.

source: Configure Kid3
it: Configura Kid3
ru: Настроить Kid3
sv: Anpassa Kid3

source: <command>config</command> <arg><replaceable>OPTION</replaceable></arg> <arg><replaceable>VALUE</replaceable></arg>
it: <command>config</command> <arg><replaceable>OPZIONE</replaceable></arg> <arg><replaceable>VALORE</replaceable></arg>
ru: <command>config</command> <arg><replaceable>ПАРАМЕТР</replaceable></arg> <arg><replaceable>ЗНАЧЕНИЕ</replaceable></arg>
sv: <command>config</command> <arg><replaceable>ALTERNATIV</replaceable></arg> <arg><replaceable>VÄRDE</replaceable></arg>

source: Query or set a configuration option.
it: Interroga o imposta un'opzione di configurazione.
ru: Запрос или установка параметров конфигурации.
sv: Fråga efter eller ställ in ett inställningsalternativ.

source: The <replaceable>OPTION</replaceable> consists of a group name and a property name separated by a dot. When no <replaceable>OPTION</replaceable> is given, all available groups are displayed. If only a group name is given, all available properties of the group are displayed. For a given group and property, the currently configured value is displayed. To change the setting, the new value can be passed as a second argument.
it: L'<replaceable>OPZIONE</replaceable> è composta da un nome di gruppo e un nome della proprietà separato da un punto. Quando nessuna <replaceable>OPZIONE</replaceable> viene fornito, vengono visualizzati tutti i gruppi disponibili. Se viene fornito solo un nome di gruppo, vengono visualizzate tutte le proprietà disponibili del gruppo. Per un dato gruppo e proprietà, viene visualizzato il valore attualmente configurato. Per modificare l'impostazione, il nuovo valore può essere passato come secondo argomento.
ru: <replaceable>ПАРАМЕТР</replaceable> состоит из имени группы и имени свойства, разделённых точкой. Если <replaceable>ПАРАМЕТР</replaceable> не задан, будут отображаться все доступные группы. Если задано только имя группы, будут отображаться все доступные свойства группы. Если задана группа и свойство, будет отображаться текущее настроенное значение. Для изменения параметра возможно передать новое значение в качестве второго аргумента.
sv: <replaceable>ALTERNATIV</replaceable> består av ett gruppnamn och ett egenskapsnamn åtskilda av en punkt. När inget <replaceable>ALTERNATIV</replaceable> anges, visas alla tillgängliga grupper. Om bara ett gruppnamn anges, visas alla gruppens tillgängliga egenskaper. För en given grupp och egenskap, visas det för närvarande inställda värdet. För att ändra inställningen kan det nya värdet anges som andra argument.

source: If the value of a setting is a list, all list elements have to be given as arguments. This means that to append an element to an existing list of elements, all existing elements have to be passed followed by the new element. In such a situation, it is easier to use the JSON mode, where the current list can be copied with the new element appended.
it: Se il valore di un'impostazione è un elenco, tutti gli elementi dell'elenco devono essere forniti come argomenti. Ciò significa che per aggiungere un elemento a un elenco esistente di elementi, tutti gli elementi esistenti devono essere passati seguiti dal nuovo elemento. In una situazione del genere, è più facile utilizzare la modalità JSON, dove l'elenco attuale può essere copiato con il nuovo elemento aggiunto.
ru: Если значение параметра представлено в виде списка, все элементы списка должны быть указаны как аргументы. Это значит, что для добавления элемента к существующему списку элементов необходимо передать все существующие элементы, указав после них новый элемент. В таком случае лучше использовать режим JSON; это позволит скопировать текущий список и добавить новый элемент.
sv: Om en inställnings värde är en lista, måste alla listelement anges som argument. Det betyder att för att lägga till ett element i en befintlig lista, måste alla befintliga element anges, följda av det nya elementet. I ett sådant fall är det enklare att använda JSON, där den nuvarande listan kan kopieras, med det nya elementet tillagt.

source: Examples
it: Esempi
ru: Примеры
sv: Exempel

source: Set title containing an apostrophe. Commands passed to <command>kid3-cli</command> with <parameter>-c</parameter> have to be in quotes if they do not only consist of a single word. If such a command itself has an argument containing spaces, that argument has to be quoted too. In &UNIX; shells single or double quotes can be used, but on the Windows Command Prompt, it is important that the outer quoting is done using double quotes and inside these quotes, single quotes are used. If the text inside the single quotes contains a single quote, it has to be escaped using a backslash character, as shown in the following example:
it: Imposta il titolo contenente un apostrofo. I comandi passati a <command>kid3-cli</command> con <parameter>-c</parameter> devono essere tra virgolette se non consistono in una sola parola. Se un comando di questo tipo ha un argomento contenente spazi, anche quell'argomento deve essere citato. Nelle shell &UNIX; possono essere utilizzate virgolette singole o doppie, ma nel prompt dei comandi di Windows è importante che le virgolette esterne vengano eseguite utilizzando virgolette doppie e all'interno di queste virgolette vengano utilizzate virgolette singole. Se il testo all'interno delle virgolette singole contiene una virgoletta singola, è necessario eseguirne l'escape utilizzando un carattere di barra rovesciata, come mostrato nell'esempio seguente:
ru: Установить заголовок, содержащий апостроф. Команды с параметром <parameter>-c</parameter>, которые передаются <command>kid3-cli</command>, должны быть заключены в кавычки, если они состоят из нескольких слов. Если такая команда сама по себе содержит аргумент с пробелами, его тоже следует заключить в кавычки. В командных оболочках &UNIX; возможно использовать одинарные или двойные кавычки, но в командной строке Windows важно использовать в качестве наружных двойные кавычки, а внутренних — одинарные. Если в тексте внутри одинарных кавычек содержатся ещё одни одинарные кавычки, их следует экранировать с помощью символа обратной косой черты, как это показано в следующем примере:
sv: Tilldela en titel som innehåller en apostrof. Kommandon som skickas till <command>kid3-cli</command> med <parameter>-c</parameter> måste vara inom citationstecken om de inte bara består av enstaka ord. OM ett sådant kommando själv har ett argument som innehåller mellanslag, måste det argumentet också citeras. Med &UNIX;-skal kan enkla eller dubbla citationstecken användas, men med Windows kommandofönster är det viktigt att de yttre citationstecknen är dubbla och att enkla citationstecken används inom dessa. Om texten inom de enkla citationstecknen innehåller ett enkelt citationstecken måste det undantas genom att använda ett bakstreck, som visas i följande exempel:

source: <userinput>kid3-cli -c "set title 'I\'ll be there for you'" /path/to/folder</userinput>
it: <userinput>kid3-cli -c "set title 'I\'ll be there for you'" percorso/a/cartella</userinput>
ru: <userinput>kid3-cli -c "set title 'I\'ll be there for you'" /путь/к/каталогу</userinput>
sv: <userinput>kid3-cli -c "set title 'I\'ll be there for you'" /sökväg/till/katalog</userinput>

source: Set album cover in all files of a folder using the batch import function:
it: Impostare la copertina dell'album in tutti i file di una cartella utilizzando la funzione di importazione in serie:
ru: Установить обложку альбома во всех файлах каталога с помощью функции пакетного импорта:
sv: Tilldela albumomslag till alla filer i en katalog med användning av bakgrundsimportfunktionen:

source: <userinput>kid3-cli -c "autoimport 'Cover Art'" /path/to/folder</userinput>
it: <userinput>kid3-cli -c "autoimport 'Cover Art'" /percorso/a/cartella</userinput>
ru: <userinput>kid3-cli -c "autoimport 'Cover Art'" /путь/к/каталогу</userinput>
sv: <userinput>kid3-cli -c "autoimport 'Cover Art'" /sökväg/till/katalog</userinput>

source: Remove comment frames and apply the tag format in both tags of all MP3 files of a folder:
it: Rimuovere i frame dei commenti e applicare il formato dei tag in entrambi i tag di tutti i file MP3 di una cartella:
ru: Удалить фреймы комментариев и применить формат тега в обоих тегах всех MP3-файлов каталога:
sv: Ta bort kommentarramar och tilldela taggformatet i båda taggar av alla MP3-filer i en katalog:

source: <userinput>kid3-cli -c "set comment '' 1" -c "set comment '' 2" \ -c "tagformat 1" -c "tagformat 2" /path/to/folder/*.mp3</userinput>
it: <userinput>kid3-cli -c "set comment '' 1" -c "set comment '' 2" \ -c "tagformat 1" -c "tagformat 2" /percorso/a/cartella/*.mp3</userinput>
ru: <userinput>kid3-cli -c "set comment '' 1" -c "set comment '' 2" \ -c "tagformat 1" -c "tagformat 2" /путь/к/каталогу/*.mp3</userinput>
sv: <userinput>kid3-cli -c "set comment '' 1" -c "set comment '' 2" \ -c "tagformat 1" -c "tagformat 2" /sökväg/till/katalog/*.mp3</userinput>

source: Automatically import tag 2, synchronize to tag 1, set file names from tag 2 and finally create a playlist:
it: Importare automaticamente tag 2, sincronizzare con tag 1, impostare i nomi dei file da tag 2 e alla fine creare una scaletta:
ru: Автоматически импортировать тег 2, синхронизировать с тегом 1, установить имена файлов из тега 2 и создать список воспроизведения:
sv: Importera automatiskt tagg 2, synkronisera med tagg 1, ställ in filnamn från tagg 2 och skapa slutligen en spellista:

source: <userinput>kid3-cli -c autoimport -c "syncto 1" -c fromtag -c playlist \ /path/to/folder/*.mp3</userinput>
it: <userinput>kid3-cli -c autoimport -c "syncto 1" -c fromtag -c playlist \ /percorso/a/cartella/*.mp3</userinput>
ru: <userinput>kid3-cli -c autoimport -c "syncto 1" -c fromtag -c playlist \ /путь/к/каталогу/*.mp3</userinput>
sv: <userinput>kid3-cli -c autoimport -c "syncto 1" -c fromtag -c playlist \ /sökväg/till/katalog/*.mp3</userinput>

source: For all files with an ID3v2.4.0 tag, convert to ID3v2.3.0 and remove the arranger frame:
it: Per tutti i file con un tag ID3v2.4.0, convertire in ID3v2.3.0 e rimuovere il frame dell'arrangiatore:
ru: Выполнить для всех файлов с тегом ID3v2.4.0 преобразование в тег ID3v2.3.0 и удалить фрейм аранжировщика:
sv: För alla filer med en ID3v24.0-tagg, konvertera till ID3v2.3.0 och ta bort ramen arranger:

source: <userinput>kid3-cli -c "filter 'ID3v2.4.0 Tag'" -c "select all" -c to23 \ -c "set arranger ''" /path/to/folder</userinput>
it: <userinput>kid3-cli -c "filter 'ID3v2.4.0 Tag'" -c "select all" -c to23 \ -c "set arranger ''" /percorso/a/cartella</userinput>
ru: <userinput>kid3-cli -c "filter 'ID3v2.4.0 Tag'" -c "select all" -c to23 \ -c "set arranger ''" /путь/к/каталогу</userinput>
sv: <userinput>kid3-cli -c "filter 'ID3v2.4.0 Tag'" -c "select all" -c to23 \ -c "set arranger ''" /sökväg/till/katalog</userinput>

source: This Python script uses <command>kid3-cli</command> to generate iTunes Sound Check iTunNORM frames from replay gain information.
it: Questo script Python utilizza <command>kid3-cli</command> per generare frame iTunes Sound Check iTunNORM dalle informazioni di guadagno di riproduzione.
ru: В этом сценарии Python <command>kid3-cli</command> используется для создания фреймов iTunNORM проверки звука iTunes на основе данных о выравнивании громкости.
sv: Python-skriptet använder <command>kid3-cli</command> för att generera iTunes Sound Check iTunNORM ramar från information om uppspelningsförstärkning.

source: <![CDATA[ #!/usr/bin/env python3 # Generate iTunes Sound Check from ReplayGain. import os, sys, subprocess def rg2sc(dirpath): for root, dirs, files in os.walk(dirpath): for name in files: if name.endswith(('.mp3', '.m4a', '.aiff', '.aif')): fn = os.path.join(root, name) rg = subprocess.check_output([ 'kid3-cli', '-c', 'get "replaygain_track_gain"', fn]).strip() if rg.endswith(b' dB'): rg = rg[:-3] try: rg = float(rg) except ValueError: print('Value %s of %s in not a float' % (rg, fn)) continue sc = (' ' + ('%08X' % int((10 ** (-rg / 10)) * 1000) )) * 10 subprocess.call([ 'kid3-cli', '-c', 'set iTunNORM "%s"' % sc, fn]) if __name__ == '__main__': rg2sc(sys.argv[1]) ]]>
it: <![CDATA[ #!/usr/bin/env python3 # Genera iTunes Sound Check dal guadagno di riproduzione. import os, sys, subprocess def rg2sc(dirpath): for root, dirs, files in os.walk(dirpath): for name in files: if name.endswith(('.mp3', '.m4a', '.aiff', '.aif')): fn = os.path.join(root, name) rg = subprocess.check_output([ 'kid3-cli', '-c', 'get "replaygain_track_gain"', fn]).strip() if rg.endswith(b' dB'): rg = rg[:-3] try: rg = float(rg) except ValueError: print('Value %s of %s in not a float' % (rg, fn)) continue sc = (' ' + ('%08X' % int((10 ** (-rg / 10)) * 1000) )) * 10 subprocess.call([ 'kid3-cli', '-c', 'set iTunNORM "%s"' % sc, fn]) if __name__ == '__main__': rg2sc(sys.argv[1]) ]]>

source: &JSON; Format
it: Formato &JSON;
ru: Формат &JSON;

source: In order to make it easier to parse results from <command>kid3-cli</command>, it is possible to get the output in &JSON; format. When the request is in &JSON; format, the response will also be &JSON;. A compact format of the request will also give a compact representation of the response. If the request contains an "id" field, it is assumed to be a &JSON;-RPC request and the response will contain a "jsonrpc" field and the "id" of the request. The request format uses the same commands as the standard CLI, the "method" field contains the command and the parameters (if any) are given in the "params" list. The response contains a "result" object, which can also be null if the corresponding <command>kid3-cli</command> command does not return a result. In case of an error, an "error" object is returned with "code" and "message" fields as used in &JSON;-RPC.
it: Per facilitare l'analisi dei risultati da <command>kid3-cli</command>, è possibile ottenere l'output in formato &JSON;. Quando la richiesta è in formato &JSON;, la risposta sarà anche &JSON;. Un formato compatto della richiesta fornirà anche una rappresentazione compatta della risposta. Se la richiesta contiene un campo «id», si presume che sia una richiesta &JSON;-RPC e la risposta conterrà un campo «jsonrpc» e «id» della richiesta. Il formato della richiesta utilizza gli stessi comandi della CLI standard, il campo «method» contiene il comando e i parametri (se presenti) sono indicati nell'elenco «params». La risposta contiene un oggetto «result», che può anche essere nullo se il comando <command>kid3-cli</command> non restituisce un risultato. In caso di errore, viene restituito un oggetto «error» con i campi «code» e «message» come usato in &JSON;-RPC.
ru: Чтобы упростить обработку результатов работы <command>kid3-cli</command>, рекомендуется получать вывод в формате &JSON;. При запросе в формате &JSON; ответ также будет сформирован в &JSON;, при этом компактный формат запроса предоставит компактный ответ. Если в запросе содержится поле «id», он будет считаться запросом &JSON;-RPC, и в ответе будет содержаться поле «jsonrpc» и значение «id» запроса. В формате запроса используются те же команды, что и в стандартном интерфейсе командной строки, поле «method» должно содержать команду, а параметры (если есть) будут заданы списком «params». Ответ содержит объект «result», который может быть пустым, если соответствующая команда <command>kid3-cli</command> не вернула никакого результата. Если произойдёт ошибка, будет возвращён объект «error» с полями «code» и «message», что стандартно для запросов &JSON;-RPC.
sv: För att göra det enklare att tolka resultat från <command>kid3-cli</command> är det möjligt att få utmatningen på &JSON;-format. När begäran använder &JSON;-format blir också svaret &JSON;. Ett kompakt format på begäran ger också kompakt representation av svaret. Om begäran innehåller ett "id"-fält antas det bara en &JSON;-RPC-begäran och svaret innehåller fältet "jsonrpc" och "id" för begäran. Formatet på en begäran använder samma kommando som det vanliga kommandoradsgränssnittet, fältet "method" innehåller kommandot och parametrarna (om det finns några) anges i listan "params". Svaret innehåller objektet "result", som också kan vara null om motsvarande <command>kid3-cli</command> kommando inte returnerar ett resultat. I händelse av fel, returneras objektet "error" med fälten "code" och "message" som används av &JSON;-RPC.

source: <prompt>kid3-cli&gt; </prompt><userinput>{"method":"set","params":["artist","An Artist"]}</userinput> <computeroutput>{"result":null}</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>{"method":"get","params":["artist",2]}</userinput> <computeroutput>{"result":"An Artist"}</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>{"method": "get", "params": ["artist"]}</userinput> <computeroutput>{ "result": "An Artist" } </computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>{"jsonrpc":"2.0","id":"123","method":"get","params":["artist"]}</userinput> <computeroutput>{"id":"123","jsonrpc":"2.0","result":"An Artist"}</computeroutput>
it: <prompt>kid3-cli&gt; </prompt><userinput>{"method":"set","params":["artist","Un artista"]}</userinput> <computeroutput>{"result":null}</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>{"method":"get","params":["artist",2]}</userinput> <computeroutput>{"result":"An Artist"}</computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>{"method": "get", "params": ["artist"]}</userinput> <computeroutput>{ "result": "Un artista" } </computeroutput> <prompt>kid3-cli&gt; </prompt><userinput>{"jsonrpc":"2.0","id":"123","method":"get","params":["artist"]}</userinput> <computeroutput>{"id":"123","jsonrpc":"2.0","result":"Un artista"}</computeroutput>
