Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: Tag specific options can be found on the <guilabel>Tags</guilabel> page, which is itself separated into four tabs for <guilabel>Tag 1</guilabel>, <guilabel>Tag 2</guilabel>, <guilabel>Tag 3</guilabel>, and <guilabel>All Tags</guilabel>.
it: Le opzioni specifiche dei tag sono disponibili nella pagina <guilabel>Tag</guilabel>, che è essa stessa suddivisa in quattro schede per <guilabel>Tag 1</guilabel>, <guilabel>Tag 2</guilabel>, <guilabel>Tag 3</guilabel> e <guilabel>Tutti i tag</guilabel>.
ru: Параметры тегов доступны в разделе <guilabel>Теги</guilabel>, который разделён на четыре вкладки: <guilabel>Тег 1</guilabel>, <guilabel>Тег 2</guilabel>, <guilabel>Тег 3</guilabel> и <guilabel>Все теги</guilabel>.
sv: Taggspecifika alternativ finns på sidan <guilabel>Taggar</guilabel>, som i sig är uppdelad i fyra flikar för <guilabel>Tagg 1</guilabel>, <guilabel>Tagg 2</guilabel>, <guilabel>Tagg 3</guilabel> och <guilabel>Alla taggar</guilabel>.

source: If <guilabel>Mark truncated fields</guilabel> is checked, truncated ID3v1.1 fields will be marked red. The text fields of ID3v1.1 tags can only have 30 characters, the comment only 28 characters. Also the genre and track numbers are restricted, so that fields can be truncated when imported or transferred from ID3v2. Truncated fields and the file will be marked red, and the mark will be removed after the field has been edited.
it: Se <guilabel>Evidenzia i campi troncati</guilabel> è selezionata, i campi troncati ID3v1.1 saranno marcati in rosso. I campi di testo dei tag ID3v1.1 possono contenere solo 30 caratteri, il commento solo 28 caratteri. Anche i numeri di genere e traccia sono limitati, in modo che i campi possano essere troncati quando importati o trasferiti da ID3v2. I campi troncati e il file saranno marcati in rosso e il segno sarà rimosso dopo la modifica del campo.
ru: Если установлен флажок <guilabel>Отмечать усечённые поля</guilabel>, усечённые поля ID3v1.1 будут отмечены красным цветом. Текстовые поля тегов ID3v1.1 могут иметь не более 30 символов, а комментарии — не более 28. Также ограничено количество символов в полях жанра и нумерации дорожек, поэтому поля могут быть усечены при импорте или преобразовании из ID3v2. Усечённые поля и сам файл будут отмечены красным цветом. После редактирования поля такое выделение цветом будет снято.
sv: Om <guilabel>Markera avkortade fält</guilabel> är aktiverat, markeras avkortade ID3v1.1 fält med rött. Textfälten i ID3v1.1 taggar kan bara ha 30 tecken, och kommentaren bara 28 tecken. Dessutom är genre- och spårnumren begränsade, så att fälten kan avkortas när de importeras eller överförs från ID3v2. Avkortade fält och filen markeras med rött, och markeringen tas bort efter fältet har redigerats.

source: With <guilabel>Text encoding</guilabel> for <guilabel>ID3v1</guilabel> it is possible to set the character set used in ID3v1 tags. This encoding is supposed to be ISO-8859-1, so it is recommended to keep this default value. However, there are tags around with different encoding, so it can be set here and the ID3v1 tags can then be copied to ID3v2 which supports Unicode.
it: Con <guilabel>Codifica del testo</guilabel> per <guilabel>ID3v1</guilabel> è possibile impostare l'insieme di caratteri utilizzato nei tag ID3v1. Questa codifica dovrebbe essere ISO-8859-1, quindi si consiglia di mantenere questo valore predefinito. Tuttavia, ci sono tag in giro con codifica diversa, quindi può essere impostato qui e i tag ID3v1 possono essere copiati in ID3v2 che supporta Unicode.
ru: Параметр <guilabel>Кодировка текста</guilabel> для тегов <guilabel>ID3v1</guilabel> позволяет установить набор символов, используемый в тегах ID3v1. Стандартной кодировкой является ISO-8859-1, поэтому рекомендуется не менять это значение. Однако существуют теги с другой кодировкой; такую кодировку возможно указать с помощью этого параметра, чтобы затем скопировать теги ID3v1 в ID3v2, где предусмотрена поддержка Unicode.
sv: Med <guilabel>Textkodning</guilabel> för <guilabel>ID3v1</guilabel> är det möjligt att ange teckenuppsättningen som används i ID3v1 taggar. Kodningen förväntas vara ISO-8859-1, så det rekommenderas att behålla detta förvalda värde. Dock finns det en del taggar med annorlunda kodning, så den kan ställas in här och ID3v1 taggarna kan sedan kopieras till ID3v2, som stöder Unicode.

source: The check box <guilabel>Use track/total number of tracks format</guilabel> controls whether the track number field of ID3v2 tags contains simply the track number or additionally the total number of tracks in the folder.
it: La casella di selezione <guilabel>Utilizza il formato traccia/numero totale delle tracce</guilabel> controlla se il campo del numero di traccia dei tag ID3v2 contiene semplicemente il numero di traccia o in aggiunta il numero totale di tracce nella cartella.
ru: Флажок <guilabel>Использовать формат «номер дорожки / всего дорожек»</guilabel> определяет, будет ли поле номера дорожки тегов ID3v2 содержать просто номер дорожки или также и общее количество дорожек в каталоге.
sv: Kryssrutan <guilabel>Använd formatet spår/totalt antal spår</guilabel> bestämmer om spårnummerfältet i ID3v2 taggar helt enkelt innehåller spårnumret eller dessutom det totala antalet spår i katalogen.

source: When <guilabel>Genre as text instead of numeric string</guilabel> is checked, all ID3v2 genres will be stored as a text string even if there is a corresponding code for ID3v1 genres. If this option is not set, genres for which an ID3v1 code exists are stored as the number of the genre code (in parentheses for ID3v2.3). Thus the genre Metal is stored as "Metal" or "(9)" depending on this option. Genres which are not in the list of ID3v1 genres are always stored as a text string. The purpose of this option is improved compatibility with devices which do not correctly interpret genre codes.
it: Quando si seleziona <guilabel>Genere come testo anziché stringa numerica</guilabel>, tutti i generi ID3v2 saranno archiviati come stringa di testo anche se esiste un codice corrispondente per i generi ID3v1. Se questa opzione non è impostata, i generi per i quali esiste un codice ID3v1 vengono memorizzati come numero del codice del genere (tra parentesi per ID3v2.3). Pertanto, il genere Metal viene memorizzato come «Metal» o «(9)» a seconda di questa opzione. I generi che non sono nell'elenco dei generi ID3v1 sono sempre memorizzati come stringa di testo. Lo scopo di questa opzione è una migliore compatibilità con i dispositivi che non interpretano correttamente i codici di genere.
ru: Если установлен флажок <guilabel>Жанр как текст (вместо числовой строки)</guilabel>, все жанры в тегах ID3v2 будут сохранены в виде текстовой строки, даже если существует соответствующий код для жанров в тегах ID3v1. Если этот флажок снят, жанры, для которых существует код в тегах ID3v1, будут сохранены в формате числа — кода жанра (в скобках для тега ID3v2.3). Таким образом, жанр Metal будет сохранён как «Metal» или «(9)» в зависимости от значения этого параметра. Жанры, которых нет в списке жанров в тегах ID3v1, всегда сохраняются в виде текстовой строки. Цель этой опции — улучшить совместимость с устройствами, которые неправильно интерпретируют коды жанров.
sv: När <guilabel>Genre som text istället för numerisk sträng</guilabel> är markerad, lagras alla ID3v2 genrer som textsträngar även om det finns en motsvarande kod för ID3v1 genrer. Om alternativet inte är valt, lagras genrer för vilka det finns en ID3v1 kod lagras som den genrekodens nummer (inom parentes för ID3v2.3). Sålunda lagras genren Metal som "Metal" eller "(9)" beroende på alternativet. Genrer som inte finns i listan över ID3v1 genrer lagras alltid som en textsträng. Syftet med alternativet är förbättrad kompatibilitet med enheter som inte tolkar genrekoder korrekt.

source: When <guilabel>WAV files with lowercase id3 chunk</guilabel> is checked, the RIFF chunk used to store ID3v2 tags in WAV files will be named "id3 " instead of "ID3 ". By default, &kid3; and other applications using TagLib accept both the lowercase and the uppercase variant when reading WAV files, but they use "ID3 " when writing ID3v2 tags to WAV files. As there exist other applications which only accept "id3 " (<abbrev>e.g.</abbrev> JRiver Media Center and foobar2000), this option can be used to create tags which can be read by such applications.
it: Quando si seleziona <guilabel>File WAV con blocco ID3 minuscolo</guilabel>, il blocco RIFF utilizzato per archiviare i tag ID3v2 nei file WAV sarà chiamato «id3» anziché «ID3». Per impostazione predefinita, &kid3; e altre applicazioni che utilizzano TagLib accettano sia la variante minuscola sia quella maiuscola durante la lettura di file WAV, ma utilizzano «ID3» quando scrivono tag ID3v2 su file WAV. Poiché esistono altre applicazioni che accettano solo «id3» (<abbrev>ad es.</abbrev> JRiver Media Center e foobar2000), questa opzione può essere utilizzata per creare tag che possono essere letti da tali applicazioni.
ru: Если установлен флажок <guilabel>Файлы WAV с блоком id3 в нижнем регистре</guilabel>, блок RIFF, используемый для хранения тегов ID3v2 в файлах WAV, будет называться «id3» вместо «ID3». По умолчанию &kid3; и другие приложения, использующие TagLib, принимают как строчные, так и прописные варианты при чтении файлов WAV, но при записи тегов ID3v2 в файлы WAV они используют вариант «ID3». Поскольку существуют другие приложения, которые принимают только вариант «id3» (например, JRiver Media Center и foobar2000), эта опция позволяет создавать теги, которые могут быть прочитаны такими приложениями.
sv: När <guilabel>WAV-filer med id3-stycke med små bokstäver</guilabel> är markerad, används RIFF-stycket användes för att lagra ID3v2-taggar i WAV-filer med namnet "id3" istället för "ID3". Normalt &kid3; och andra program som använder TagLib accepterar både varianter med små och stora bokstäver när WAV-filer läses, men de använder "ID3" när ID3v2 taggar skrivs till WAV-filer. Eftersom det finns andra program som bara accepterar "Id3" (<abbrev>t.ex.</abbrev> JRiver Media Center och foobar2000), kan alternativet användas för att skapa taggar som kan läsas av sådana program.

source: When <guilabel>Mark standard violations</guilabel> is checked, ID3v2 fields which violate the standard will be marked red. Details about the violation are shown in a tooltip:
it: Quando si seleziona <guilabel>Evidenzia le violazioni dello standard</guilabel>, i campi ID3v2 che violano lo standard saranno marcati in rosso. I dettagli sulla violazione sono mostrati in una descrizione:
ru: Если установлен флажок <guilabel>Отмечать нарушения стандарта</guilabel>, поля тегов ID3v2, нарушающие стандарт, будут отмечены красным. Подробная информация о нарушении отображается во всплывающей подсказке:
sv: När <guilabel>Markera avvikelser från standard</guilabel> är markerad, är ID3v2-fält som avviker från standarden markerade med rött. Detaljinformation om avvikelsen visas i ett verktygstips:

source: Must be unique
it: Deve essere unico
ru: Должно быть уникальным
sv: Måste vara unik

source: New line is forbidden
it: Una nuova riga non è consentita
ru: Перевод строки запрещён
sv: Nyrad otillåten

source: Carriage return is forbidden
it: Il ritorno a capo non è consentito
ru: Возврат каретки запрещён
sv: Returtecken otillåtet

source: Owner must be non-empty
it: Il proprietario non può essere vuoto
ru: Необходимо ввести сведения о владельце
sv: Ägare måste vara icke-tom

source: Must be numeric
it: Deve essere numerico
ru: Должно быть в числовом формате
sv: Måste vara numerisk

source: Must be numeric or number/total
it: Deve essere numerico o numero/totale
ru: Должно быть в числовом формате или формате «номер / общее количество»
sv: Måste vara numerisk eller nummer/totalantal

source: Format is DDMM
it: Il formato è GGMM
ru: Формат — ДДММ
sv: Format är DDMM

source: Format is HHMM
it: Il formato è HHMM
ru: Формат — ЧЧММ
sv: Format är TTMM

source: Format is YYYY
it: Il formato è AAAA
ru: Формат — ГГГГ
sv: Format är ÅÅÅÅ

source: Must begin with a year and a space character
it: Deve iniziare con un anno e un carattere di spaziatura
ru: Должно начинаться с года и пробела
sv: Måste börja med ett år och ett mellanslag

source: Must be ISO 8601 date/time
it: Deve essere una data/ora ISO 8601
ru: Формат даты и времени должен соответствовать стандарту ISO 8601
sv: Måste vara ISO 8601 datum eller tid

source: Must be musical key, 3 characters, A-G, b, #, m, o
it: Deve essere una chiave musicale, 3 caratteri, A-G, b, #, m, o
ru: Должно быть музыкальным ключом, 3 символа, A-G, b, #, m, o,
sv: Måste vara en tonart, tre tecken, A-G, b, #, m, o

source: Must have ISO 639-2 language code, 3 lowercase characters
it: Deve avere un codice di lingua ISO 639-2, 3 caratteri minuscoli
ru: Код языка должен соответствовать стандарту ISO 639-2, 3 символа в нижнем регистре
sv: Måste ha ISO 639-2 språkkod, tre små bokstäver

source: Must be ISRC code, 12 characters
it: Deve essere un codice ISRC, 12 caratteri
ru: Должно быть кодом ISRC, 12 символов
sv: Måste vara ISRC-kod, 12 tecken

source: Must be list of strings separated by '|'
it: Deve essere un elenco di stringhe separate da «|»
ru: Должно быть списком строк, разделённых «|»
sv: Måste vara lista av strängar åtskilda av '|'

source: Has excess white space
it: Ha uno spazio in eccesso
ru: Имеется лишний пробел
sv: Har överflödiga blanktecken

source: The ID3 standard documents are available online:
it: I documenti degli standard ID3 sono disponibili in linea:
ru: Документы по стандартам ID3, доступные в сети:
sv: ID3-standarddokumenten är tillgängliga på nätet:

source: ID3 tag version 2.3.0
it: Tag ID3 versione 2.3.0
ru: тег ID3 версии 2.3.0
sv: ID3-tagg version 2.3.0

source: ID3 tag version 2.4.0 - Main Structure
it: Tag ID3 versione 2.4.0 - Struttura principale
ru: Тег ID3 версии 2.4.0 — основная структура
sv: ID3-tagg version 2.4.0 - Huvudstruktur

source: ID3 tag version 2.4.0 - Native Frames
it: Tag ID3 versione 2.4.0 - Frame nativi
ru: Тег ID3 версии 2.4.0 — нативные фреймы
sv: ID3-tagg version 2.4.0 - Inbyggda ramar

source: <guilabel>Text encoding</guilabel> defines the default encoding used for ID3v2 frames and can be set to <guilabel>ISO-8859-1</guilabel>, <guilabel>UTF16</guilabel>, or <guilabel>UTF8</guilabel>. <guilabel>UTF8</guilabel> is not valid for ID3v2.3.0 frames; if it is set, <guilabel>UTF16</guilabel> will be used instead. For ID3v2.4.0 frames, all three encodings are possible.
it: <guilabel>Codifica del testo</guilabel> definisce la codifica predefinita utilizzata per i frame ID3v2 e può essere impostata su <guilabel>ISO-8859-1</guilabel>, <guilabel>UTF16</guilabel> o <guilabel>UTF8</guilabel>. <guilabel>UTF8</guilabel> non è valido per i frame ID3v2.3.0; se impostato, sarà utilizzato <guilabel>UTF16</guilabel>. Per i frame ID3v2.4.0, sono possibili tutte e tre le codifiche.
ru: <guilabel>Кодировка текста</guilabel> определяет кодировку по умолчанию для фреймов ID3v2: <guilabel>ISO-8859-1</guilabel>, <guilabel>UTF16</guilabel> или <guilabel>UTF8</guilabel>. <guilabel>UTF8</guilabel> не поддерживается фреймами ID3v2.3.0; если указана эта кодировка, вместо неё будет использоваться кодировка <guilabel>UTF16</guilabel>. Для фреймов ID3v2.4.0 возможно использовать все три типа кодировки.
sv: <guilabel>Textkodning</guilabel> definierar standardkodningen använd för ID3v2 ramar och kan ställas in till <guilabel>ISO-8859-1</guilabel>, <guilabel>UTF16</guilabel> eller <guilabel>UTF8</guilabel>. <guilabel>UTF8</guilabel> är inte giltigt för ID3v2.3.0 ramar: om det är inställt, används <guilabel>UTF16</guilabel> istället. För ID3v2.4.0 är alla tre kodningarna möjliga.

source: <guilabel>Version used for new tags</guilabel> determines whether new ID3v2 tags are created as version 2.3.0 or 2.4.0.
it: <guilabel>Versione usata per i nuovi tag</guilabel> determina se i nuovi tag ID3v2 sono creati come versione 2.3.0 o 2.4.0.
ru: <guilabel>Версия, используемая для новых тегов</guilabel> позволяет указать, в какой версии должны создаваться новые теги ID3v2: 2.3.0 или 2.4.0.
sv: <guilabel>Version använd för nya taggar</guilabel> bestämmer om nya ID3v2 taggar skapas som version 2.3.0 eller 2.4.0.

source: <guilabel>Track number digits</guilabel> is the number of digits in Track Number fields. Leading zeros are used to pad. For instance, with a value of 2 the track number 5 is set as "05".
it: <guilabel> Cifre del numero di traccia</guilabel> è il numero di cifre nei campi Numero traccia. Gli zeri iniziali sono utilizzati per la spaziatura. Ad esempio, con un valore di 2 il numero di traccia 5 è impostato come «05».
ru: <guilabel>Количество цифр в номере дорожки</guilabel> — это количество цифр в полях «Номер дорожки». Для заполнения используются нули в начале. Например, при значении 2 номер дорожки 5 устанавливается как «05».
sv: <guilabel>Spårnummersiffror</guilabel> är antal siffror i spårnummerfält. Inledande nollor används för att fylla ut. Exempelvis med värdet 2 anges spårnummer 5 som "05".

source: The combo box <guilabel>Comment field name</guilabel> is only relevant for Ogg/Vorbis and FLAC files and sets the name of the field used for comments. Different applications seem to use different names, "<literal>COMMENT</literal>" for instance is used by <application>XMMS</application>, whereas &amarok; uses "<literal>DESCRIPTION</literal>".
it: La casella combinata <guilabel>Nome campo commento</guilabel> è rilevante solo per i file Ogg/Vorbis e FLAC e imposta il nome del campo utilizzato per i commenti. Applicazioni diverse sembrano usare nomi diversi, «<literal>COMMENT</literal>» ad esempio è utilizzato da <application>XMMS</application>, mentre &amarok; utilizza «<literal>DESCRIPTION</literal>».
ru: Раскрывающийся список <guilabel>Имя поля комментария</guilabel> предназначен только для файлов Ogg/Vorbis и FLAC и задаёт имя поля, используемого для комментариев. Разные приложения используют разные названия, например, «<literal>COMMENT</literal>» используется приложением <application>XMMS</application>, а &amarok; использует название «<literal>DESCRIPTION</literal>».
sv: Kombinationsrutan <guilabel>Kommentarfältnamn</guilabel> är bara relevant för Ogg/Vorbis- och FLAC-filer och anger namnet på fältet används för kommentarer. Olika program verkar använda olika namn, "<literal>KOMMENTAR</literal>" används exempelvis för <application>XMMS</application>, medan &amarok; använder "<literal>BESKRIVNING</literal>".

source: The format of pictures in Ogg/Vorbis files is determined by <guilabel>Picture field name</guilabel>, which can be "<literal>METADATA_BLOCK_PICTURE</literal>" or "<literal>COVERART</literal>". The first is the official standard and uses the same format as pictures in FLAC tags. "<literal>COVERART</literal>" is an earlier unofficial way to include pictures in Vorbis comments. It can be used for compatibility with legacy players.
it: Il formato delle immagini nei file Ogg/Vorbis è determinato da <guilabel>Nome campo immagine</guilabel>, che può essere «<literal>METADATA_BLOCK_PICTURE</literal>» o «<literal>COVERART</literal>». Il primo è lo standard ufficiale e utilizza lo stesso formato delle immagini nei tag FLAC. «<literal>COVERART</literal>» è un modo non ufficiale precedente di includere immagini nei commenti di Vorbis. Può essere utilizzato per la compatibilità con lettori datati.
ru: Формат изображений в файлах Ogg/Vorbis указывается в раскрывающемся списке <guilabel>Имя поля изображения</guilabel>, значениями которого могут быть «<literal>METADATA_BLOCK_PICTURE</literal>» или «<literal>COVERART</literal>». Первое значение — это официальный стандарт, использующий тот же формат, что и изображения в тегах FLAC. «<literal>COVERART</literal>» — это более ранний неофициальный способ включения изображений в комментарии Vorbis. Он позволяет обеспечивать совместимость с устаревшими проигрывателями.
sv: Bildernas format i Ogg/Vorbis-filer bestäms av <guilabel>Bildfältnamn</guilabel>, som kan vara "<literal>METADATA_BLOCK_PICTURE</literal>" eller "<literal>COVERART</literal>". Den första är officiell standard och använder samma format i FLAC-taggar. "<literal>COVERART</literal>" är en tidigare inofficiellt sätt för att inkludera bilder i Vorbis-kommentarer. Det kan användas för kompatibilitet med tidigare spelare.

source: If the <guilabel>Mark if larger than (bytes)</guilabel> check box is activated, files containing embedded album cover art exceeding the given size in bytes are marked red. This can be used to find files containing oversized pictures which are not accepted by some applications and players. The default value is 131072 bytes (128 KB).
it: Se la casella di selezione <guilabel>Se più grande di (byte)</guilabel> è attivata, i file contenenti copertine degli album incorporate che superano la dimensione data in byte sono marcati in rosso. Questo può essere usato per trovare file contenenti immagini di grandi dimensioni che non sono accettate da alcune applicazioni e lettori. Il valore predefinito è 131072 byte (128 KB).
ru: Если установлен флажок <guilabel>Отмечать, если размер больше, чем (в байтах)</guilabel>, файлы, содержащие встроенную обложку, размер которых превышает указанное значение в байтах, будут отмечены красным. Эта функция позволяет найти файлы, содержащие слишком большие изображения, которые могут не поддерживаться некоторыми приложениями или проигрывателями. Значение по умолчанию — 131072 байта (128 КБ).
sv: Om kryssrutan <guilabel>Markera om större än (byte)</guilabel> är aktiverad, markeras filer som innehåller inbäddade albumomslag som överskrider given storlek i byte. Det kan användas för att hitta filer som innehåller alltför stora bilder som inte accepteras av vissa program och spelare. Standardvärdet är 131072 byte (128 KB).

source: <guilabel>Custom Genres</guilabel> can be used to define genres which are not available in the standard genre list, <abbrev>e.g.</abbrev> "Gothic Metal". Such custom genres will appear in the <guilabel>Genre</guilabel> combo box of <guilabel>Tag 2</guilabel>. For ID3v1.1 tags, only the predefined genres can be used.
it: <guilabel>Generi personalizzati</guilabel> può essere utilizzato per definire i generi che non sono disponibili nell'elenco dei generi standard, <abbrev>ad es.</abbrev> «Gothic Metal». Tali generi personalizzati appariranno nella casella combinata <guilabel>Genere</guilabel> di <guilabel>Tag 2</guilabel>. Per i tag ID3v1.1, è possibile utilizzare solo i generi predefiniti.
ru: Раздел <guilabel>Пользовательские жанры</guilabel> позволяет указывать жанры, отсутствующие в стандартном списке жанров, например, «Gothic Metal». Такие пользовательские жанры появятся в раскрывающемся списке <guilabel>Жанр</guilabel> в разделе <guilabel>Тег 2</guilabel>. В тегах ID3v1.1 возможно указывать только предустановленные жанры.
sv: <guilabel>Egna genrer</guilabel> kan användas för att definiera genrer som inte är tillgängliga i standardlistan över genren, <abbrev>t.ex.</abbrev> "Gothic Metal". Sådana egna genrer dyker upp i kombinationsrutan <guilabel>Genre</guilabel> för <guilabel>Tagg 2</guilabel>. För ID3v1.1, kan bara fördefinierade genrer.
