Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: For information synchronized with the audio data, a specific editor is available. These frames are supported for ID3v2.3.0 and ID3v2.4.0 tags. To add such a frame, the specific frame name has to be selected in the list which appears when the <guibutton>Add</guibutton> button is clicked - <guilabel>Synchronized Lyrics</guilabel> or <guilabel>Event Timing Codes</guilabel>, respectively. The editor is the same for both types, for the event timing codes, only a predefined set of events is available whereas for the synchronized lyrics, text has to be entered. In the following, editing synchronized lyrics is explained.
it: Per sincronizzare le informazioni con i dati audio, è disponibile un editor specifico. Questi frame sono supportati per i tag ID3v2.3.0 e ID3v2.4.0. Per aggiungere un frame del genere, il nome specifico del frame deve essere selezionato nell'elenco che appare quando si fa clic sul pulsante <guibutton>Aggiungi</guibutton> - <guilabel>Testi sincronizzati</guilabel> o <guilabel>Codici di temporizzazione evento</guilabel>, rispettivamente. L'editor è lo stesso per entrambi i tipi, per i codici di temporizzazione degli eventi è disponibile solo un insieme predefinito di eventi mentre per i testi sincronizzati è necessario inserire del testo. Di seguito, viene spiegata la modifica dei testi sincronizzati.
ru: Для изменения информации, синхронизирующейся с аудиоданными, предусмотрен специальный редактор. Эти фреймы поддерживаются в тегах ID3v2.3.0 и ID3v2.4.0. Чтобы добавить такой фрейм, выберите его название из списка, который появляется после нажатия кнопки <guibutton>Добавить</guibutton> — <guilabel>Синхронизированный текст</guilabel> или <guilabel>Коды привязки ко времени событий</guilabel>, соответственно. Для обоих типов используется один и тот же редактор, однако для кодов привязки ко времени событий предусмотрен только предварительно определённый набор событий, а для синхронизированного текста песни придётся ввести сам текст. Далее рассматривается пример редактирования синхронизированного текста песни.
sv: För information synkroniserad med ljuddata är en särskild editor tillgänglig. Sådana ramar stöds för ID3v2.3.0- och ID3v2.4.0-taggar. För att lägga till en sådan ram, måste det specifika ramnamnet väljas i listan som dyker upp när knappen <guibutton>Lägg till</guibutton> klickas: respektive <guilabel>Synkroniserad sångtext</guilabel> eller <guilabel>Händelsetidskoder</guilabel>. Editorn är samma för båda typerna, men för händelsetidskoderna är bara en fördefinierad uppsättning händelser tillgängliga, medan för de synkroniserade sångtexterna måste text matas in. I det följande förklaras synkroniserad sångtext.

source: A file having an ID3v2 tag is selected, the lyrics editor is entered using <guibutton>Add</guibutton> and selecting <guilabel>Synchronized Lyrics</guilabel>. For an existing Synchronized Lyrics frame, it is selected and <guibutton>Edit</guibutton> is clicked. The player is automatically opened with the current file so that the file can be played and paused to synchronize lyrics.
it: Viene selezionato un file con un tag ID3v2, si accede all'editor dei testi utilizzando <guibutton>Aggiungi</guibutton> e selezionando <guilabel>Testi sincronizzati</guilabel>. Per un frame di testi sincronizzati esistente, viene selezionato e si fa clic su <guibutton>Modifica</guibutton>. Il lettore viene aperto automaticamente con il file attuale in modo che il file possa essere riprodotto e messo in pausa per sincronizzare i testi.
ru: Допустим, выбран файл с тегом ID3v2 и с помощью кнопки <guibutton>Добавить</guibutton> запущен редактор текста с опцией <guilabel>Синхронизированный текст</guilabel>. Если синхронизированный текст уже существует, выберите его и нажмите кнопку <guibutton>Изменить</guibutton>. После этого текущий файл будет автоматически открыт в проигрывателе, что позволит воспроизводить его и синхронизировать текст.
sv: En fil som har en ID3v2-tagg markeras, och sångtexteditorn startas genom att använda <guibutton>Lägg till</guibutton> och välja <guilabel>Synkroniserad sångtext</guilabel>. För en befintlig synkroniserad sångtextram, markeras den och <guibutton>Redigera</guibutton> klickas. Spelaren öppnas automatiskt med aktuell fil så att filen kan spelas och pausas för att synkronisera sångtexten.

source: The settings at the top of the SYLT editor normally do not have to be changed. If the lyrics contains characters which are not present in the Latin 1 character set, changing the text encoding to UTF16 (or UTF8 for ID3v2.4.0) is advisable. For English lyrics and maximum compatibility, ISO-8859-1 should be used.
it: Le impostazioni nella parte superiore dell'editor SYLT normalmente non devono essere modificate. Se il testo contiene caratteri che non sono presenti nell'insieme di caratteri Latin 1, è consigliabile modificare la codifica del testo in UTF16 (o UTF8 per ID3v2.4.0). Per i testi in inglese e la massima compatibilità, utilizzare ISO-8859-1.
ru: Параметры в верхней части окна редактора SYLT, как правило, не требуют внесения изменений. Если текст песни содержит символы, которых нет в наборе символов «Латиница 1», рекомендуется изменить кодировку текста на UTF16 (или UTF8 для ID3v2.4.0). Если текст песни написан на английском языке и требуется сохранить максимальную совместимость, рекомендуется использовать кодировку ISO-8859-1.
sv: Inställningarna längst upp i SYLT-editorn behöver normalt inte ändras. Om sångtexten innehåller tecken som inte finns i teckenuppsättningen Latin 1, är det lämpligt att ändra textkodningen till UTF16 (eller UTF8 för ID3v2.4.0). För engelsk sångtext och maximal kompatibilitet bör ISO-8859-1 användas.

source: The <guilabel>Lyrics</guilabel> section has five buttons at the top. <guibutton>Add</guibutton> will add a new time event in the table. The time is taken from the position of the player, thus adding an entry while playing the track will add a line for the currently played position. The events in the table have to be chronologically ordered, therefore the row will be inserted accordingly. Entries with an invalid time are treated specially: If the currently selected row has an invalid time, its time stamp will be replaced by the current time instead of adding a new row. If the current time is not invalid, the first row with an invalid time will be used if present. This behavior should facilitate adding time stamps if the lyrics text is already in the table but the time stamps are missing (which is the case when importing unsynchronized lyrics). Note that the invalid time is represented as 00:00.00, <abbrev>i.e.</abbrev> the same as the time at the absolute beginning of the track, which is not invalid. To make a time invalid, press the <keycap>Delete</keycap> key, or use <guimenu>Clear</guimenu> from the context menu. New rows inserted using <guimenu>Insert row</guimenu> from the context menu or created when importing unsynchronized lyrics with <guibutton>From Clipboard</guibutton> or <guibutton>Import</guibutton> also contain invalid time stamps. Rows in the table can be deleted by clicking the <guibutton>Delete</guibutton> button or using <guimenu>Delete rows</guimenu> from the context menu.
it: La sezione <guilabel>Testi</guilabel> ha cinque pulsanti in alto. <guibutton>Aggiungi</guibutton> aggiungerà un nuovo evento temporale nella tabella. Il tempo è preso dalla posizione del lettore, quindi l'aggiunta di una voce durante la riproduzione della traccia aggiungerà una linea per la posizione attualmente riprodotta. Gli eventi nella tabella devono essere ordinati cronologicamente, pertanto la riga sarà inserita di conseguenza. Le voci con un orario non valido sono trattate in modo speciale: se la riga attualmente selezionata ha un orario non valido, la marca temporale relativa sarà sostituita dall'ora attuale invece di aggiungere una nuova riga. Se l'ora corrente non è valida, sarà utilizzata la prima riga con un'ora non valida. Questo comportamento dovrebbe facilitare l'aggiunta di marche temporali se il testo è già nella tabella, ma mancano le marche temporali (come nel caso dell'importazione di testi non sincronizzati). Si noti che il tempo non valido è rappresentato come 00:00.00, cioè uguale al tempo all'inizio assoluto della traccia, che non è valido. Per rendere un tempo non valido, premere il tasto <keycap>Elimina</keycap> o utilizzare <guimenu>Cancella</guimenu> dal menu contestuale. Le nuove righe inserite utilizzando <guimenu>Inserisci riga</guimenu> dal menu di scelta rapida o create durante l'importazione di testi non sincronizzati con <guibutton>Dagli appunti</guibutton> o <guibutton>Importa</guibutton> contengono anche marche temporali non valide. Le righe nella tabella possono essere eliminate facendo clic sul pulsante <guibutton>Elimina</guibutton> o utilizzando <guimenu>Elimina righe</guimenu> dal menu di scelta rapida.
ru: Раздел <guilabel>Текст</guilabel> содержит шесть кнопок в верхней части окна. Кнопка <guibutton>Добавить</guibutton> позволяет добавить в таблицу новое временное событие. Значение времени берётся из позиции в проигрывателе, поэтому добавление записи во время воспроизведения дорожки добавит строку для текущей позиции воспроизведения. События в таблице должны располагаться в хронологическом порядке, поэтому строки будут добавляться соответствующим образом. Записи с некорректными метками времени обрабатываются особым образом: если текущая выделенная строка содержит некорректное время, будет выполнена замена этой метки на текущее время, а не добавление новой строки. Если текущее время является корректным, будет использоваться первая строка с некорректным временем, если таковая имеется. Такой принцип работы должен упростить добавление меток времени, если в таблице уже есть текст песни, но отсутствуют метки (так происходит при импорте несинхронизированного текста). Обратите внимание, что некорректное время обозначается как 00:00.00, то есть так же, как и время самого начала дорожки, которое не является некорректным. Чтобы сделать время некорректным, нажмите клавишу <keycap>Delete</keycap> или воспользуйтесь пунктом вызываемого правой кнопкой мыши контекстного меню <guimenu>Очистить</guimenu>. Новые строки, созданные путём вставки с помощью пункта контекстного меню <guimenu>Вставить строку</guimenu> или при импорте несинхронизированного текста с помощью кнопок <guibutton>Из буфера обмена</guibutton> или <guibutton>Импорт...</guibutton>, также содержат некорректные метки времени. Чтобы удалить строки из таблицы, воспользуйтесь кнопкой <guibutton>Удалить</guibutton> или пунктом контекстного меню <guimenu>Удалить строки</guimenu>.
sv: Sektionen <guilabel>Sångtext</guilabel> har fem knappar längst upp. <guibutton>Lägg till</guibutton> lägger till en ny tidshändelse i tabellen. Tiden tas från spelarens position, och att lägga till en post när spåret spelas lägger därmed till en rad för positionen som spelas just nu. Händelserna i tabellen måste vara kronologiskt ordnade, och därför infogas raden i enlighet med det. Poster med en ogiltig tid hanteras speciellt: om raden som för närvarande är markerad har en ogiltig tid, ersätts dess tidstämpel med aktuell tid istället för att lägga till en ny rad. Om den aktuella tiden inte är ogiltig, används den första raden med en ogiltig tid om det finns någon. Beteendet bör förenkla tillägg av tidsstämplar om sångtexten redan finns i tabellen men tidsstämplarna saknas (vilket är fallet när osynkroniserad sångtext importeras). Observera att den ogiltiga tiden representeras som 00:00.00, dvs. samma som tiden i spårets absoluta början, som inte är ogiltig. För att göra tiden ogiltig, tryck på tangenten <keycap>Delete</keycap>, eller använd <guimenu>Rensa</guimenu> i den sammanhangsberoende menyn. Nya rader som infogas genom att använda <guimenu>Infoga rad</guimenu> i den sammanhangsberoende menyn eller som skapas när osynkroniserad sångtext importeras med <guibutton>Från klippbord</guibutton> eller <guibutton>Importera</guibutton> innehåller också ogiltiga tidsstämplar. Rader i tabellen kan tas bort genom att klicka på knappen <guibutton>Ta bort</guibutton> eller använda <guimenu>Ta bort rader</guimenu> från den sammanhangsberoende menyn.

source: Synchronized lyrics can be imported from a file using <guibutton>Import</guibutton>. The expected format is simple or enhanced LRC. If the selected file does not contain a square bracket in the first line, it is supposed to be a simple text file with unsynchronized lyrics. The lines from such a file are then imported having invalid time stamps. The time information can be added using the <guibutton>Add</guibutton> button or by manual entry. It is also possible to import lyrics via copy-paste using <guilabel>From Clipboard</guilabel>. Synchronized lyrics can be written to LRC files using <guibutton>Export</guibutton>. Note that only entries with valid time stamps will be exported and that the entries will be sorted by time. Entries with invalid time won't be stored in the SYLT frame either, so make sure to include all timing information before leaving the dialog.
it: I testi sincronizzati possono essere importati da un file utilizzando <guibutton>Importa</guibutton>. Il formato previsto è LRC semplice o avanzato. Se il file selezionato non contiene una parentesi quadra nella prima riga, si suppone che sia un semplice file di testo con testi non sincronizzati. Le righe di tale file sono quindi importate con marche temporali non valide. Le informazioni sull'ora possono essere aggiunte utilizzando il pulsante <guibutton>Aggiungi</guibutton> o tramite inserimento manuale. È anche possibile importare testi tramite copia e incolla utilizzando <guilabel>Dagli appunti</guilabel>. I testi sincronizzati possono essere scritti in file LRC utilizzando <guibutton>Esporta</guibutton>. Si noti che saranno esportate solo le voci con marche temporali valide e che le voci saranno ordinate per ora. Le voci con tempo non valido non saranno memorizzate nemmeno nel frame SYLT, assicurarsi quindi di includere tutte le informazioni di temporizzazione prima di uscire dalla finestra.
ru: Чтобы импортировать синхронизированный текст из файла, воспользуйтесь кнопкой <guibutton>Импорт...</guibutton>. Ожидаемым форматом файла является простой или усовершенствованный формат LRC. Если первая строка в выбранном файле начинается не с квадратной скобки, приложение распознает файл как простой текстовый файл с несинхронизированным текстом. Строки из такого файла будут импортированы с некорректными метками времени. Данные времени возможно добавить с помощью кнопки <guibutton>Добавить</guibutton> или ввести вручную. Также возможно импортировать текст путём копирования со вставкой с помощью кнопки <guilabel>Из буфера обмена</guilabel>. Чтобы записать синхронизированный текст в файл формата LRC, воспользуйтесь кнопкой <guibutton>Экспорт...</guibutton>. Обратите внимание, что экспортируются лишь записи с корректными метками времени, при этом сами записи будут упорядочены по времени. Записи с некорректными метками времени не сохраняются во фрейме SYLT, поэтому перед закрытием диалогового окна убедитесь, что указаны все данные времени.
sv: Synkroniserad sångtext kan importeras från en fil genom att använda <guibutton>Importera</guibutton>. Förväntat format är enkel eller förbättrad LRC. Om den markerade filen inte innehåller en hakparentes på första raden, antas den vara en enkel textfil med osynkroniserad sångtext. Raderna från en sådan fil importeras med ogiltiga tidsstämplar. Tidsinformationen kan läggas till genom att använda knappen <guibutton>Lägg till</guibutton> eller med manuell inmatning. Det är också möjligt att importera sångtext genom att kopiera och klistra in genom att använda <guilabel>Från klippbord</guilabel>. Synkroniserad sångtext kan skrivas till LRC-filer genom att använda <guibutton>Exportera</guibutton>. Observera att bara poster med giltiga tidsstämplar exporteras, och att posterna sorteras enligt tid. Poster med ogiltig tid lagras inte heller i SYLT-ramarna, så säkerställ att all tidsinformation innan dialogrutan lämnas.

source: The <ulink url="http://id3.org/id3v2.4.0-frames">ID3 specification</ulink> suggests a time stamp for each syllable. However most players only support the granularity of a line or sentence. To support both use cases, &kid3; follows the same conventions as <ulink url="http://www.compuphase.com/software_sylteditor.htm">SYLT Editor</ulink>. Text which is entered into the table is assumed to start a new line unless it starts with a space or a hyphen. Exceptions to this rule are possible by starting a line with an underscore ('_') to force continuation or a hash mark ('#') to force a new line. These escape characters are not stored inside the SYLT frame. Inside the SYLT frame, new lines start with a line feed character (hex 0A) whereas continuations do not. When reading SYLT frames, &kid3; checks if the first entry starts with a line feed. If this is not the case, it is assumed that all entries are new lines and that no syllable continuations are used.
it: La <ulink url="http://id3.org/id3v2.4.0-frames">specifica ID3</ulink> suggerisce una marca temporale ogni sillaba. Tuttavia la maggior parte dei lettori supporta solo la granularità di una riga o frase. Per supportare entrambi i casi d'uso, &kid3; segue le stesse convenzioni dell'<ulink url="http://www.compuphase.com/software_sylteditor.htm">Editor SYLT</ulink>. Si presume che il testo immesso nella tabella inizi una nuova riga a meno che non inizi con uno spazio o un trattino. Eccezioni a questa regola sono possibili iniziando una riga con un trattino basso ('_') per forzare la continuazione o un cancelletto ('#') per forzare una nuova linea. Questi caratteri di escape non sono memorizzati nel frame SYLT. All'interno del frame SYLT, le nuove righe iniziano con un carattere di avanzamento di riga (esadecimale 0A) mentre le continuazioni no. Durante la lettura di frame SYLT, &kid3; controlla se la prima voce inizia con un avanzamento di riga. In caso contrario, si presume che tutte le voci siano nuove righe e che non vengano utilizzate continuazioni di sillabe.
ru: <ulink url="http://id3.org/id3v2.4.0-frames">Спецификация ID3</ulink> предлагает использование метки времени для каждого слога. Однако большинство проигрывателей поддерживают только разделение текста на уровне строки или предложения. Чтобы обеспечить поддержку обоих способов использования, &kid3; следует тем же принципам, что и <ulink url="http://www.compuphase.com/software_sylteditor.htm">редактор SYLT</ulink>. Введённый в таблицу текст считается началом новой строки, если он не начинается с пробела или дефиса. Из этого правила есть исключения: возможно начать строку с символа подчёркивания («_») для принудительного продолжения строки или с символа решётки («#») для принудительного разрыва строки. Эти спецсимволы не сохраняются во фрейме SYLT. Внутри фрейма SYLT новые строки начинаются с символа перевода строки (шестнадцатеричного 0A), а продолжение строк — нет. При чтении фреймов SYLT &kid3; проверяет, начинается ли первая запись с символа перевода строки. Если это не так, приложение предполагает, что все записи являются отдельными строками, а продолжение по слогам не используется.
sv: <ulink url="http://id3.org/id3v2.4.0-frames">ID3-specifikationen</ulink> föreslår en tidsstämpel för varje stavelse. Dock stöder de flesta spelare bara granulariteten rad eller mening. &kid3; följer samma konvention som <ulink url="http://www.compuphase.com/software_sylteditor.htm">SYLT-editorn</ulink> för att stödja båda användningsfallen. Text som matas in i tabellen antas starta en ny rad om den inte börjar med ett mellanslag eller ett bindestreck. Undantag av regeln är möjliga genom att inleda an rad med ett understreck ('_') för att tvinga en fortsättning, eller ett nummertecken ('#') för att tvinga en ny rad. Dessa undantagstecken lagras inte i SYLT-ramen. Inne i SYLT-ramen, börjar nya rader med ett nyradstecken (hexadecimalt 0A) medan fortsättningar inte gör det. När SYLT-ramar läses in, kontrollerar &kid3; om den första posten startar med en nyrad. Om det inte är fallet, antas att alla poster är nyrader och att ingen stavelsefortsättning används.

source: While the track is played, the row associated with the current playing position is highlighted, so that the correctness of the synchronization information can be verified. If an offset has to be added to one or more time stamps, this can be accomplished with the <guimenu>Add offset</guimenu> context menu. Negative values can be used to reduce the time. Using <guimenu>Seek to position</guimenu> in the context menu, it is possible to set the playing position to the time of the selected row.
it: Durante la riproduzione della traccia, viene evidenziata la riga associata alla posizione di riproduzione attuale, in modo da poter verificare la correttezza delle informazioni di sincronizzazione. Se è necessario aggiungere uno scostamento a uno o più marche temporali, questo può essere realizzato con il menu contestuale <guimenu>Aggiungi scostamento</guimenu>. I valori negativi possono essere utilizzati per ridurre il tempo. Utilizzando <guimenu>Scorri alla posizione</guimenu> nel menu contestuale, è possibile impostare la posizione di riproduzione sull'orario della riga selezionata.
ru: При воспроизведении дорожки будет подсвечиваться строка, соответствующая воспроизводимой позиции, что позволяет проверить правильность синхронизации информации. Если требуется добавить смещение на одну или несколько меток времени, воспользуйтесь пунктом вызываемого правой кнопкой мыши контекстного меню <guimenu>Добавить смещение...</guimenu>. Отрицательные значения позволяют уменьшить значения меток времени. Пункт контекстного меню <guimenu>Прокрутка до положения</guimenu> позволяет установить позицию воспроизведения в значение времени выбранной строки.
sv: Medan spåret spelas, färgläggs raden som hör ihop med positionen som för närvarande spelas upp, så att synkroniseringsinformationens riktighet kan verifieras. Om en förskjutning måste läggas till för en eller flera tidsstämplar, kan det åstadkommas med <guimenu>Lägg till förskjutning</guimenu> i den sammanhangsberoende menyn. Negativa värden kan användas för att reducera tiden. Genom att använda <guimenu>Gå till position</guimenu> i den sammanhangsberoende menyn, är det möjligt att ställa in uppspelningsposition till den markerade radens tid.

source: Recommended procedure to add new synchronized lyrics
it: Procedura consigliata per aggiungere i nuovi testi sincronizzati
ru: Рекомендуемый порядок действий для синхронизации текста песни
sv: Rekommenderad procedur för att lägga till ny synkroniserad sångtext

source: Get the unsynchronized lyrics, <abbrev>e.g.</abbrev> using <menuchoice><guimenu>Lyrics</guimenu><guimenuitem>Embed Lyrics</guimenuitem></menuchoice> from the file list context menu.
it: Ottenere i testi non sincronizzati, <abbrev>ad es.</abbrev> utilizzando <menuchoice><guimenu>Testi</guimenu><guimenuitem>Integra testi</guimenuitem></menuchoice> dal menu contestuale dell'elenco dei file.
ru: Получите несинхронизированный текст, например, с помощью функции <menuchoice><guimenu>Lyrics</guimenu><guimenuitem>Embed Lyrics</guimenuitem></menuchoice> в контекстном меню списка файлов.
sv: Hämta den osynkroniserade sångtexten, t.ex. genom att använda <menuchoice><guimenu>Sångtext</guimenu><guimenuitem>Inbädda sångtext</guimenuitem></menuchoice> i fillistans sammanhangsberoende meny.
