Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: The <guilabel>Network</guilabel> page contains only a field to insert the proxy address and optionally the port, separated by a colon. The proxy will be used when importing from an Internet server when the check box is checked.
it: La pagina <guilabel>Rete</guilabel> contiene solo un campo per inserire l'indirizzo proxy e facoltativamente la porta, separati da due punti. Il proxy sarà utilizzato durante l'importazione da un server Internet quando la casella di selezionate è marcata.
ru: На вкладке <guilabel>Сеть</guilabel> доступно только поле для вставки адреса прокси-сервера и (необязательно) порта, разделённых двоеточием. Прокси-сервер будет использоваться при импорте с интернет-сервера, если установлен соответствующий флажок.
sv: Sidan <guilabel>Nätverk</guilabel> innehåller bara ett fält för att infoga proxy-adressen och valfritt porten, åtskilda av ett kolon. Proxy används vid import från en Internet-server när kryssrutan är markerad.

source: In the <guilabel>Plugins</guilabel> page, available plugins can be enabled or disabled. The plugins are separated into two sections. The <guilabel>Metadata Plugins &amp; Priority</guilabel> list contains plugins which support audio file formats. The order of the plugins is important because they are tried from top to bottom. Some formats are supported by multiple plugins, so files will be opened with the first plugin supporting them. The <guilabel>TaglibMetadata</guilabel> supports most formats, if it is at the top of the list, it will open most of the files. If you want to use a different plugin for a file format, make sure that it is listed before the <guilabel>TaglibMetadata</guilabel> plugin. Details about the metadata plugin and why you may want to use them instead of TagLib are listed below.
it: Nella pagina <guilabel>Estensioni</guilabel>, le estensioni disponibili possono essere abilitate o disabilitate. Le estensioni sono divise in due sezioni. L'elenco <guilabel>Estensioni metadati e priorità</guilabel> contiene estensioni che supportano i formati di file audio. L'ordine delle estensioni è importante perché vengono provate dall'alto verso il basso. Alcuni formati sono supportati da più estensioni, quindi i file saranno aperti con la prima estensione che li supporta. <guilabel>TaglibMetadata</guilabel> supporta la maggior parte dei formati, se si trova in cima all'elenco, aprirà la maggior parte dei file. Se si desidera utilizzare un'estensione diversa per un formato di file, assicurarsi che sia elencata prima dell'estensione <guilabel>TaglibMetadata</guilabel>. I dettagli sull'estensione dei metadati e sul motivo per cui si potrebbe volerla utilizzare al posto di TagLib sono elencati di seguito.
ru: Вкладка <guilabel>Модули</guilabel> позволяет подключить или отключить модули. Вкладка содержит два раздела. Первый, список <guilabel>Модули для работы с метаданными и приоритет</guilabel>, содержит модули, поддерживающие форматы аудиофайлов. В этом разделе важен порядок модулей, потому что приложение использует их по списку с первой позиции до последней. Некоторые форматы поддерживаются несколькими модулями, поэтому файлы будут открыты первым модулем из списка, поддерживающим их. Модуль <guilabel>TaglibMetadata</guilabel> поддерживает большинство форматов; если этот модуль будет расположен в верхней части списка, с его помощью будет возможно открыть большое количество файлов. Если требуется использовать другой модуль, расположите его над модулем <guilabel>TaglibMetadata</guilabel>. Подробные сведения о модулях для работы с метаданными и информация о том, почему рекомендуется использовать тот или иной модуль вместо TagLib, приведены далее.
sv: På sidan <guilabel>Insticksprogram</guilabel>, kan tillgängliga insticksprogram aktiveras eller inaktiveras. Insticksprogrammen är uppdelade i två sektioner. Listan <guilabel>Metadatainsticksprogram och prioritet</guilabel> innehåller insticksprogram som stöder ljudfilformat, Insticksprogrammens ordning är viktig eftersom de provas uppifrån och ner. Några format stöds av flera insticksprogram, så filer öppnas med det första insticksprogrammet som stöder dem. <guilabel>Tablibmetadata</guilabel> stöder flest format. Om det är längst upp i listan, öppnar det de flesta filerna. Om du vill använda ett annat insticksprogram för ett filformat, säkerställ att det listas innan insticksprogrammet <guilabel>Taglibmetadata</guilabel>. Detaljinformation om metadatainsticksprogram och varför du kan vilja använda dem istället för Taglib listas nedan.

source: <guilabel>Id3libMetadata</guilabel>: Uses <ulink url="http://id3lib.sourceforge.net">id3lib</ulink> for ID3v1.1 and ID3v2.3 tags in MP3, MP2, AAC files. Supports a few more frame types than TagLib.
it: <guilabel>Id3libMetadata</guilabel>: utilizza <ulink url="http://id3lib.sourceforge.net">id3lib</ulink> per i tag ID3v1.1 e ID3v2.3 nei file MP3, MP2, AAC. Supporta alcuni tipi di frame in più rispetto a TagLib.
ru: <guilabel>Id3libMetadata</guilabel>: использует библиотеку <ulink url="http://id3lib.sourceforge.net">id3lib</ulink> для тегов ID3v1.1 и ID3v2.3 в файлах MP3, MP2, AAC. Поддерживает чуть больше типов фреймов, чем TagLib.
sv: <guilabel>Id3libMetadata</guilabel>: Använder <ulink url="http://id3lib.sourceforge.net">id3lib</ulink> för ID3v1.1 och ID3v2.3 taggar i MP3-, MP2-, AAC-filer. Stöder några få fler ramtyper än TagLib.

source: <guilabel>OggFlacMetadata</guilabel>: Uses <ulink url="http://xiph.org/ogg/">libogg</ulink>, <ulink url="http://xiph.org/vorbis/">libvorbis, libvorbisfile</ulink> for Ogg files, and additionally <ulink url="http://flac.sourceforge.net">libFLAC++ and libFLAC</ulink> for FLAC files. These are the official libraries for these formats.
it: <guilabel>OggFlacMetadata</guilabel>: utilizza <ulink url="http://xiph.org/ogg/">libogg</ulink>, <ulink url="http://xiph.org/vorbis/">libvorbis, libvorbisfile</ulink> per i file Ogg e inoltre <ulink url="http://flac.sourceforge.net">libFLAC ++ e libFLAC</ulink> per i file FLAC. Queste sono le librerie ufficiali per questi formati.
ru: <guilabel>OggFlacMetadata</guilabel>: использует <ulink url="http://xiph.org/ogg/">libogg</ulink>, <ulink url="http://xiph.org/vorbis/">libvorbis, libvorbisfile</ulink> для файлов Ogg и дополнительно <ulink url="http://flac.sourceforge.net">libFLAC++ и libFLAC</ulink> для файлов FLAC. Это официальные библиотеки для этих форматов.
sv: <guilabel>OggFlacMetadata</guilabel>: Använder <ulink url="http://xiph.org/ogg/">libogg</ulink>, <ulink url="http://xiph.org/vorbis/">libvorbis, libvorbisfile</ulink> för Ogg-filer, och ytterligare <ulink url="http://flac.sourceforge.net">libFLAC++ och libFLAC</ulink> för FLAC-filer. De är de officiella biblioteken för dessa format.

source: <guilabel>TaglibMetadata</guilabel>: Uses <ulink url="http://taglib.github.io/">TagLib</ulink> which supports a lot of audio file formats. It can be used for all audio files supported by &kid3;.
it: <guilabel>TaglibMetadata</guilabel>: utilizza <ulink url="http://taglib.github.io/">TagLib</ulink> che supporta molti formati di file audio. Può essere usato per tutti i file audio supportati da &kid3;.
ru: <guilabel>TaglibMetadata</guilabel>: использует библиотеку <ulink url="http://taglib.github.io/">TagLib</ulink>, которая поддерживает большое количество форматов аудио. Может быть использован для всех файлов, поддерживаемых &kid3;.
sv: <guilabel>TaglibMetadata</guilabel>: Använder <ulink url="http://taglib.github.io/">TagLib</ulink> som stöder många ljudfilformat. Det kan användas för alla ljudfiler som stöds av &kid3;.

source: <guilabel>Mp4v2Metadata</guilabel>: <ulink url="http://code.google.com/p/mp4v2">mp4v2</ulink> was originally used by &kid3; to support M4A files. Can be used in case of problems with the M4A support of TagLib.
it: <guilabel>Mp4v2Metadata</guilabel>: <ulink url="http://code.google.com/p/mp4v2">mp4v2</ulink> è stato originariamente utilizzato da &kid3; per supportare i file M4A. Può essere utilizzato in caso di problemi con il supporto M4A di TagLib.
sv: <guilabel>Mp4v2Metadata</guilabel>: <ulink url="http://code.google.com/p/mp4v2">mp4v2</ulink> användes ursprungligen av &kid3; för att stödja M4A-filer. Kan användas i händelse av problem med M4A-stödet i TagLib.

source: The <guilabel>Available Plugins</guilabel> section lists the remaining plugins. Their order is not important, but they can be enabled or disabled using the check boxes.
it: La sezione <guilabel>Estensioni disponibili</guilabel> elenca le estensioni rimanenti. Il loro ordine non è importante, ma possono essere abilitate o disabilitate utilizzando le caselle di controllo.
ru: Раздел <guilabel>Доступные модули</guilabel> отображает список остальных модулей. Их порядок в списке не важен. Эти модули подключаются и отключаются с помощью флажков.
sv: Sektionen <guilabel>Tillgängliga insticksprogram</guilabel> listar de återstående insticksprogram. Deras ordning är inte viktig, men de kan aktiveras och inaktiveras genom att använda kryssrutorna.

source: <guilabel>AmazonImport</guilabel>: Used for the <guimenuitem>Import from Amazon...</guimenuitem> function.
it: <guilabel>AmazonImport</guilabel>: utilizzata per la funzione <guimenuitem>Importa da Amazon...</guimenuitem>.
ru: <guilabel>AmazonImport</guilabel>: используется для функции <guimenuitem>Импорт из Amazon...</guimenuitem>.
sv: <guilabel>AmazonImport</guilabel>: Används för funktionen <guimenuitem>Import från Amazon...</guimenuitem>.

source: <guilabel>DiscogsImport</guilabel>: Used for the <guimenuitem>Import from Discogs...</guimenuitem> function.
it: <guilabel>DiscogsImport</guilabel>: utilizzata per la funzione <guimenuitem>Importa da Discogs...</guimenuitem>.
ru: <guilabel>DiscogsImport</guilabel>: используется для функции <guimenuitem>Импорт из Discogs...</guimenuitem>.
sv: <guilabel>DiscogsImport</guilabel>: Används för funktionen <guimenuitem>Import från Discogs...</guimenuitem>.

source: <guilabel>FreedbImport</guilabel>: Used for the <guimenuitem>Import from gnudb.org...</guimenuitem> function.
it: <guilabel>FreedbImport</guilabel>: utilizzata per la funzione <guimenuitem>Importa da gnudb.org...</guimenuitem>.
ru: <guilabel>FreedbImport</guilabel>: используется для функции <guimenuitem>Импорт из gnudb.org...</guimenuitem>.
sv: <guilabel>FreedbImport</guilabel>: Används för funktionen <guimenuitem>Import från gnudb.org...</guimenuitem>.

source: <guilabel>MusicBrainzImport</guilabel>: Used for the <guimenuitem>Import from MusicBrainz Release...</guimenuitem> function.
it: <guilabel>MusicBrainzImport</guilabel>: utilizzata per la funzione <guimenuitem>Importa da MusicBrainz Release...</guimenuitem>.
ru: <guilabel>MusicBrainzImport</guilabel>: используется для функции <guimenuitem>Импорт из MusicBrainz (релиз)...</guimenuitem>.
sv: <guilabel>MusicBrainzImport</guilabel>: Används för funktionen <guimenuitem>Import från MusicBrainz Release...</guimenuitem>.

source: <guilabel>AcoustidImport</guilabel>: Used for the <guimenuitem>Import from MusicBrainz Fingerprint...</guimenuitem> function, which depends on the <ulink url="http://acoustid.org/chromaprint">Chromaprint</ulink> and <ulink url="http://libav.org/">libav</ulink> libraries.
it: <guilabel>AcoustidImport</guilabel>: utilizzata per la funzione <guimenuitem>Importa da MusicBrainz Fingerprint...</guimenuitem>, che dipende dalle librerie <ulink url="http://acoustid.org/chromaprint">Chromaprint</ulink> e <ulink url="http://libav.org/">libav</ulink>.
ru: <guilabel>AcoustidImport</guilabel>: используется для функции <guimenuitem>Импорт из MusicBrainz (отпечаток)...</guimenuitem>, работа которой зависит от библиотек <ulink url="http://acoustid.org/chromaprint">Chromaprint</ulink> и <ulink url="http://libav.org/">libav</ulink>.
sv: <guilabel>AcoustidImport</guilabel>: Används för funktionen <guimenuitem>Import från MusicBrainz Fingerprint...</guimenuitem>, som beror på biblioteken <ulink url="http://acoustid.org/chromaprint">Chromaprint</ulink> och <ulink url="http://libav.org/">libav</ulink>.

source: Plugins which are disabled will not be loaded. This can be used to optimize resource usage and startup time. The settings on this page take only effect after a restart of &kid3;.
it: Le estensioni disabilitate non saranno caricate. Questo può essere utilizzato per ottimizzare l'utilizzo delle risorse e i tempi di avvio. Le impostazioni in questa pagina hanno effetto solo dopo il riavvio di &kid3;.
ru: Отключённые модули не будут загружены. Это позволяет оптимизировать потребление ресурсов и время запуска. Изменённые параметры этой вкладки вступят в силу только после перезапуска &kid3;.
sv: Insticksprogram som är inaktiverade laddas inte. Det kan användas för att optimera resursanvändning och starttid. Inställningarna på sidan får bara effekt efter att &kid3; har startats om.

source: The Help Menu
it: Il menu Aiuto
ru: Меню «Справка»
sv: Menyn Hjälp

source: <guimenu>Help</guimenu> <guimenuitem>&kid3; Handbook</guimenuitem>
it: <guimenu>Aiuto</guimenu> <guimenuitem>Manuale di &kid3;</guimenuitem>
ru: <guimenu>Справка</guimenu> <guimenuitem>Руководство пользователя &kid3;</guimenuitem>
sv: <guimenu>Hjälp</guimenu> <guimenuitem>Handbok &kid3;</guimenuitem>

source: Opens this handbook.
it: Apre questo manuale.
ru: Открывает данное руководство пользователя.
sv: Visar den här handboken.

source: <guimenu>Help</guimenu> <guimenuitem>About &kid3;</guimenuitem>
it: <guimenu>Aiuto</guimenu> <guimenuitem>Informazioni su &kid3;</guimenuitem>
ru: <guimenu>Справка</guimenu> <guimenuitem>О программе &kid3;</guimenuitem>
sv: <guimenu>Hjälp</guimenu> <guimenuitem>Om &kid3;</guimenuitem>

source: Displays a short information about &kid3;.
it: Visualizza brevi informazioni su &kid3;.
ru: Отображает краткую информацию о &kid3;.
sv: Visar en kort information om &kid3;.

source: Commands
it: Comandi
ru: Команды
sv: Kommandon

source: <command>kid3-cli</command> offers a command-line-interface for &kid3;. If a folder path is used, the folder is opened. If one or more file paths are given, the common folder is opened and the files are selected. Subsequent commands will then work on these files. Commands are specified using <option>-c</option> options. If multiple commands are passed, they are executed in the given order. If files are modified by the commands, they will be saved at the end. If no command options are passed, <command>kid3-cli</command> starts in interactive mode. Commands can be entered and will operate on the current selection. The following sections list all available commands.
it: <command>kid3-cli</command> offre un'interfaccia a riga di comando per &kid3;. Se si utilizza il percorso di una cartella, la cartella viene aperta. Se si forniscono uno o più percorsi di file, sarà aperta la cartella comune e i file saranno selezionati. I comandi successivi funzioneranno quindi su questi file. I comandi sono specificati utilizzando le opzioni <option>-c</option>. Se vengono passati più comandi, saranno eseguiti nell'ordine indicato. Se i file vengono modificati dai comandi, saranno salvati alla fine. Se non vengono passate opzioni di comando, <command>kid3-cli</command> si avvia in modalità interattiva. I comandi possono essere inseriti e opereranno sulla selezione attuale. Le seguenti sezioni elencano tutti i comandi disponibili.
ru: <command>kid3-cli</command> предоставляет интерфейс командной строки к &kid3;. Если в качестве аргумента будет указан путь к каталогу, будет открыт соответствующий каталог. Если будет указан один или несколько путей к файлам, будет открыт общий каталог, а файлы будут выделены. Последующие команды будут применены к этим файлам. Команды возможно указывать с помощью параметра <option>-c</option>. Если передано несколько команд, они будут выполнены в указанном порядке. Если команды вносят изменения в файлы, эти изменения будут сохранены при выходе из приложения. Если команды не будут переданы, интерфейс <command>kid3-cli</command> будет запущен в интерактивном режиме. Можно будет вводить команды и работать с текущими выделенными файлами. В следующих разделах приведён список доступных команд.
sv: <command>kid3-cli</command> erbjuder ett kommandoradsgränssnitt för &kid3;. Om en katalogsökväg används, öppnas den katalogen. Om en eller flera filsökvägar anges, öppnas den gemensamma katalogen och filerna markeras. Efterföljande kommandon arbetar därefter med dessa filer. Kommandon anges med väljaren <option>-c</option>. Om flera kommandon anges, utförs de i angiven ordning. Om filer ändras av kommandon, sparas de på slutet. Om inga kommandoväljare anges, startar <command>kid3-cli</command> i interaktivt läge. Kommandon kan matas in och utförs med den aktuella markeringen. Följande avsnitt listar alla tillgängliga kommandon.

source: Help
it: Aiuto
ru: Справка
sv: Hjälp

source: <command>help</command> <arg><replaceable>COMMAND-NAME</replaceable></arg>
it: <command>help</command> <arg><replaceable>NOME-COMANDO</replaceable></arg>
ru: <command>help</command> <arg><replaceable>НАЗВАНИЕ-КОМАНДЫ</replaceable></arg>
sv: <command>help</command> <arg><replaceable>KOMMANDONAMN</replaceable></arg>

source: Displays help about the parameters of <replaceable>COMMAND-NAME</replaceable> or about all commands if no command name is given.
it: Visualizza un guida relativa ai parametri di <replaceable>NOME-COMANDO</replaceable> o su tutti i comandi, se nessun nome comando è specificato.
ru: Отображает справку о параметрах <replaceable>НАЗВАНИЕ-КОМАНДЫ</replaceable> или обо всех командах, если конкретная команда не указана.
sv: Visar hjälp om parametrarna för <replaceable>KOMMANDONAMN</replaceable> eller om alla kommandon om inget kommandonamn anges.

source: Timeout
it: Tempo massimo
ru: Время ожидания
sv: Tidsgräns

source: <command>timeout</command> <group> <arg choice="plain">default</arg> <arg choice="plain">off</arg> <arg choice="plain"><replaceable>TIME</replaceable></arg> </group>
it: <command>timeout</command> <group> <arg choice="plain">default</arg> <arg choice="plain">off</arg> <arg choice="plain"><replaceable>TEMPO</replaceable></arg> </group>
ru: <command>timeout</command> <group> <arg choice="plain">default</arg> <arg choice="plain">off</arg> <arg choice="plain"><replaceable>ВРЕМЯ</replaceable></arg> </group>
sv: <command>timeout</command> <group> <arg choice="plain">default</arg> <arg choice="plain">off</arg> <arg choice="plain"><replaceable>TID</replaceable></arg> </group>

source: Overwrite the default command timeout. The CLI commands abort after a command specific timeout is expired. This timeout is 10 seconds for <command>ls</command> and <command>albumart</command>, 60 seconds for <command>autoimport</command> and <command>filter</command>, and 3 seconds for all other commands. If a huge number of files has to be processed, these timeouts may be too restrictive, thus the timeout for all commands can be set to <replaceable>TIME</replaceable> ms, switched off altogether or be left at the default values.
it: Sovrascrivere il tempo massimo del comando predefinito. I comandi CLI si interrompono dopo che è scaduto un tempo massimo specifico del comando. Questo tempo massimo è di 10 secondi per <command>ls</command> e <command>albumart</command>, 60 secondi per <command>autoimport</command> e <command>filter</command> e 3 secondi per tutti gli altri comandi. Se è necessario elaborare un numero enorme di file, questi tempi potrebbero essere troppo restrittivi, pertanto il tempo massimo per tutti i comandi può essere impostato su <replaceable>TIME</replaceable> ms, disattivato del tutto o lasciato ai valori predefiniti.
ru: Позволяет перезаписать стандартное значение времени ожидания выполнения команды. Выполнение команд командного интерфейса будет прервано, если будет превышено указанное время ожидания. Стандартное время ожидания для команд <command>ls</command> и <command>albumart</command> — 10 секунд, для команд <command>autoimport</command> и <command>filter</command> — 60 секунд, а для остальных команд — 3 секунды. Если требуется обработать большое количество файлов, эти временные рамки могут оказаться слишком жёсткими, поэтому предусмотрена возможность установить время ожидания для всех команд в значение <replaceable>ВРЕМЯ</replaceable> (в миллисекундах), отключить время ожидания вообще или оставить стандартные значения.
sv: Skriv över den normala kommandotidsgränsen. Kommandoradens kommandon avbryts efter en kommandospecifik tidsgräns har överskridits. Tidsgränsen är 10 sekunder för <command>ls</command> och <command>albumart</command>, 60 sekunder för <command>autoimport</command> och <command>filter</command>, och 3 sekunder för alla andra kommandon. Om ett mycket stort antal filer måste behandlas, kan tidsgränserna vara för restriktiva, och sålunda kan tidsgränsen för alla kommandon ställas in till <replaceable>TID</replaceable> ms, stängas av helt och hållet eller lämnas som normala värden.

source: Quit application
it: Chiudere l'applicazione
ru: Выйти из приложения
sv: Avsluta programmet

source: Exit application. If there are modified unsaved files, the <parameter class="command">force</parameter> parameter is required.
it: Chiudere l'applicazione. Se ci sono file modificati e non salvati, è richiesto il parametro <parameter class="command">force</parameter>.
ru: Выйти из приложения. Если в приложении изменённые несохранённые файлы, требуется параметр <parameter class="command">force</parameter>.
sv: Avsluta programmet. Om det finns ändrade osparade filer, krävs parametern <parameter class="command">force</parameter>.

source: Change folder
it: Cambiare cartella
ru: Сменить каталог
sv: Byt katalog

source: <command>cd</command> <arg><replaceable>FOLDER</replaceable></arg>
it: <command>cd</command> <arg><replaceable>CARTELLA</replaceable></arg>
ru: <command>cd</command> <arg><replaceable>КАТАЛОГ</replaceable></arg>
sv: <command>cd</command> <arg><replaceable>KATALOGER</replaceable></arg>

source: If no <replaceable>FOLDER</replaceable> is given, change to the home folder. If a folder is given, change into the folder. If one or more file paths are given, change to their common folder and select the files.
it: Se non viene specificato <replaceable>FOLDER</replaceable>, passare alla cartella principale. Se viene fornita una cartella, passare alla cartella. Se vengono forniti uno o più percorsi di file, passare alla loro cartella comune e selezionare i file.
ru: Если не указано значение <replaceable>КАТАЛОГ</replaceable>, будет осуществлён переход в домашний каталог. Если значение указано, будет выполнен переход в указанный каталог. Если указан один или несколько путей к файлам, будет осуществлён переход в общий каталог, в котором хранятся эти файлы, а файлы будут выделены.
sv: Om <replaceable>FOLDER</replaceable> inte anges, byt till hemkatalogen. Om en katalog anges, byt till den katalogen. Om en eller flera filsökvägar anges, byt till deras gemensamma katalog och markera filerna.

source: Print the filename of the current folder
it: Stampare il nome della cartella attuale
ru: Показать полное имя текущего каталога
sv: Skriv ut den aktuella katalogens filnamn

source: Print the filename of the current working folder.
it: Stampa il nome della cartella di lavoro attuale.
ru: Показать полное имя текущего рабочего каталога.
sv: Skriver ut den aktuella arbetskatalogens filnamn.

source: Folder list
it: Elenco delle cartelle
ru: Список каталогов
sv: Kataloglista
