Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: The list of available formats can be edited in the dialog which appears when clicking the <guibutton>Filename from tag</guibutton> button in the <guilabel>File</guilabel> tab of the <link linkend="configure-kid3">settings</link>.
it: L'elenco dei formati disponibili può essere modificato nella finestra di dialogo che appare quando si fa clic sul pulsante <guibutton>Nome file dal tag</guibutton> nella scheda <guilabel>File</guilabel> delle <link linkend="configure-kid3">impostazioni</link>.
ru: Настройка списка доступных форматов осуществляется в диалоге, вызываемом кнопкой <guibutton>Имя файла из тега</guibutton> на вкладке <guilabel>Файлы</guilabel> окна <link linkend="configure-kid3">настройки параметров</link>.
sv: Listan med tillgängliga format kan redigeras i dialogrutan som visas när knappen <guibutton>Filnamn från tagg</guibutton> klickas under fliken <guilabel>Fil</guilabel> i <link linkend="configure-kid3">inställningarna</link>.

source: A second <guilabel>Format</guilabel> combo box (with arrow down) is used to generate the tags from the filename. If the format of the filename does not match this pattern, a few other commonly used formats are tried.
it: Una seconda casella combinata <guilabel>Formato</guilabel> (con la freccia in giù) viene utilizzata per generare i tag dal nome file. Se il formato del nome file non corrisponde a questo modello, vengono provati alcuni altri formati comunemente utilizzati.
ru: Второй раскрывающийся список <guilabel>Формат</guilabel> (со стрелкой вниз) используется для создания тегов из имени файла. Если формат имени файла не соответствует этому шаблону, будет предпринята попытка использовать другие распространённые форматы.
sv: En andra kombinationsruta <guilabel>Format</guilabel> (med neråtpil) används för att generera taggarna från filnamnet. Om filnamnsformatet inte motsvarar mönstret, provas ett antal andra ofta använda format.

source: Some commonly used filename formats are already available in the combo box, but it is also possible to type in some special format into the line edit.
it: Alcuni formati di file comunemente utilizzati sono già disponibili nella casella combinata, ma è anche possibile digitare un formato speciale nell campo di testo.
ru: В раскрывающемся списке перечислено несколько стандартных форматов названий файлов, но также возможно ввести свой собственный формат в строку редактирования.
sv: Vissa ofta använda filnamnsformat är redan tillgängliga i kombinationsrutan, men det är också möjligt att skriva in några specialformat på redigeringsraden.

source: The list of available formats can be edited in the dialog which appears when clicking the <guibutton>Tag from filename</guibutton> button in the <guilabel>File</guilabel> tab of the <link linkend="configure-kid3">settings</link>.
it: L'elenco dei formati disponibili può essere modificato nella finestra che appare quando si fa clic sul pulsante <guibutton>Tag dal nome file</guibutton> nella scheda <guilabel>File</guilabel> delle <link linkend="configure-kid3">impostazioni</link>.
ru: Настройка списка доступных форматов осуществляется в диалоге, вызываемом кнопкой <guibutton>Тег из имени файла</guibutton> на вкладке <guilabel>Файлы</guilabel> окна <link linkend="configure-kid3">настройки параметров</link>.
sv: Listan med tillgängliga format kan redigeras i dialogrutan som visas genom att klicka på knappen <guibutton>Tagg från filnamn</guibutton> under fliken <guilabel>Fil</guilabel> i <link linkend="configure-kid3">inställningarna</link>.

source: Internally, a regular expression is built from the format codes. If advanced regular expressions are required, the format to generate the tags from the filenames can be given as a complete regular expression with captures which are preceded by the format codes, <abbrev>e.g.</abbrev> to extract the track numbers without removal of leading zeros, a format like "<userinput>/%{track}(\d+) %{title}(.*)</userinput>" could be used.
it: Internamente, un'espressione regolare viene creata dai codici di formato. Se sono richieste espressioni regolari avanzate, il formato per generare i tag dai nomi dei file può essere fornito come un'espressione regolare completa con catture precedute dai codici di formato, <abbrev>ad es.</abbrev> per estrarre i numeri di traccia senza rimuovere zeri iniziali, potrebbe essere utilizzato un formato come «<userinput>/%{track}(\d+)%{title}(.*)</userinput>»
ru: На внутреннем уровне регулярное выражение состоит из кодов формата. Если требуются расширенные регулярные выражения, формат для создания тегов из имён файлов может быть задан как полное регулярное выражение с частями, которым предшествуют коды формата. Например, для извлечения номеров дорожек без удаления нулей в начале следует использовать формат наподобие «<userinput>/%{track}(\d+) %{title}(.*)</userinput>».
sv: Internt byggs ett reguljärt uttryck från formatkoderna. Om avancerade reguljära uttryck krävs, kan formatet för att generera taggarna från filnamnen anges som ett fullständigt reguljärt uttryck med infångning som föregås av formatkoderna, t.ex. för att extrahera spårnumren utan borttagning av inledande nollor, ett format som "<userinput>/%{track}(\d+) %{title}(.*)</userinput>" kunna användas.

source: <guilabel>From:</guilabel> <guibutton>Tag 1</guibutton>, <guibutton>Tag 2</guibutton>: Sets the filename using the selected format and the first tag or the second tag, respectively.
it: <guilabel>Da:</guilabel> <guibutton>Tag 1</guibutton>, <guibutton>Tag 2</guibutton>: imposta il nome file utilizzando il formato selezionato e il primo tag o il secondo tag, rispettivamente.
ru: <guilabel>Из:</guilabel> <guibutton>Тег 1</guibutton>, <guibutton>Тег 2</guibutton>: установка имени файла с использованием выбранного формата и, соответственно, первого или второго тега.
sv: <guilabel>Från:</guilabel> <guibutton>Tagg 1</guibutton>, <guibutton>Tagg 2</guibutton>: Ställer in filnamnet genom att använda det valda formatet och den första taggen eller den andra taggen.

source: <guilabel>To:</guilabel> <guibutton>Tag 1</guibutton>, <guibutton>Tag 2</guibutton>: The tags are set from the filename. First, the format specified in <guilabel>Format</guilabel> is used. If the existing filename does not match this format, the following formats are tried:
it: <guilabel>A:</guilabel> <guibutton>Tag 1</guibutton>, <guibutton>Tag 2</guibutton>: i tag sono impostati dal nome file. Primo, è utilizzato il formato specificato in <guilabel>Formato</guilabel>. Se il nome file esistente non verifica questo formato, saranno provati i seguenti formati:
ru: <guilabel>В:</guilabel> <guibutton>Тег 1</guibutton>, <guibutton>Тег 2</guibutton>: создание тегов из имени файла. Сначала используется формат, указанный в поле <guilabel>Формат</guilabel>. Если существующее имя файла не соответствует этому формату, предпринимается попытка использовать следующие форматы:
sv: <guilabel>Till:</guilabel> <guibutton>Tagg 1</guibutton>, <guibutton>Tagg 2</guibutton>: Taggarna ställs in från filnamnet. Först används formatet angivet i <guilabel>Format</guilabel>. Om det befintliga filnamnet inte motsvarar formatet, provas följande format:

source: Artist - Album/Track Song
it: Artista - Album/Traccia Brano
ru: Исполнитель - Альбом/Дорожка Композиция
sv: Artist - Album/Spår Låt

source: Album/Track - Artist - Song
it: Album/Traccia - Artista - Brano
ru: Альбом/Дорожка - Исполнитель - Композиция
sv: Album/Spår - Artist - Låt

source: /Artist - Album - Track - Song
it: /Artista - Album - Traccia - Brano
ru: /Исполнитель - Альбом - Дорожка - Композиция
sv: /Artist - Album - Spår - Låt

source: Album/Artist - Track - Song
it: Album/Artista - Traccia - Brano
ru: Альбом/Исполнитель - Дорожка - Композиция
sv: Album/Artist - Spår - Låt

source: Album/Artist - Song
it: Album/Artista - Brano
ru: Альбом/Исполнитель - Композиция
sv: Album/Artist - Låt

source: Artist/Album/Track Song
it: Artista/Album/Traccia Brano
ru: Исполнитель/Альбом/Дорожка Композиция
sv: Artist/Album/Spår Låt

source: If a single file is selected, the &GUI; controls are filled with the values extracted from the filename. If multiple files are selected, the tags of the files are directly set according to the filenames.
it: Se viene selezionato un singolo file, i controlli della &GUI; sono riempiti con i valori estratti dal nome file. Se vengono selezionati più file, i tag dei file sono impostati direttamente in base ai nomi dei file.
ru: Если выбран один файл, пункты графического интерфейса будут заполнены значениями, полученными из названия этого файла. Если выбрано несколько файлов, теги файлов устанавливаются непосредственно в соответствии с именами файлов.
sv: Om en enda fil är markerad, fylls kontrollerna i det grafiska användargränssnittet med värden som extraheras från filnamnet. Om flera filer är markerade, ställs filernas taggar direkt in enligt filnamnen.

source: The line edit widgets for <guilabel>Title</guilabel>, <guilabel>Artist</guilabel>, <guilabel>Album</guilabel>, <guilabel>Comment</guilabel>, <guilabel>Date</guilabel>, <guilabel>Track Number</guilabel> and <guilabel>Genre</guilabel> are used to edit the corresponding value in the first tag of the selected files. The value will be changed when the file selection is altered or before operations like <guimenuitem>Save</guimenuitem> and <guimenuitem>Quit</guimenuitem> and when the corresponding check box at the left of the field name is checked. This is useful to change only some values and leave the other values unchanged.
it: I campi di testo per <guilabel>Titolo</guilabel>, <guilabel>Artista</guilabel>, <guilabel>Album</guilabel>, <guilabel>Commento</guilabel>, <guilabel>Data</guilabel>, <guilabel>Numero traccia</guilabel> e <guilabel>Genere</guilabel> sono utilizzati per modificare il valore corrispondente nel primo tag dei file selezionati. Il valore sarà modificato quando viene modificata la selezione del file o prima di operazioni come <guimenuitem>Salva</guimenuitem> ed <guimenuitem>Esci</guimenuitem> e quando viene selezionata la casella di controllo corrispondente a sinistra del nome del campo. Ciò è utile per modificare solo alcuni valori e lasciare invariati gli altri valori.
ru: Строки редактирования <guilabel>Заголовок</guilabel>, <guilabel>Исполнитель</guilabel>, <guilabel>Альбом</guilabel>, <guilabel>Комментарий</guilabel>, <guilabel>Дата</guilabel>, <guilabel>Номер дорожки</guilabel> и <guilabel>Жанр</guilabel> используются для изменения соответствующего значения первого тега выделенных файлов. Значение будет изменено при изменении выделения файлов, перед такими действиями, как <guimenuitem>Сохранить</guimenuitem> и <guimenuitem>Выход</guimenuitem>, а также при установке соответствующего флажка слева от имени поля. Это позволяет изменить только некоторые значения, оставив остальные значения без изменений.
sv: Redigeringsraden för <guilabel>Titel</guilabel>, <guilabel>Artist</guilabel>, <guilabel>Album</guilabel>, <guilabel>Kommentar</guilabel>, <guilabel>Datum</guilabel>, <guilabel>Spårnummer</guilabel> och <guilabel>Genre</guilabel> används för att redigera motsvarande värde i de markerade filernas första tagg. Värdet ändras när filmarkeringen ändras eller innan åtgärder som <guimenuitem>Spara</guimenuitem> och <guimenuitem>Avsluta</guimenuitem> och när motsvarande kryssruta till vänster om fältnamnet markeras. Det är användbart för att bara ändra vissa värden och lämna andra oförändrade.

source: If a single file is selected, all check boxes are checked and the line edit widgets contain the values found in the tags of this file. If a tag is not found in the file, the corresponding empty value is displayed, which is an empty string for the <guilabel>Title</guilabel>, <guilabel>Artist</guilabel>, <guilabel>Album</guilabel> and <guilabel>Comment</guilabel> line edits, 0 for the numerical <guilabel>Date</guilabel> and <guilabel>Track Number</guilabel> edits and an empty selected value for the <guilabel>Genre</guilabel> combo box. The values can be changed and if the corresponding check box is checked, they will be set for the selected file after the selection is changed. The file is then marked as modified by a disk symbol in the file listbox but remains unchanged until the <guimenuitem>Save</guimenuitem> command is used.
it: Se si seleziona un singolo file, tutte le caselle di controllo sono selezionate e i widget di modifica della riga contengono i valori trovati nei tag di questo file. Se non viene trovato un tag nel file, viene visualizzato il valore vuoto corrispondente, che è una stringa vuota per i campi di testo <guilabel>Titolo</guilabel>, <guilabel>Artista</guilabel>, <guilabel>Album</guilabel> e <guilabel>Commento</guilabel>, 0 per le modifiche numeriche <guilabel>Data</guilabel> e <guilabel>Numero traccia</guilabel> e un valore selezionato vuoto per la casella combinata <guilabel>Genere</guilabel>. I valori possono essere modificati e se la casella di controllo corrispondente è selezionata, saranno impostati per il file selezionato dopo la modifica della selezione. Il file viene quindi marcato come modificato dal simbolo di un disco nell'elenco, ma rimane invariato fino a quando non viene utilizzato il comando <guimenuitem>Salva</guimenuitem>.
ru: Если выбран один файл, будут установлены все флажки, а строки будут заполнены данными, полученными из тегов этого файла. Если теги отсутствуют, будет отображаться соответствующее пустое значение: пустая строка в текстовых полях <guilabel>Заголовок</guilabel>, <guilabel>Исполнитель</guilabel>, <guilabel>Альбом</guilabel> и <guilabel>Комментарий</guilabel>, 0 в числовых полях <guilabel>Дата</guilabel> и <guilabel>Номер дорожки</guilabel> и пустое значение в раскрывающемся списке <guilabel>Жанр</guilabel>. Эти значения возможно изменить, и, если установлен соответствующий флажок, они будут установлены для выбранного файла после изменения выделения. В таком случае файл в списке файлов будет отмечен значком дискеты, но изменения не будут применены, пока не будет выполнена команда <guimenuitem>Сохранить</guimenuitem>.
sv: Om en enda fil är markerad, är alla kryssrutor markerade och redigeringsraderna innehåller värdena som fanns i filens taggar. Om en tagg inte finns i filen, visas det motsvarande tomma värdet, som är en tom sträng för redigeringsraderna <guilabel>Titel</guilabel>, <guilabel>Artist</guilabel>, <guilabel>Album</guilabel> och <guilabel>Kommentar</guilabel>, 0 för de numeriska redigeringsraderna <guilabel>Datum</guilabel> och <guilabel>Spårnummer</guilabel> och ett tomt utvalt värde för kombinationsrutan <guilabel>Genre</guilabel>. Värdena kan ändras och om motsvarande kryssruta är markerad, tilldelas de i den markerade filen efter markeringen ändras. Filen markeras därefter som ändrad av en disksymbol i fillistrutan men förblir oförändrad tills kommandot <guimenuitem>Spara</guimenuitem> används.

source: If multiple files are selected, only the values which are identical in all selected files are displayed. In all other controls, the empty values as described above are displayed. All check boxes are unchecked to avoid unwanted changes. If a value has to be set for all selected files, it can be edited and the check box has to be set. The values will be set for all selected files when the selection is changed and can be saved using the <guimenuitem>Save</guimenuitem> command.
it: Se si selezionano più file, sono visualizzati solo i valori identici in tutti i file selezionati. In tutti gli altri controlli, sono visualizzati i valori vuoti come sopra descritto. Tutte le caselle di controllo sono deselezionate per evitare modifiche indesiderate. Se un valore deve essere impostato per tutti i file selezionati, può essere modificato e la casella di controllo deve essere impostata. I valori saranno impostati per tutti i file selezionati quando la selezione viene modificata e possono essere salvati utilizzando il comando <guimenuitem>Salva</guimenuitem>.
ru: Если выбрано несколько файлов, будут отображены только значения, идентичные во всех файлах. Во всех остальных полях будут показаны пустые значения, как было описано выше. Все флажки будут сняты во избежание нежелательных изменений. Если требуется установить значение для всех выделенных файлов, отредактируйте его, и приложение автоматически установит соответствующий флажок. Значения для выбранных файлов будут установлены при изменении выделения, и эти изменения будет возможно сохранить с помощью команды <guimenuitem>Сохранить</guimenuitem>.
sv: Om flera filer är markerad, visas bara värdena som är identiska i alla markerade filer. I alla andra kontroller, visas de tomma värdena visas enligt beskrivningen ovan. Alla kryssrutor är avmarkerade för att undvika oönskade ändringar. Om ett värde ska tilldelas i alla markerade filer, kan det redigeras och kryssrutan kan markeras. Värdena tilldelas för alla markerade filer när markeringen ändras, och kan sparas med kommandot <guimenuitem>Spara</guimenuitem>.

source: The check boxes also control the operation of most commands affecting the tags, such as copy, paste and transfer between tags 1 and 2. To make it easier to use with multiple files where all check boxes are unchecked, these commands behave in the same way when all check boxes are checked and when all check boxes are unchecked.
it: Le caselle di selezione controllano anche il funzionamento della maggior parte dei comandi che influiscono sui tag, come copia, incolla e trasferimento tra i tag 1 e 2. Per semplificare l'utilizzo con più file in cui tutte le caselle di controllo sono deselezionate, questi comandi si comportano allo stesso modo quando tutte le caselle di controllo sono selezionate e quando tutte le caselle di controllo sono deselezionate.
ru: Флажки позволяют управлять большинством команд, включая копирование, вставку и перенос данных между тегами 1 и 2. Чтобы упростить одновременную работу с несколькими файлами, когда все флажки сняты, эти команды работают одинаково независимо от того, установлены или сняты все флажки.
sv: Kryssrutorna styr också funktionen hos de flesta kommandon som påverkar taggar, såsom kopiera, klistra in och överföring mellan tagg 1 och tagg 2. För att göra det enklare att använda med flera filer, då alla kryssrutor är avmarkerade, beter sig kommandona likadant när alla kryssrutor är markerade och när alla kryssrutor är avmarkerade.

source: <guibutton>From Tag 2</guibutton>: The tag 1 fields are set from the corresponding values in tag 2. If a single file is selected, the &GUI; controls are filled with the values from tag 2. If multiple files are selected, the tags of the files are directly set.
it: <guibutton>Da tag 2</guibutton>: i campi del tag 1 sono impostati dai valori corrispondenti nel tag 2. Se è selezionato un singolo file, i controlli della &GUI; sono riempiti con i valori del tag 2. Se sono selezionati più file, i tag dei file sono impostati direttamente.
ru: <guibutton>Из тега 2</guibutton>: значения полей тега 1 устанавливаются из соответствующих значений тега 2. Если выбран один файл, пункты графического интерфейса будут заполнены значениями из тега 2. Если выбрано несколько файлов, устанавливаются непосредственно теги этих файлов.
sv: <guibutton>Från tagg 2</guibutton>: Fälten i tagg 1 tilldelas från motsvarande värden i tagg 2. Om en enda fil är markerad, fylls det grafiska användargränssnittets kontroller med värdena från tagg 2. Om flera filer är markerade, tilldelas filernas taggar direkt.

source: <guibutton>Copy</guibutton>: The copy buffer is filled with the Tag 1 values. Only values with checked check box will be used in subsequent Paste commands.
it: <guibutton>Copia</guibutton>: il buffer di copia è riempito con i valori di Tag 1. Solo i valori con la casella marcata saranno utilizzati nei seguenti comandi Incolla.
ru: <guibutton>Копировать</guibutton>: скопировать в буфер обмена значения тега 1. В следующих командах вставки будут использоваться только значения из пунктов с установленным флажком.
sv: <guibutton>Kopiera</guibutton>: Kopieringsbufferten fylls i med värden från Tagg 1. Bara värden med markerade kryssrutor används i efterföljande kommandon för att klistra in.

source: <guibutton>Paste</guibutton>: Pastes the values from the copy buffer into the &GUI; controls.
it: <guibutton>Incolla</guibutton>. incolla i valori dal buffer di copia nei controlli della &GUI;.
ru: <guibutton>Вставить</guibutton>: вставить данные из буфера обмена в пункты графического интерфейса.
sv: <guibutton>Klistra in</guibutton>: Klistrar in värdena från kopieringsbufferten till de grafiska användargränssnittets kontroller.

source: <guibutton>Remove</guibutton>: This will set all &GUI; controls to their empty values which results in removing all values. The saved file will then contain no tag 1.
it: <guibutton>Rimuovi</guibutton>: questo imposterà tutti i controlli della &GUI; a un valore vuoto che si traduce nella rimozione di tutti i valori. Il file salvato non conterrà tag 1.
ru: <guibutton>Убрать</guibutton>: очистить все значения пунктов графического интерфейса. Если после этого действия сохранить редактируемый файл, в нём будет отсутствовать тег 1.
sv: <guibutton>Ta bort</guibutton>: Tilldelar alla grafiska användargränssnittets kontroller sina tomma värden, vilket leder till att alla värden tas bort. Den sparade filen innehåller då inte någon tagg 1.

source: The &GUI; controls function in the same way as described for the <guilabel>Tag 1</guilabel> section, but the size of the strings is not limited.
it: I controlli della &GUI; funzionano nello stesso modo a quanto descritto per la sezione <guilabel>Tag 1</guilabel>, ma la dimensione delle stringhe non è limitata.
ru: Графический интерфейс позволяет управлять этим параметром таким же способом, который описан в разделе <guilabel>Тег 1</guilabel>, но при этом размеры строк не ограничены.
sv: Det grafiska användargränssnittet styr funktionen på samma sätt som beskrivs för <guilabel>Tagg 1</guilabel> sektionen, men strängarnas storlek är inte begränsad.

source: For the tag 2 <guilabel>Genre</guilabel> you can also use your own names besides the genres listed in the combo box, just type the name into the line edit.
it: Per il tag 2 <guilabel>Genere</guilabel> è possibile utilizzare anche i proprio nomi oltre ai generi elencati nella casella combinata, basta digitare il nome nella riga di modifica.
ru: При заполнении поля тега 2 <guilabel>Жанр</guilabel> также возможно использовать собственные названия помимо жанров, указанных в раскрывающемся списке; достаточно просто ввести название жанра в строку редактирования.
sv: För <guilabel>Genre</guilabel> i tagg 2 kan du också använda dina egna namn förutom genrer listad i kombinationsrutan, skriv bara in namnet på redigeringsraden.

source: The tag 2 cannot only contain the same values as the tag 1, the format is built in a flexible way from several frames which are themselves composed of several fields. The tag 2 table shows all the frames which are available in the selected file.
it: Il tag 2 non può contenere solo gli stessi valori del tag 1, il formato è costruito in modo flessibile da più frame che sono essi stessi composti da più campi. La tabella tag 2 mostra tutti i frame disponibili nel file selezionato.
ru: Тег 2 не может содержать только те же значения, что и тег 1. Формат гибко строится из нескольких фреймов, которые сами состоят из нескольких полей. Таблица тега 2 показывает все фреймы, которые доступны в выбранном файле.
sv: Tagg 2 kan inte bara innehålla samma värden som tagg 1, utan formatet är uppbyggt på ett flexibelt sätt från flera ramar som i sin tur består av flera fält. Tabellen över tagg 2 visar alla ramar som är tillgängliga i den markerade filen.
