Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: <guibutton>Edit</guibutton>: This will open a window which allows one to edit all fields of the selected frame. If multiple files are selected, the edited fields are applied to all selected files which contain such a frame.
it: <guibutton>Modifica</guibutton>: questo aprirà una finestra che consente di modificare tutti i campi del frame selezionato. Se più file sono selezionati, i campi modificati sono applicati a tutti i file selezionati che contengono tale frame.
ru: <guibutton>Изменить</guibutton>: открывает окно, позволяющее редактировать все поля выделенного фрейма. Если выбрано несколько файлов, изменения значений полей будут применяться ко всем выбранным файлам, которые содержат этот фрейм.
sv: <guibutton>Redigera</guibutton>: Öppnar ett fönster som gör att man kan redigera alla fält i den markerade ramen. Om flera filer är markerade, tilldelas de redigerade fälten till alla markerade filer som innehåller en sådan ram.

source: <guibutton>Add</guibutton>: A requester to select the frame type will appear and a frame of the selected type can be edited and added to the file. This works also to add a frame to multiple selected files.
it: <guibutton>Aggiungi</guibutton>: apparirà un richiedente per selezionare il tipo di frame e un frame del tipo selezionato può essere modificato e aggiunto al file. Questo funziona anche per aggiungere un frame a più file selezionati.
ru: <guibutton>Добавить</guibutton>: открывает окно для указания типа фрейма, который можно будет изменить и добавить в файл. Эта функция также работает при выборе нескольких файлов.
sv: <guibutton>Lägg till</guibutton>: En fråga om att välja ramtyp dyker upp och en ram av den valda typen kan redigeras och läggas till i filen. Det fungerar också för att lägga till en ram i flera markerade filer.

source: <guibutton>Delete</guibutton>: Deletes the selected frame in the selected files.
it: <guibutton>Elimina</guibutton>: elimina il frame selezionato nei file selezionati.
ru: <guibutton>Удалить</guibutton>: удаляет выбранный фрейм в выбранных файлах.
sv: <guibutton>Ta bort</guibutton>: Tar bort den markerade ramen i de markerade filerna.

source: <guilabel>Drag album artwork here</guilabel> is shown if the file does not contain embedded cover art. A picture can be added using drag and drop from a browser or file manager and will be displayed here. Picture frames can be edited or added by double clicking on this control.
it: <guilabel>Trascina qui la copertina dell'album</guilabel> viene visualizzato se il file non contiene una copertina incorporata. Un'immagine può essere aggiunta utilizzando il trascinamento della selezione da un browser o da un file manager e sarà visualizzata qui. Le cornici possono essere modificate o aggiunte facendo doppio clic su questo controllo.
ru: Надпись <guilabel>Перетащите сюда обложку альбома</guilabel> отобразится в том случае, если в файле отсутствует встроенная обложка альбома. Чтобы добавить изображение, перетащите его мышью из браузера или диспетчера файлов; после этого оно отобразится вместо надписи. Чтобы изменить или добавить фрейм, дважды щёлкните левой кнопкой мыши по соответствующему полю.
sv: <guilabel>Dra album-omslag hit</guilabel> visas om filen inte innehåller något inbäddat omslag. En bild kan läggas till genom att använda dra och släpp från en filbläddrare eller filhanterare och visas här. Bildramar kan också redigeras eller läggas till genom att dubbelklicka på kontrollen.

source: Some files can have more than two tags, and a third tag section is visible. The following file types can have such a <guilabel>Tag 3</guilabel> section:
it: Alcuni file possono avere più di due tag ed è visibile una terza sezione di tag. I seguenti tipi di file possono avere una sezione <guilabel>Tag 3</guilabel>:
ru: Некоторые файлы могут содержать более двух тегов. В этом случае будет отображаться раздел третьего тега. Раздел <guilabel>Тег 3</guilabel> могут иметь следующие типы файлов:
sv: Visa filer kan ha mer än två taggar, och en tredje taggsektion är synlig. Följande filtyper kan ha en sådan <guilabel>Tagg 3</guilabel> sektion:

source: MP3 files can have an ID3v1.1 tag, an ID3v2 (2.3.0 or 2.4.0) tag and in the third section an APE tag. Such APE tags are used for replay gain information. In the <guilabel>Tag 3</guilabel> section, this information is visible, and the APE tag can be removed with the <guibutton>Remove</guibutton> button.
it: I file MP3 possono avere un tag ID3v1.1, un tag ID3v2 (2.3.0 o 2.4.0) e nella terza sezione un tag APE. Tali tag APE sono utilizzati per ottenere informazioni sul guadagno di riproduzione. Nella sezione <guilabel>Tag 3</guilabel>, queste informazioni sono visibili e il tag APE può essere rimosso con il pulsante <guibutton>Rimuovi</guibutton>.
ru: Файлы в формате MP3 могут иметь тег ID3v1.1, ID3v2 (2.3.0 или 2.4.0) и в третьем разделе тег APE. Такие теги предназначены для хранения информации о выравнивании громкости. Эта информация отображается в разделе <guilabel>Тег 3</guilabel>, а тег APE возможно удалить с помощью кнопки <guibutton>Убрать</guibutton>.
sv: MP3-filer kan ha en ID3v1.1-tagg, en ID3v2 (2.3.0 eller 2.4.0)-tagg och en APE-tagg i den tredje sektionen. Sådan APE-taggar används för information om uppspelningsförstärkning. I sektionen <guilabel>Tagg 3</guilabel> är informationen synlig, och APE-taggen kan tas bort med knappen <guibutton>Ta bort</guibutton>.

source: The RIFF INFO chunk of WAV files is available in the <guilabel>Tag 3 </guilabel> section because the <guilabel>Tag 1</guilabel> section is dedicated to ID3v1.1 tags and handles their restrictions. The <guilabel>Tag 2</guilabel> is still used for ID3v2.4.0 tags, which are also supported for WAV files, but RIFF INFO chunks seem to be supported better.
it: Il blocco RIFF INFO dei file WAV è disponibile nella sezione <guilabel>Tag 3</guilabel> perché la sezione <guilabel>Tag 1</guilabel> è dedicata ai tag ID3v1.1 e gestisce le loro restrizioni. Il <guilabel>Tag 2</guilabel> è ancora utilizzato per i tag ID3v2.4.0, che sono supportati anche per i file WAV, ma i blocchi RIFF INFO sembrano essere supportati meglio.
ru: Фрагменты RIFF INFO в файлах WAV хранятся в разделе <guilabel>Тег 3 </guilabel>, потому что раздел <guilabel>Тег 1</guilabel> предназначен для тегов ID3v1.1 с соответствующими ограничениями. Раздел <guilabel>Тег 2</guilabel> используется для тегов ID3v2.4.0, поддержка которых также предусмотрена в файлах WAV, но поддержка фрагментов RIFF INFO, по всей видимости, реализована лучше.
sv: RIFF INFO segmentet i WAV-filer är tillgängligt i sektionen <guilabel>Tagg 3 </guilabel> eftersom sektionen <guilabel>Tagg 1</guilabel> är tillägnad ID3v1.1-taggar och hanterar deras begränsningar. <guilabel>Tagg 2</guilabel> används fortfarande för ID3v2.4.0-taggar, som också stöds för WAV-filer, men RIFF INFO segment verkar stödjas bättre.

source: FLAC files normally use a Vorbis comment for their meta data. However, there are FLAC files which have ID3v1 and ID3v2 tags, which can be found in the <guilabel>Tag 1</guilabel> and <guilabel>Tag 3</guilabel> sections. ID3 tags in FLAC files are only supported by TagLib, therefore the OggFlacMetadata plugin has to be disabled in the <guilabel>Plugins</guilabel> tab of the <link linkend="configure-kid3">settings</link>.
it: I file FLAC normalmente utilizzano un commento Vorbis per i loro metadati. Tuttavia, ci sono file FLAC che hanno tag ID3v1 e ID3v2, che si trovano nelle sezioni <guilabel>Tag 1</guilabel> e <guilabel>Tag 3</guilabel>. I tag ID3 nei file FLAC sono supportati solo da TagLib, pertanto l'estensione OggFlacMetadata deve essere disabilitata nella scheda <guilabel>Estensioni</guilabel> delle <link linkend="configure-kid3">impostazioni</link>.
ru: Файлы в формате FLAC обычно используют комментарии Vorbis для своих метаданных. Однако существуют файлы в формате FLAC, которые содержат теги ID3v1 и ID3v2, находящиеся в разделах <guilabel>Тег 1</guilabel> и <guilabel>Тег 3</guilabel>. Теги ID3 в файлах формата FLAC поддерживаются только библиотекой TagLib, поэтому модуль OggFlacMetadata должен быть отключён (вкладка <guilabel>Модули</guilabel> в окне <link linkend="configure-kid3">настройки параметров &kid3;</link>).
sv: FLAC-filer använder normalt en Vorbis-kommentar för sin metadata. Dock finns det FLAC-filer som har ID3v1- och ID3v2-taggar, som finns i sektionerna <guilabel>Tagg 1</guilabel> och <guilabel>Tagg 3</guilabel>. ID3-taggar i FLAC-filer stöds bara av TagLib, därför måste insticksprogrammet QggFlacMetadata inaktiveras under fliken <guilabel>Insticksprogram</guilabel> i <link linkend="configure-kid3">inställningarna</link>.

source: The &GUI; controls work in the same way as in the <guilabel>Tag 2</guilabel> section.
it: I controlli della &GUI; funzionano come nella sezione <guilabel>Tag 2</guilabel>.
ru: Пункты графического интерфейса работают так же, как и в разделе <guilabel>Тег 2</guilabel>.
sv: De grafiska användargränssnittets kontroller fungerar på samma sätt som i <guilabel>Tagg 2</guilabel> sektionen.

source: Frame List
it: Elenco frame
ru: Список фреймов
sv: Ramlista

source: &kid3; can edit most of the frames for all of the supported file types. Some frames are accessed using unified names, so that they can be exchanged between files with different formats. Frames which are not unified can be accessed as format specific frames.
it: &kid3; può modificare la maggior parte dei frame per tutti i tipi di file supportati. È possibile accedere ad alcuni frame utilizzando nomi unificati, in modo che possano essere scambiati tra file con formati diversi. I frame che non sono unificati sono accessibili come frame specifici del formato.
ru: &kid3; позволяет редактировать большинство фреймов для всех поддерживаемых типов файлов. Определение некоторых фреймов производится с помощью унифицированных имён, что позволяет обмениваться данными между файлами разных форматов. Не унифицированные фреймы определяются как фреймы, специфичные для формата.
sv: &kid3; kan redigera de flesta ramar för alla filtyper som stöds. Åtkomst av vissa ramar görs med gemensamma namn, så att de kan utbytas mellan filer med olika format. Ramar som inte är gemensamma kan kommas åt som formatspecifika ramar.

source: Mapping of Unified Frame Types to Various Formats
it: Associazione dei tipi di frame unificati a vari formati
ru: Привязки унифицированных названий фреймов в различных форматах
sv: Översättning av gemensamma ramtyper till diverse format

source: Unified
it: Unificato
ru: Унифицированное имя
sv: Gemensam

source: <entry>Title</entry>
it: <entry>Titolo</entry>
ru: <entry>Заголовок</entry>

source: <literal>Title</literal>
it: <literal>Titolo</literal>

source: Artist
it: Artista
ru: Исполнитель

source: <literal>Author</literal>
it: <literal>Autore</literal>

source: Comment
it: Commento
ru: Комментарий

source: <literal>Description</literal>
it: <literal>Descrizione</literal>

source: Date
it: Data
ru: Дата

source: Track Number
it: Numero traccia
ru: Номер дорожки

source: <literal>IPRT</literal> or <literal>ITRK</literal>
it: <literal>IPRT</literal> o <literal>ITRK</literal>
ru: <literal>IPRT</literal> или <literal>ITRK</literal>
sv: <literal>IPRT</literal> eller <literal>ITRK</literal>

source: Genre
it: Genere
ru: Жанр

source: Album Artist
it: Artista dell'album
ru: Исполнитель альбома

source: Arranger
it: Arrangiatore
ru: Аранжировщик

source: <entry>Author</entry>
it: <entry>Autore</entry>
ru: <entry>Автор</entry>

source: Catalog Number
it: Numero di catalogo
ru: Номер по каталогу

source: Composer
it: Compositore
ru: Композитор

source: Conductor
it: Direttore
ru: Дирижёр

source: <entry>Description</entry>
it: <entry>Descrizione</entry>
ru: <entry>Описание</entry>

source: Disc Number
it: Numero disco
ru: Номер диска

source: disk
it: disco

source: Encoded-by
it: Codificato da
ru: Кодировщик

source: Encoder Settings
it: Impostazioni codificatore
ru: Параметры кодировщика

source: Encoding Time
it: Tempo di codifica
ru: Время кодирования

source: Grouping
it: Raggruppamento
ru: Группировка

source: Initial Key
it: Chiave iniziale
ru: Начальная тональность

source: Language
it: Lingua
ru: Язык

source: Lyricist
it: Paroliere
ru: Автор текста

source: TEXT
it: TESTO

source: Lyrics
it: Testi
ru: Текст песни

source: LYRICS
it: TESTI

source: Media
it: Supporto
ru: Носители

source: Mood
it: Atmosfera
ru: Настроение

source: Original Album
it: Album originale
ru: Исходный альбом

source: Original Artist
it: Artista originale
ru: Исходный исполнитель

source: Original Date
it: Data originale
ru: Исходная дата

source: Performer
it: Interprete
ru: Исполнитель

source: Picture
it: Immagine
ru: Изображение

source: Publisher
it: Editore
ru: Издатель

source: Rating
it: Valutazione
ru: Оценка

source: rate
it: valutazione

source: Release Country
it: Paese di uscita
ru: Страна выпуска

source: Release Date
it: Data di uscita
ru: Дата выпуска

source: Sort Album
it: Ordinamento per album
ru: Упорядочить по альбомам

source: Sort Album Artist
it: Ordinamento per artista dell'album
ru: Упорядочить по исполнителям альбомов

source: Sort Artist
it: Ordinamento per artista
ru: Упорядочить по исполнителям

source: Sort Composer
it: Ordinamento per compositore
ru: Упорядочить по композиторам

source: Sort Name
it: Ordinamento per nome
ru: Упорядочить по именам

source: Subtitle
it: Sottotitolo
ru: Подзаголовок

source: Website
it: Sito web
ru: Сайт

source: WEBSITE
it: SITOWEB

source: Work
it: Lavoro
ru: Работа

source: WWW Audio File
it: File audio WWW
ru: Веб-страница аудиофайла

source: WWW Audio Source
it: Forni audio WWW
ru: Веб-страница источника аудио

source: Remarks concerning the mappings to unified frame names:
it: Osservazioni relative all'associazione ai nomi di frame unificati:
ru: Заметки по поводу привязок унифицированных названий фреймов:
sv: Anmärkningar rörande översättningarna till gemensamma ramnamn:

source: The number of unified frame names is limited by the fact that a sensible mapping shall be possible for all supported file formats. Most tags support frames with arbitrary names; these will be used if no specific frame is available (<abbrev>e.g.</abbrev> the names in uppercase in the column MP4). If no such possibility exists, some frame types may not be supported for the format, <abbrev>e.g.</abbrev> Author and Performer for ASF (WMA).
it: Il numero di nomi di frame unificati è limitato dal fatto che un'associazione ragionevole deve essere possibile per tutti i formati di file supportati. La maggior parte dei tag supporta frame con nomi arbitrari; questi saranno utilizzati se non è disponibile alcun frame specifico (<abbrev>ad es.</abbrev> i nomi in maiuscolo nella colonna MP4). Se non esiste tale possibilità, alcuni tipi di frame potrebbero non essere supportati per il formato, <abbrev>ad es.</abbrev> autore e interprete per ASF (WMA).
ru: Количество унифицированных названий фреймов ограничено возможностью установки надёжных соответствий для всех поддерживаемых форматов файлов. Большинство тегов поддерживает фреймы с произвольными названиями; такие будут использованы в случае, если не будет доступен тот или иной особый фрейм (например, имена в верхнем регистре в столбце MP4). Если такой возможности нет, некоторые типы фреймов могут не поддерживаться для определённого формата, например, «Автор» и «Исполнитель» для ASF (WMA).
sv: Antalet gemensamma ramnamn är begränsat av det faktum att en rimlig avbildning måste vara möjlig för alla filformat som stöds. De flesta taggar stöder ramar med godtyckliga namn, de används om ingen specifik ram är tillgänglig (t.ex. namnen med stora bokstäver i kolumnen MP4). Om ingen sådan möjlighet finns, kanske inte vissa ramtyper stöds för formatet, t.ex. Author och Performer för ASF (WMA).

source: The mappings are not chosen arbitrarily, they are geared to the usage of the frames in other applications and devices. Thus the ID3v2 frame "TPE2 - Band/orchestra/accompaniment" does not suggest its usage as Album Artist, but this is commonly used. The actual meaning for ID3v2 on the other hand is the reason why this frame is used for the orchestra when importing (<abbrev>e.g.</abbrev> from Discogs), although this may seem a bit strange for other tag formats.
it: Le associazioni non sono scelte in modo arbitrario, ma sono orientate all'utilizzo dei frame in altre applicazioni e dispositivi. Pertanto il frame ID3v2 "TPE2 - Band/orchestra/accompagnamento" non suggerisce il suo utilizzo come artista dell'album, ma questo è comunemente utilizzato. Il vero significato di ID3v2, d'altra parte, è il motivo per cui questo frame cornice viene utilizzato per l'orchestra durante l'importazione (<abbrev>ad es.</abbrev> da Discogs), sebbene ciò possa sembrare un po 'strano per altri formati di tag.
ru: Привязки выбираются не случайным образом, они ориентированы на использование фреймов в других приложениях и устройствах. Например, фрейм тега ID3v2 «TPE2 - Группа/оркестр/аккомпанемент» не предполагает использование в поле исполнителя альбома, но такое использование довольно распространено. С другой стороны, фактическое назначение ID3v2 обуславливает использование этого фрейма для поля оркестра при импорте (например, из Discogs), хоть это и может казаться несколько странным для других форматов тегов.
sv: Avbildningarna är inte godtyckligt valda, de är inriktade på användning av ramarna i andra program och apparater. Sålunda tyder inte ID3v2-ramen "TPE2 - Band/orkester/ackompanjemang" på en användning som Album Artist, men det används ofta. Den verkliga betydelsen av ID3v2 är å andra sidan orsaken till att ramen används för orkestern vid import (t.ex. från Discogs), även om det kan verka lite konstigt för andra taggformat.

source: The mappings are not always bijective. So ID3v2.3 uses an IPLS frame for both Arranger and Performer. When reading back, both frames are displayed as "Arranger".
it: Le associazioni non sono sempre biettive. Per cui, ID3v2.3 utilizza un frame IPLS sia per Arrangiatore che per Interprete. Durante la lettura, entrambi i frame sono visualizzati come «Arrangiatore».
ru: Привязки не всегда взаимно однозначны. Например, ID3v2.3 использует фрейм IPLS как для поля «Аранжировщик», так и для поля «Исполнитель». При обратном преобразовании оба фрейма будут отображаться как «Аранжировщик».
sv: Avbildningarna är inte alltid bijektiva. Så ID3v2.3 använder en IPLS-ram för både Arranger och Performer. Vid återläsning visas båda ramarna som "Arranger".

source: The frames Arranger and Performer use a particular format for their contents: "involvement 1|involvee 1|involvement 2|involvee 2|...", for instance "Chorus Master|Ernst Dunshirn|Soprano Vocals|Anna Netrebko". This will create IPLS (ID3v2.3) or TIPL/TMCL (ID3v2.4) frames with a string list in the specified format (the "|" is used as a separator between the strings). Values in this format are also set when importing data from servers which offer this information.
it: I frame Arrangiatore e Interprete usano un formato particolare per i loro contenuti: «partecipazione 1|partecipante 1|partecipazione 2|partecipante 2|...», ad esempio «Maestro del coro|Ernst Dunshirn|Voce soprano|Anna Netrebko». Ciò creerà i frame IPLS (ID3v2.3) o TIPL/TMCL (ID3v2.4) con un elenco di stringhe nel formato specificato ("|" è utilizzato come separatore tra le stringhe). I valori in questo formato sono impostati anche quando si importano dati da server che offrono queste informazioni.
ru: Фреймы «Аранжировщик» и «Исполнитель» используют определённый формат для своего содержимого: «вклад 1|автор 1|вклад 2|автор 2|...», например, «Хормейстер|Ernst Dunshirn|Сопрано-вокал|Анна Нетребко». Будут созданы фреймы IPLS (ID3v2.3) или TIPL/TMCL (ID3v2.4) со списком строк в указанном формате (разделителем строк будет символ «|») . Значения в этом формате также устанавливаются при импорте данных с серверов, предоставляющих эту информацию.
sv: Ramarna Arranger och Performer använder ett särskilt format för sina innehåll: "medverkan 1|medverkande 1|medverkan 2|medverkade 2|...", exempelvis "Körledare|Ernst Dunshirn|Sångsopran|Anna Netrebko". Det skapar IPLS (ID3v2.3)- eller TIPL/TMCL (ID3v2.4)-ramar med en stränglista med det angivna formatet ("|" används som avskiljare mellan strängarna). Värden med det här formatet används också när data importeras från servrar som erbjuder informationen.

source: To explicitly use a specific frame name which conflicts with a unified frame name, prepend an exclamation mark. For example, adding a frame of type "<replaceable>Media</replaceable>" to a Vorbis comment will create a frame with name "<literal>SOURCEMEDIA</literal>" because of the unified type mapping. In order to add a frame with name "<literal>MEDIA</literal>" and not "<literal>SOURCEMEDIA</literal>", use "<literal>!MEDIA</literal>" to force the explicit name.
it: Per utilizzare esplicitamente un nome di frame specifico che è in conflitto con un nome di frame unificato, anteporre un punto esclamativo. Ad esempio, l'aggiunta di un frame di tipo «<replaceable>Media</replaceable>» a un commento di Vorbis creerà un frame con il nome «<literal>SOURCEMEDIA</literal>» a causa dell'associazione del tipo unificata. Per aggiungere un frame con il nome «<literal>MEDIA</literal>» e non «<literal>SOURCEMEDIA</literal>», utilizzare «<literal>!MEDIA</literal>» per forzare il nome esplicito.
ru: Чтобы явно использовать конкретное название фрейма, которое конфликтует с унифицированным названием, добавьте перед самим названием восклицательный знак. Например, добавление к комментарию Vorbis фрейма «<replaceable>Media</replaceable>» приведёт к созданию фрейма под названием «<literal>SOURCEMEDIA</literal>» из-за привязки к унифицированному типу. Чтобы добавить именно фрейм «<literal>MEDIA</literal>» (а не «<literal>SOURCEMEDIA</literal>»), следует указать «<literal>!MEDIA</literal>»; это позволит принудительно задать именно такое название фрейма.
sv: För explicit använda ett specifikt ramnamn som har en konflikt med ett gemensamt ramnamn, inled med ett utropstecken. Om exempelvis en ram av typ "<replaceable>Media</replaceable>" i en Vorbis-kommentar skapar en ram vid namn "<literal>SOURCEMEDIA</literal>" på grund av den gemensamma typavbildningen. För att lägga till en ram vid namn "<literal>MEDIA</literal>" och inte "<literal>SOURCEMEDIA</literal>", använd "<literal>!MEDIA</literal>" för att tvinga användning av det explicita namnet.

source: Synchronized Lyrics and Event Timing Codes
it: Testi sincronizzati e codici di temporizzazione degli eventi
ru: Синхронизация текста песни с временными кодами событий
sv: Synkroniserad sångtext och händelsetidskoder
