Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: <shortcut> <keycombo>&Alt;<keycap>Up</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Previous File</guimenuitem>
it: <shortcut> <keycombo>&Alt;<keycap>Su</keycap></keycombo> </shortcut> <guimenu>Modifica</guimenu> <guimenuitem>File precedente</guimenuitem>
ru: <shortcut> <keycombo>&Alt;<keycap>Вверх</keycap></keycombo> </shortcut> <guimenu>Правка</guimenu> <guimenuitem>Предыдущий файл</guimenuitem>
sv: <shortcut> <keycombo>&Alt;<keycap>Uppåtpil</keycap></keycombo> </shortcut> <guimenu>Redigera</guimenu> <guimenuitem>Föregående fil</guimenuitem>

source: Selects the previous file.
it: Seleziona il file precedente.
ru: Выделяет предыдущий файл.
sv: Väljer föregående fil

source: <shortcut> <keycombo>&Alt;<keycap>Down</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Next File</guimenuitem>
it: <shortcut> <keycombo>&Alt;<keycap>Giù</keycap></keycombo> </shortcut> <guimenu>Modifica</guimenu> <guimenuitem>File successivo</guimenuitem>
ru: <shortcut> <keycombo>&Alt;<keycap>Вниз</keycap></keycombo> </shortcut> <guimenu>Правка</guimenu> <guimenuitem>Следующий файл</guimenuitem>
sv: <shortcut> <keycombo>&Alt;<keycap>Neråtpil</keycap></keycombo> </shortcut> <guimenu>Redigera</guimenu> <guimenuitem>Nästa fil</guimenuitem>

source: Selects the next file.
it: Seleziona il file successivo.
ru: Выделяет следующий файл.
sv: Väljer nästa fil

source: <shortcut> <keycombo>&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem>
it: <shortcut> <keycombo>&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Modifica</guimenu> <guimenuitem>Trova...</guimenuitem>
ru: <shortcut> <keycombo>&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Правка</guimenu> <guimenuitem>Найти...</guimenuitem>
sv: <shortcut> <keycombo>&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Redigera</guimenu> <guimenuitem>Sök...</guimenuitem>

source: Find strings in the file names and the tags. The <guilabel>Find</guilabel> dialog is a subset of the <guilabel>Replace</guilabel> dialog, which is described below.
it: Trova le stringhe nei nomi dei file e nei tag. La finestra <guilabel>Trova</guilabel> è un sottoinsieme della finestra <guilabel>Sostituisci</guilabel>, che è descritta di seguito.
ru: Производит поиск строк в именах файлов и тегах. Диалог <guilabel>Найти</guilabel> — это часть диалога <guilabel>Заменить</guilabel>, описание которого приводится далее.
sv: Sök efter strängar i filnamnen och taggarna. Dialogrutan <guilabel>Sök</guilabel> är en delmängd av dialogrutan <guilabel>Ersätt</guilabel>, som beskrivs nedan.

source: <shortcut> <keycombo>&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Replace...</guimenuitem>
it: <shortcut> <keycombo>&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Modifica</guimenu> <guimenuitem>Sostituisci...</guimenuitem>
ru: <shortcut> <keycombo>&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Правка</guimenu> <guimenuitem>Заменить...</guimenuitem>
sv: <shortcut> <keycombo>&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Redigera</guimenu> <guimenuitem>Ersätt...</guimenuitem>

source: This function opens a dialog to find and replace strings in the file names and the tags. The set of frames where the search is performed can be restricted by deactivating the <guilabel>Select all</guilabel> check box and selecting the frames which shall be searched. There are also search options available to search backwards, case sensitively, and to use regular expressions.
it: Questa funzione apre una finestra per trovare e sostituire le stringhe nei nomi dei file e nei tag. L'insieme di frame in cui viene eseguita la ricerca può essere limitato disattivando la casella di controllo <guilabel>Seleziona tutto</guilabel> e selezionando i frame da cercare. Ci sono anche opzioni di ricerca disponibili per cercare all'indietro, tenendo conto delle maiuscole e per usare espressioni regolari.
ru: Этот пункт меню открывает диалог для поиска и замены строк в именах файлов и тегах. Чтобы ограничить набор фреймов для проведения поиска, снимите флажок <guilabel>Выбрать все</guilabel> и выделите фреймы, в которых нужно провести поиск. Также доступны параметры для поиска в обратном направлении, с учётом регистра и использованием регулярных выражений.
sv: Funktionen öppnar en dialogruta för att hitta och ersätta strängar i filnamnen och taggarna. Uppsättningen av ramar där sökningen utförs kan begränsas genom att inaktivera kryssrutan <guilabel>Markera alla</guilabel> och markera alla ramar som ska sökas igenom. Det finns också sökalternativ tillgängliga för att söka bakåt, skiftlägesokänsligt och för att använda reguljära uttryck.

source: Depending on the number of files, the search might take some time, therefore it can be aborted by closing the dialog.
it: In base al numero di file, la ricerca potrebbe richiedere del tempo, perciò può essere interrotta chiudendo la finestra.
ru: В зависимости от количества файлов поиск может занять некоторое время; чтобы прервать поиск, закройте диалог.
sv: Beroende på antalet filer kan sökningen ta en stund, och därför kan den avbrytas genom att stänga dialogrutan.

source: The Tools Menu
it: Il menu Strumenti
ru: Меню «Сервис»
sv: Menyn Verktyg

source: <guimenu>Tools</guimenu> <guimenuitem>Apply Filename Format</guimenuitem>
it: <guimenu>Strumenti</guimenu> <guimenuitem>Applica formato nome file</guimenuitem>
ru: <guimenu>Сервис</guimenu> <guimenuitem>Применить формат имени файла</guimenuitem>
sv: <guimenu>Verktyg</guimenu> <guimenuitem>Verkställ filnamnsformat</guimenuitem>

source: When <guilabel>Automatically apply format</guilabel> is switched off for the filename format in the configuration dialog, this menu item can be used to <action>apply the configured format to the names of the selected files</action>. This can also be used to check whether the file names conform with the configured format by applying the format to all saved files and then checking if any files were changed (and therefore marked with a disk symbol in the file listbox).
it: Quando <guilabel>Applica automaticamente il formato</guilabel> è disattivata per il formato del nome file nella finestra di configurazione, questa voce di menu può essere utilizzata per <action>applicare il formato configurato ai nomi dei file selezionati</action>. Questo può anche essere utilizzato per verificare se i nomi dei file sono conformi al formato configurato applicando il formato a tutti i file salvati e quindi controllando se alcuni file sono stati modificati (e quindi marcati con il simbolo di un disco nell'elenco dei file).
ru: Когда в диалоге настройки отключён параметр <guilabel>Автоматически применять формат</guilabel> для формата имени файла, этот пункт меню позволяет <action>применить указанный формат к именам выбранных файлов</action>. Эта функция также позволяет проверить соответствие имён файлов настроенному формату путём применения формата ко всем сохранённым файлам и последующей проверки того, были ли какие-либо файлы изменены (и, следовательно, отмечены значком дискеты в списке файлов).
sv: När <guilabel>Verkställ format automatiskt</guilabel> stängs av för filnamnsformatet i inställningsdialogrutan, kan menyalternativet användas för att <action>verkställa det inställda formatet för de markerade filernas namn</action>. Det kan också användas för att kontrollera om filnamnen motsvarar det inställda formatet genom att verkställa formatet för alla sparade filer och sedan kontrollera om några filer ändrades (och därför markerades med en skivsymbol i fillistrutan).

source: <guimenu>Tools</guimenu> <guimenuitem>Apply Tag Format</guimenuitem>
it: <guimenu>Strumenti</guimenu> <guimenuitem>Applica formato tag</guimenuitem>
ru: <guimenu>Сервис</guimenu> <guimenuitem>Применить формат тега</guimenuitem>
sv: <guimenu>Verktyg</guimenu> <guimenuitem>Verkställ taggformat</guimenuitem>

source: When <guilabel>Automatically apply format</guilabel> is switched off for the tag format in the configuration dialog, this menu item can be used to <action>apply the configured format to the tags of the selected files</action>. This can also be used to check whether the tags conform with the configured format by applying the format to all saved files and then checking if any files were changed (and therefore marked with a disk symbol in the file listbox).
it: Quando <guilabel>Applica automaticamente il formato</guilabel> è disattivata per il formato di tag nella finestra di configurazione, questa voce di menu può essere utilizzata per <action>applicare il formato configurato ai tag dei file selezionati</action>. Questo può anche essere utilizzato per verificare se i tag sono conformi al formato configurato applicando il formato a tutti i file salvati e quindi controllando se alcuni file sono stati modificati (e quindi marcati con il simbolo di un disco nell'elenco dei file).
ru: Когда в диалоге настройки отключён параметр <guilabel>Автоматически применять формат</guilabel> для формата тега, этот пункт меню позволяет <action>применить указанный формат к тегам выбранных файлов</action>. Эта функция также позволяет проверить соответствие тегов настроенному формату путём применения формата ко всем сохранённым файлам и последующей проверки того, были ли какие-либо файлы изменены (и, следовательно, отмечены значком дискеты в списке файлов).
sv: När <guilabel>Verkställ format automatiskt</guilabel> stängs av för taggformatet i inställningsdialogrutan, kan menyalternativet användas för att <action>verkställa det inställda formatet för taggarna i de markerade filerna</action>. Det kan också användas för att kontrollera om taggarna motsvarar det inställda formatet genom att verkställa formatet för alla sparade filer och sedan kontrollera om några filer ändrades (och därför markerades med en skivsymbol i fillistrutan).

source: <guimenu>Tools</guimenu> <guimenuitem>Apply Text Encoding</guimenuitem>
it: <guimenu>Strumenti</guimenu><guimenuitem>Applica codifica del testo</guimenuitem>
ru: <guimenu>Сервис</guimenu> <guimenuitem>Применить кодировку текста</guimenuitem>
sv: <guimenu>Verktyg</guimenu> <guimenuitem>Verkställ textkodning</guimenuitem>

source: Sets the <guilabel>Text encoding</guilabel> selected in <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kid3;... </guimenuitem><guimenuitem>Tags section</guimenuitem><guimenuitem>Tag 2 tab</guimenuitem></menuchoice> for all selected files. If UTF8 is selected, UTF16 will be used for ID3v2.3.0 tags because UTF8 is not supported for this format.
it: Imposta la <guilabel>Codifica del testo</guilabel> selezionata in <menuchoice><guimenu>Impostazioni</guimenu><guimenuitem>Configura &kid3;...</guimenuitem><guimenuitem>Sezione tag</guimenuitem> <guimenuitem>Scheda Tag 2</guimenuitem></menuchoice> per tutti i file selezionati. Se UTF8 è selezionato, UTF16 sarà utilizzato per i tag ID3v2.3.0 poiché UTF8 non è supportato per questo formato.
ru: При использовании этой функции устанавливается <guilabel>Кодировка текста</guilabel>, указанная на вкладке <menuchoice><guimenu>Настройка</guimenu><guimenuitem>Настроить &kid3;... </guimenuitem><guimenuitem>Теги</guimenuitem><guimenuitem>Тег 2</guimenuitem></menuchoice> для всех выбранных файлов. Если выбрана кодировка UTF8, для тегов ID3v2.3.0 будет использоваться UTF16, потому что этот формат не поддерживает UTF8.
sv: Tilldelar <guilabel>Textkodning</guilabel> vald med <menuchoice><guimenu>Inställningar</guimenu><guimenuitem>Anpassa &kid3;...</guimenuitem><guimenuitem>Sektionen Tagg</guimenuitem><guimenuitem>Fliken Tagg 2</guimenuitem></menuchoice> till alla markerade filerna. Om UTF8 är valt, används UTF16 för ID3v2.3.0 taggar eftersom UTF8 inte stöds för det formatet.

source: <guimenu>Tools</guimenu> <guimenuitem>Rename Folder...</guimenuitem>
it: <guimenu>Strumenti</guimenu> <guimenuitem>Rinomina cartella...</guimenuitem>
ru: <guimenu>Сервис</guimenu> <guimenuitem>Переименовать каталог...</guimenuitem>
sv: <guimenu>Verktyg</guimenu> <guimenuitem>Byt namn på katalog...</guimenuitem>

source: This dialog offers the possibility to automatically rename the currently open folder according to the tags in the files. Several formats are preconfigured to include information about artist, album and year in the folder name. It is also possible to set a custom format and <guibutton>Edit</guibutton> the list of available formats. The following special codes are used to insert tag values into the folder name:
it: Questa finestra offre la possibilità di rinominare automaticamente la cartella attualmente aperta in base ai tag nei file. Diversi formati sono preconfigurati per includere informazioni sull'artista, sull'album e sull'anno nel nome della cartella. È anche possibile impostare un formato personalizzato e <guibutton>Modifica</guibutton> l'elenco dei formati disponibili. I seguenti codici speciali vengono utilizzati per inserire i valori dei tag nel nome della cartella:
ru: Этот диалог позволяет автоматически переименовать текущий открытый каталог в соответствии с тегами в файлах. Предварительно настроено несколько форматов для включения в название каталога информации об исполнителе, альбоме и годе выпуска. Также возможно указать собственный формат и воспользоваться кнопкой <guibutton>Изменить...</guibutton> для редактирования имеющихся форматов. Следующие специальные коды используются для вставки значений тегов в имя каталога:
sv: Dialogrutan erbjuder möjligheten att automatiskt byta namn på katalogen som för närvarande är öppen till taggarna i filerna. Flera format är förinställda att inkludera information om artist, album och år i katalognamnet. Det är också möjligt att ange ett eget format och <guibutton>Redigera</guibutton> listan med tillgängliga format. Följande speciella koder används för att infoga taggvärden i katalognamnet:

source: %{dirname} Folder name (<abbrev>e.g.</abbrev> %{year" "}%{dirname} will prepend the year to the current folder name)
it: %{dirname} Nome della cartella (<abbrev>ad es.</abbrev> %{year" "}%{dirname} anteporrà l'anno al nome attuale della cartella)
ru: %{dirname} Имя каталога (например, %{year" "}%{dirname} добавит в начале имени текущего каталога год)
sv: %{dirname} Katalognamn (<abbrev>t.ex.</abbrev> %{year" "}%{dirname} lägger till året först i det aktuella katalognamnet)

source: %{max-year} The maximum year value found for this folder, can also be used with other codes than "year"
it: %{max-year} Il valore massimo dell'anno trovato per questa cartella, può essere utilizzato per altri codici diversi da «year»
ru: %{max-year} Максимальное значение года, найденное для этого каталога, также может использоваться с другими кодами, отличными от «year»
sv: %{max-year} Det maximala värdet på året som hittas i katalogen, kan också användas med andra koder än "year"

source: %{min-year} The minimum year value found for this folder
it: %{min-year} Il valore minimo dell'anno trovato per questa cartella
ru: %{min-year} Минимальное значение года, найденное для этого каталога
sv: %{max-year} Det minimala värdet på året som hittas för den här katalogen

source: %{unq-year} The unique year value found for this folder or empty if not unique
it: %{unq-year} Il valore unico dell'anno trovato per questa cartella o vuoto se non unico
ru: %{unq-year} Уникальное значение года, найденное для этого каталога, или пустое значение, если уникальное не найдено
sv: %{unq-year} Det unika värdet på året som hittas för den här katalogen, eller tomt om det inte är unikt

source: If a folder separator "/" is found in the format, multiple folders are created. If you want to create a new folder instead of renaming the current folder, in the <guilabel>Action</guilabel> combo box select <guilabel>Create Folder</guilabel> instead of <guilabel>Rename Folder</guilabel>. The <guilabel>Source</guilabel> of the tag information can be chosen between <guilabel>Tag 1 and Tag 2</guilabel>, <guilabel>Tag 1</guilabel> and <guilabel>Tag 2</guilabel>. A preview for the rename operation performed on the first file can be seen in the <guilabel>From</guilabel> and <guilabel>To</guilabel> sections of the dialog.
it: Se viene individuato un separatore di cartelle «/» nel formato, saranno create più cartelle. Se si desidera creare una nuova cartella anziché rinominare la cartella attuale, nella casella combinata <guilabel>Azione</guilabel> selezionare <guilabel>Crea cartella</guilabel> anziché <guilabel>Rinomina cartella</guilabel>. La <guilabel>Fonte</guilabel> delle informazioni sui tag può essere scelta tra <guilabel>Tag 1 e tag 2</guilabel>, <guilabel>Tag 1</guilabel> e <guilabel>Tag 2</guilabel>. Un'anteprima dell'operazione di rinomina eseguita sul primo file è disponibile nelle sezioni <guilabel>Da</guilabel> e <guilabel>A</guilabel> della finestra.
ru: Если в формате присутствует разделитель каталогов «/», будет создано несколько каталогов. Если требуется не переименовать текущий каталог, а создать новый, воспользуйтесь раскрывающимся списком <guilabel>Действие</guilabel> и выберите вариант <guilabel>Создать каталог</guilabel> вместо <guilabel>Переименовать каталог</guilabel>. <guilabel>Источник</guilabel> данных тега возможно установить в одно из следующих значений: <guilabel>Тег 1 и тег 2</guilabel>, <guilabel>Тег 1</guilabel> или <guilabel>Тег 2</guilabel>. Предварительный просмотр действия по переименованию первого файла доступен в разделах диалога <guilabel>Из</guilabel> и <guilabel>В</guilabel>.
sv: Om en katalogavskiljare "/" finns i formatet, skapas flera kataloger. Om du vill skapa en ny katalog istället för att byta namn på den aktuella katalogen, välj <guilabel>Skapa katalog</guilabel> i kombinationsrutan <guilabel>Åtgärd</guilabel> istället för <guilabel>Byt namn på katalog</guilabel>. <guilabel>Källa</guilabel> för tagginformationen kan väljas mellan <guilabel>Tagg 1 och tagg 2</guilabel>, <guilabel>Tagg 1</guilabel> och <guilabel>Tagg 2</guilabel>. En förhandsgranskning av namnbytesåtgärden utförd för den första filen visas i sektionerna <guilabel>Från</guilabel> och <guilabel>Till</guilabel> i dialogrutan.

source: Multiple folders can be renamed by selecting them.
it: Più cartelle possono essere rinominate selezionandole
ru: Чтобы переименовать сразу несколько каталогов, выделите их.
sv: Namnet på flera kataloger kan bytas genom att markera dem.

source: <guimenu>Tools</guimenu> <guimenuitem>Number Tracks...</guimenuitem>
it: <guimenu>Tools</guimenu> <guimenuitem>Numero tracce...</guimenuitem>
ru: <guimenu>Сервис</guimenu> <guimenuitem>Пронумеровать дорожки...</guimenuitem>
sv: <guimenu>Verktyg</guimenu> <guimenuitem>Numrera spår...</guimenuitem>

source: If the track numbers in the tags are not set or have the wrong values, this function can <action>number the tracks automatically in ascending order</action>. The start number can be set in the dialog. If only part of the tracks have to be numbered, they must be selected.
it: Se i numeri delle tracce nei tag non sono impostati o hanno valori errati, questa funzione può <action>numerare automaticamente le tracce in ordine crescente</action>. Il numero iniziale può essere impostato nella finestra. Se è necessario numerare solo una parte delle tracce, esse devono essere selezionate.
ru: Если номера дорожек в тегах не указаны или установлены неправильно, эта функция позволит <action>автоматически пронумеровать дорожки по возрастанию</action>. В диалоге возможно указать начальный номер. Если требуется пронумеровать только часть дорожек, сначала их следует выделить.
sv: Om spårnumren i taggarna inte är inställda eller har fel värden, kan funktionen <action>automatiskt numrera spåren i stigande ordning</action>. Startnumret kan ställas in i dialogrutan. Om bara delar av spåren ska numreras, måste de markeras.

source: When <guilabel>Total number of tracks</guilabel> is checked, the number of tracks will also be set in the tags.
it: Quando si seleziona <guilabel>Numero totale di tracce</guilabel>, nei tag sarà impostato anche il numero di tracce.
ru: Также в тегах будет указано количество дорожек, если установлен флажок <guilabel>Всего дорожек</guilabel>.
sv: När <guilabel>Totalt antal spår</guilabel> är markerat, anges också antal spår i taggarna.

source: It is possible to number the tracks over multiple folders. The folders have to be expanded and selected.
it: È possibile numerare le tracce in più cartelle. Le cartelle devono essere espanse e selezionate.
ru: Возможно пронумеровать дорожки в нескольких каталогах. Нужные каталоги следует развернуть и выделить.
sv: Det är möjligt att numrera spåren i flera kataloger. Katalogerna måste expanderas och markeras.

source: If <guilabel>Reset counter for each folder</guilabel> is checked, track numbering is restarted with the given number for each folder when multiple folders are selected.
it: Se è selezionato <guilabel>Reimposta contatore per ciascuna cartella</guilabel>, la numerazione delle tracce viene riavviata con il numero indicato per ciascuna cartella quando vengono selezionate più cartelle.
ru: Если установлен флажок <guilabel>Начинать заново в каждой папке</guilabel>, в каждом выделенном каталоге нумерация дорожек будет начата заново с указанного номера.
sv: Om <guilabel>Nollställ räknare för varje katalog</guilabel> är markerat, startas spårnumrering om med det angivna numret för varje katalog när flera kataloger är markerade.

source: The number tracks dialog can also be used to format existing track numbers without changing the values when the check box left to <guilabel>Start number</guilabel> is deactivated. The total number of tracks will be added if the corresponding check box is active, which can be used to set the total for all selected tracks. If only formatting of the existing numbers is desired, this check box has to be deactivated too.
it: La finestra di numerazione delle tracce può anche essere utilizzata per formattare i numeri di traccia esistenti senza modificare i valori quando la casella di controllo lasciata su <guilabel>Numero iniziale</guilabel> è disattivata. Il numero totale di tracce sarà aggiunto se la casella di controllo corrispondente è attiva, che può essere utilizzata per impostare il totale per tutte le tracce selezionate. Se si desidera solo la formattazione dei numeri esistenti, anche questa casella di controllo deve essere disattivata.
ru: Диалог нумерации дорожек также позволяет отформатировать уже присвоенные номера без изменения их значений, если снят флажок <guilabel>Начальный номер</guilabel>. Общее количество дорожек будет добавлено, если установлен соответствующий флажок, который предназначен для установки общего количества для всех выбранных дорожек. Если требуется выполнить только форматирование существующих номеров, этот флажок также необходимо снять.
sv: Dialogrutan för att numrera spår kan också användas för att formatera befintliga spårnummer utan att ändra värdena när kryssrutan till vänster om <guilabel>Startnummer</guilabel> är inaktiverad. Det totala antalet spår läggs till om motsvarande kryssruta är aktiverad, vilket kan användas för att ställa in totalantalet för alla markerade spår. Om bara formatering av befintliga nummer önskas, måste den kryssrutan också inaktiveras.

source: <guimenu>Tools</guimenu> <guimenuitem>Filter...</guimenuitem>
it: <guimenu>Strumenti</guimenu> <guimenuitem>Filtro...</guimenuitem>
ru: <guimenu>Сервис</guimenu> <guimenuitem>Фильтр...</guimenuitem>
sv: <guimenu>Verktyg</guimenu> <guimenuitem>Filtrera...</guimenuitem>
