Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: List the contents of the current folder. This corresponds to the file list in the &kid3; &GUI;. Five characters before the file names show the state of the file.
it: Elenca il contenuto della cartella attuale. Questo corrisponde all'elenco dei file nella &GUI; di &kid3;. Cinque caratteri prima dei nomi dei file mostrano lo stato del file.
ru: Список содержимого текущего каталога. Соответствует списку файлов в пользовательском интерфейсе &kid3;. Пять символов перед именами файлов показывают состояние файла.
sv: Lista innehållet i den aktuella katalogen. Det motsvarar fillistan i &kid3;s grafiska användargränssnitt. Fem tecken innan filnamnen visar filernas tillstånd.

source: <computeroutput>&gt;</computeroutput> File is selected.
it: <computeroutput>&gt;</computeroutput> Il file è selezionato.
ru: <computeroutput>&gt;</computeroutput> Файл выбран.
sv: <computeroutput>&gt;</computeroutput> Filen är markerad.

source: <computeroutput>*</computeroutput> File is modified.
it: <computeroutput>*</computeroutput> Il file è modificato.
ru: <computeroutput>*</computeroutput> Файл изменён.
sv: <computeroutput>*</computeroutput> Filen är ändrad.

source: <computeroutput>1</computeroutput> File has a tag 1, otherwise '<computeroutput>-</computeroutput>' is displayed.
it: <computeroutput>1</computeroutput> Il file ha un tag 1, altrimenti '<computeroutput>-</computeroutput>' è visualizzato.
ru: <computeroutput>1</computeroutput> Файлу присвоен тег 1, в противном случае отобразится «<computeroutput>-</computeroutput>».
sv: <computeroutput>1</computeroutput> Filen har en tagg 1, annars visas '<computeroutput>-</computeroutput>'.

source: <computeroutput>2</computeroutput> File has a tag 2, otherwise '<computeroutput>-</computeroutput>' is displayed.
it: <computeroutput>2</computeroutput> Il file ha un tag 2, altrimenti '<computeroutput>-</computeroutput>' è visualizzato.
ru: <computeroutput>2</computeroutput> Файлу присвоен тег 2, в противном случае отобразится «<computeroutput>-</computeroutput>».
sv: <computeroutput>2</computeroutput> Filen har en tagg 2, annars visas '<computeroutput>-</computeroutput>'.

source: <computeroutput>3</computeroutput> File has a tag 3, otherwise '<computeroutput>-</computeroutput>' is displayed.
it: <computeroutput>3</computeroutput> Il file ha un tag 3, altrimenti '<computeroutput>-</computeroutput>' è visualizzato.
ru: <computeroutput>3</computeroutput> Файлу присвоен тег 3, в противном случае отобразится «<computeroutput>-</computeroutput>».
sv: <computeroutput>3</computeroutput> Filen har en tagg 3, annars visas '<computeroutput>-</computeroutput>'.

source: In this example, all files have a tag 1, the second file also has a tag 2 and it is selected. The third file is modified.
it: In questo esempio, tutti i file hanno un tag 1, il secondo file ha anche un tag 2 ed è selezionato. Il terzo file è modificato.
ru: В этом примере все файлы имеют тег 1, второй файл также имеет тег 2, и он выделен. Третий файл изменён.
sv: I det här exemplet har alla filer en tagg 1, den andra filen har också en tagg 2 och den är markerad. Den tredje filen är ändrad.

source: Save the changed files
it: Salvare i file modificati
ru: Сохранить изменённые файлы
sv: Spara de ändrade filerna

source: Select file
it: Selezionare i file
ru: Выбрать файл
sv: Markera fil

source: To select all files, enter <userinput>select all</userinput>, to deselect all files, enter <userinput>select none</userinput>. To traverse the files in the current folder start with <userinput>select first</userinput>, then go forward using <userinput>select next</userinput> or backward using <userinput>select previous</userinput>. Specific files can be added to the current selection by giving their file names. Wildcards are possible, so <userinput>select *.mp3</userinput> will select all MP3 files in the current folder.
it: Per selezionare tutti i file, digitare <userinput>select all</userinput>, per deselezionare tutti i file, digitare <userinput>select none</userinput>. Per attraversare i file nella cartella attuale iniziare con <userinput>select first</userinput>, quindi andare avanti utilizzando <userinput>select next</userinput> o indietro utilizzando <userinput>select previous</userinput>. È possibile aggiungere file specifici alla selezione attuale assegnando i nomi ai file. I metacaratteri sono possibili, quindi <userinput>select *.mp3 </userinput> selezionerà tutti i file MP3 nella cartella attuale.
ru: Чтобы выделить все файлы, введите команду <userinput>select all</userinput>; чтобы снять выделение со всех файлов, введите команду <userinput>select none</userinput>. Чтобы последовательно перебрать файлы в текущем каталоге, воспользуйтесь командой <userinput>select first</userinput>, затем передвигайтесь вперёд по списку с помощью команды <userinput>select next</userinput>, либо назад с помощью команды <userinput>select previous</userinput>. Чтобы добавить к текущему выделению отдельные файлы, укажите их названия напрямую. Поддерживается использование подстановочных знаков, например, возможно указать <userinput>select *.mp3</userinput> для выделения всех MP3-файлов в текущем каталоге.
sv: Skriv in <userinput>select all</userinput> för att markera alla filer,skriv in <userinput>select none</userinput> för att avmarkera alla filer. För att gå igenom filerna i aktuell katalog, börja med <userinput>select first</userinput>, gå sedan framåt med <userinput>select next</userinput> eller bakåt med <userinput>select previous</userinput>. Specifika filer kan läggas till i aktuell markering genom att ange deras filnamn. Jokertecken är möjliga, så <userinput>select *.mp3</userinput> markerar alla MP3-filer i den aktuella katalogen.

source: Select tag
it: Selezionare i tag
ru: Выбрать тег
sv: Välj tagg

source: <command>tag</command> <arg><replaceable>TAG-NUMBERS</replaceable></arg>
it: <command>tag</command> <arg><replaceable>NUMERI-TAG</replaceable></arg>
ru: <command>tag</command> <arg><replaceable>НОМЕРА-ТЕГОВ</replaceable></arg>
sv: <command>tag</command> <arg><replaceable>TAGGNUMMER</replaceable></arg>

source: Many commands have an optional <replaceable>TAG-NUMBERS</replaceable> parameter, which specifies whether the command operates on tag 1, 2, or 3. If this parameter is omitted, the default tag numbers are used, which can be set by this command. At startup, it is set to <literal>12</literal> which means that information is read from tag 2 if available, else from tag 1; modifications are done on tag 2. The <option><replaceable>TAG-NUMBERS</replaceable></option> can be set to <userinput>1</userinput>, <userinput>2</userinput>, or <userinput>3</userinput> to operate only on the corresponding tag. If the parameter is omitted, the current setting is displayed.
it: Molti comandi hanno un parametro <replaceable>TAG-NUMBERS</replaceable> facoltativo, che specifica se il comando opera sui tag 1, 2 o 3. Se questo parametro viene omesso, vengono utilizzati i numeri dei tag predefiniti, che possono essere impostati da questo comando. All'avvio, è impostato su <literal>12</literal>, il che significa che le informazioni vengono lette dal tag 2 se disponibili, altrimenti dal tag 1; le modifiche sono apportate al tag 2. <option><replaceable>TAG-NUMBERS</replaceable></option> può essere impostato su <userinput>1</userinput>, <userinput>2</userinput> o <userinput>3</userinput> per operare solo sul tag corrispondente. Se il parametro viene omesso, viene visualizzata l'impostazione attuale.
ru: Некоторые команды имеют необязательный параметр <replaceable>НОМЕРА-ТЕГОВ</replaceable>, который позволяет указать, над каким тегом следует выполнять команду (1, 2 или 3). Если этот параметр не указан, будут использованы номера тегов по умолчанию, которые указываются с помощью этой команды. Сразу после запуска будет установлено значение <literal>12</literal>, то есть данные будут прочитаны из тега 2, если он будет обнаружен, либо из тега 1, если тег 2 обнаружен не будет; изменения будут вноситься в тег 2. Для параметра <option><replaceable>НОМЕРА-ТЕГОВ</replaceable></option> возможно указать значение <userinput>1</userinput>, <userinput>2</userinput> или <userinput>3</userinput> для работы только с соответствующим тегом. Если параметр не указан, будет отображаться текущее значение параметра номеров тегов.
sv: Många kommandon har en valfri parameter <replaceable>TAGGNUMMER</replaceable>, som anger om kommandot gäller tagg 1, 2 eller 3. Om parametern utelämnas, används förvalda taggnummer, som kan ställas in med kommandot. Vid start är det inställt till <literal>12</literal>, vilket betyder att information läses från tagg 2 om tillgänglig, annars från tagg 1, och ändringar görs av tagg 2. <option><replaceable>TAGGNUMMER</replaceable></option> kan ställas in till <userinput>1</userinput>, <userinput>2</userinput> eller <userinput>3</userinput> för att bara gälla motsvarande tagg. Om parametern utelämnas visas den nuvarande inställningen.

source: Get tag frame
it: Ottenere il frame del tag
ru: Получить фрейм тега
sv: Hämta taggram

source: <command>get</command> <group> <arg choice="plain">all</arg> <arg choice="plain"><replaceable>FRAME-NAME</replaceable></arg> </group> <arg><replaceable>TAG-NUMBERS</replaceable></arg>
it: <command>get</command> <group> <arg choice="plain">all</arg> <arg choice="plain"><replaceable>NOME-FRAME</replaceable></arg> </group> <arg><replaceable>NUMERI-TAG</replaceable></arg>
ru: <command>get</command> <group> <arg choice="plain">all</arg> <arg choice="plain"><replaceable>НАЗВАНИЕ-ФРЕЙМА</replaceable></arg> </group> <arg><replaceable>НОМЕРА-ТЕГОВ</replaceable></arg>
sv: <command>get</command> <group> <arg choice="plain">all</arg> <arg choice="plain"><replaceable>RAMNAMN</replaceable></arg> </group> <arg><replaceable>TAGGNUMMER</replaceable></arg>

source: This command can be used to read the value of a specific tag frame or get information about all tag frames (if the argument is omitted or <option>all</option> is used). Modified frames are marked with a '<computeroutput>*</computeroutput>'.
it: Questo comando può essere utilizzato per leggere il valore del frame di un tag specifico o ottenere informazioni su tutti i frame di tag (se l'argomento viene omesso o viene utilizzato <option>all</option>). I frame modificati sono marcati con un '<computeroutput>*</computeroutput>'.
ru: Эта команда используется для чтения значения определённого фрейма тега или получения информации обо всех фреймах тега (если не указан аргумент или используется параметр <option>all</option>). Изменённые фреймы отмечены символом «<computeroutput>*</computeroutput>».
sv: Kommandot kan användas för att läsa värdet på en specifik taggram eller få information om alla taggramar (om argumentet utelämnas eller <option>all</option> används). Ändrade ramar är markerade med '<computeroutput>*</computeroutput>'.

source: To save the contents of a picture frame to a file, use
it: Per salvare il contenuto del frame di un'immagine in un file, utilizzare
ru: Чтобы сохранить содержимое фрейма изображения в файл, воспользуйтесь командой
sv: För att spara innehållet i en bildram till en fil, använd

source: <userinput>get picture:'/path/to/folder.jpg'</userinput>
it: <userinput>get picture:'/percorso/a/folder.jpg'</userinput>
ru: <userinput>get picture:'/путь/к/каталогу.jpg'</userinput>
sv: <userinput>get picture:'/sökväg/till/katalog.jpg'</userinput>

source: To save synchronized lyrics to an LRC file, use
it: Per salvare i testi sincronizzati in un file LRC, utilizzare
ru: Чтобы сохранить синхронизированный текст песни в файл LRC, воспользуйтесь командой
sv: För att spara synkroniserad sångtext till en LRC-fil, använd

source: <userinput>get SYLT:'/path/to/lyrics.lrc'</userinput>
it: <userinput>get SYLT:'/percorso/a/testo.lrc'</userinput>
ru: <userinput>get SYLT:'/путь/к/тексту.lrc'</userinput>
sv: <userinput>get SYLT:'/sökväg/till/sångtext.lrc'</userinput>

source: It is possible to get only a specific field from a frame, for example <userinput>get POPM.Email</userinput> for the Email field of a Popularimeter frame. If a file has multiple frames of the same kind, the different frames can be indexed with brackets, for example the first performer from a Vorbis comment can be retrieved using <userinput>get performer[0]</userinput>, the second using <userinput>get performer[1]</userinput>.
it: È possibile ottenere solo un campo specifico da un frame, ad esempio <userinput>get POPM.Email</userinput> per il campo Email di un frame Popularimeter. Se un file ha più frame dello stesso tipo, i diversi frame possono essere indicizzati con parentesi, ad esempio il primo interprete da un commento di Vorbis può essere recuperato utilizzando <userinput>get performer [0]</userinput>, il secondo utilizzando <userinput>get performer [1]</userinput>.
ru: Возможно получить данные только из определённого поля фрейма, например, <userinput>get POPM.Email</userinput> для поля Email во фрейме Popularimeter. Если в файле хранится несколько фреймов одного типа, следует указать соответствующий индекс в квадратных скобках: например, название первого из исполнителей в комментарии Vorbis возможно получить с помощью команды <userinput>get performer[0]</userinput>, а второго — с помощью команды<userinput>get performer[1]</userinput>.
sv: Det är möjilgt att bara hämta ett specifikt fält från en ram, exempelvis <userinput>get POPM.Email</userinput> för Email fältet i en Popularimeter ram. Om en fil har flera ramar av samma sort, kan de olika ramarna indexeras med hakparenteser, exempelvis kan den första utföraren från en Vorbis-kommentar hämtas genom att använda <userinput>get performer[0]</userinput>, den andra genom att använda <userinput>get performer[1]</userinput>.

source: The pseudo field name "selected" can be used to check if a frame is selected, for example <userinput>get artist.selected</userinput> will return <computeroutput>1</computeroutput> if the artist frame is selected, else <computeroutput>0</computeroutput>.
it: Il nome dello pseudo-campo «selected» può essere utilizzato per verificare se è selezionata un frame, ad esempio <userinput>get artist.selected</userinput> restituirà <computeroutput>1</computeroutput> se è selezionato il frame dell'artista, altrimenti <computeroutput>0</computeroutput>.
ru: Псевдополе под названием «selected» позволяет проверить, выделен ли фрейм: например, команда <userinput>get artist.selected</userinput> вернёт значение <computeroutput>1</computeroutput>, если фрейм исполнителя выделен, либо <computeroutput>0</computeroutput>, если фрейм не выделен.
sv: Pseudofältnamnet "selected" kan användas för att kontrollera om en ram är markerad, exempelvis returnerar <userinput>get artist.selected</userinput> <computeroutput>1</computeroutput> om artistramen är markerad, annars <computeroutput>0</computeroutput>.

source: Set tag frame
it: Impostare il frame del tag
ru: Указать фрейм тега
sv: Ange taggram

source: <command>set</command> <arg choice="req"><replaceable>FRAME-NAME</replaceable></arg> <arg choice="req"><replaceable>FRAME-VALUE</replaceable></arg> <arg><replaceable>TAG-NUMBERS</replaceable></arg>
it: <command>set</command> <arg choice="req"><replaceable>NOME-FRAME</replaceable></arg> <arg choice="req"><replaceable>VALORE-FRAME</replaceable></arg> <arg><replaceable>NUMERI-TAG</replaceable></arg>
ru: <command>set</command> <arg choice="req"><replaceable>НАЗВАНИЕ-ФРЕЙМА</replaceable></arg> <arg choice="req"><replaceable>ЗНАЧЕНИЕ-ФРЕЙМА</replaceable></arg> <arg><replaceable>НОМЕРА-ТЕГОВ</replaceable></arg>
sv: <command>set</command> <arg choice="req"><replaceable>RAMNAMN</replaceable></arg> <arg choice="req"><replaceable>RAMVÄRDE</replaceable></arg> <arg><replaceable>TAGGNUMMER</replaceable></arg>

source: This command sets the value of a specific tag frame. If <replaceable>FRAME-VALUE</replaceable> is empty, the frame is deleted.
it: Questo comando imposta il valore del frame di un tag specifico. Se <replaceable>FRAME-VALUE</replaceable> è vuoto, il frame viene eliminato.
ru: Эта команда позволяет указать значение определённого фрейма тега. Если параметр <replaceable>ЗНАЧЕНИЕ-ФРЕЙМА</replaceable> не указан, фрейм будет удалён.
sv: Kommandot tilldelar en specifik taggrams värde. Om <replaceable>FRAMEVALUE</replaceable> är tomt, tas ramen bort.

source: To set the contents of a picture frame from a file, use
it: Per impostare il contenuto di un frame da un file, utilizzare
ru: Чтобы установить содержимое фрейма изображения из файла, воспользуйтесь командой
sv: För att ställa in innehållet i en bildram från en fil, använd

source: <userinput>set picture:'/path/to/folder.jpg' 'Picture Description'</userinput>
it: <userinput>set picture:'/percorso/a/folder.jpg' 'Descrizione immagine'</userinput>
ru: <userinput>set picture:'/путь/к/каталогу.jpg' 'Описание изображения'</userinput>
sv: <userinput>set picture:'/sökväg/till/katalog.jpg' 'Bildbeskrivning'</userinput>

source: To set synchronized lyrics from an LRC file, use
it: Per impostare i testi sincronizzati da un file LRC, utilizzare
ru: Чтобы установить синхронизированный текст песни из файла LRC, воспользуйтесь командой
sv: För att tilldela synkroniserad sångtext från en LRC-fil, använd

source: <userinput>set SYLT:'/path/to/lyrics.lrc' 'Lyrics Description'</userinput>
it: <userinput>set SYLT:'/percorso/a/testo.lrc' 'Descrizione del testo'</userinput>
ru: <userinput>set SYLT:'/путь/к/тексту.lrc' 'Описание текста'</userinput>
sv: <userinput>set SYLT:'/sökväg/till/sångtext.lrc' 'Sångtextbeskrivning'</userinput>

source: To set a specific field of a frame, the field name can be given after a dot, <abbrev>e.g.</abbrev> to set the Counter field of a Popularimeter frame, use
it: Per impostare un campo specifico di un frame, il nome del campo può essere dato dopo un punto, <abbrev>ad es.</abbrev> per impostare il campo Contatore di un frame Popularimeter, utilizzare
ru: Чтобы указать определённое поле внутри фрейма, следует указать название поля после точки. Например, чтобы установить значение поля счётчика фрейма Popularimeter, воспользуйтесь командой
sv: För att tilldela ett specifikt fält i en ram, kan fältnamnet anges efter en punkt. För att tilldela fältet Counter i ramen Popularimeter använd <abbrev>t.ex.</abbrev>

source: An application for field specifications is the case where you want a custom TXXX frame with "rating" description instead of a standard Popularimeter frame (this seems to be used by some plugins). You can create such a TXXX rating frame with <command>kid3-cli</command>, however, you have to first create a TXXX frame with description "rating" and then set the value of this frame to the rating value. <screen width="65"> <prompt>kid3-cli&gt; </prompt><userinput>set rating ""</userinput> <prompt>kid3-cli&gt; </prompt><userinput>set TXXX.Description rating</userinput> <prompt>kid3-cli&gt; </prompt><userinput>set rating 5</userinput> </screen> The first command will delete an existing POPM frame, because if such a frame exists, <userinput>set rating 5</userinput> would set the POPM frame and not the TXXX frame. Another possibility would be to use <userinput>set TXXX.Text 5</userinput>, but this would only work if there is no other TXXX frame present.
it: Un'applicazione per le specifiche del campo è il caso in cui si desidera un frame TXXX personalizzato con descrizione «rating» anziché un frame Popularimeter standard (questo sembra essere utilizzato da alcune estensioni). È possibile creare un frame di classificazione TXXX con <command>kid3-cli</command>, tuttavia è necessario prima creare un frame TXXX con la descrizione «rating» e quindi impostare il valore di questo frame sul valore di rating. <screen width="65"> <prompt>kid3-cli&gt; </prompt><userinput>set rating ""</userinput> <prompt>kid3-cli&gt; </prompt><userinput>set TXXX.Description rating</userinput> <prompt>kid3-cli&gt; </prompt><userinput>set rating 5</userinput> </screen> Il primo comando eliminerà un frame POPM esistente, perché se esiste un frame del genere, <userinput>set rating 5</userinput> imposterà il frame POPM e non il frame TXXX. Un'altra possibilità sarebbe quella di utilizzare <userinput>set TXXX.Text 5</userinput>, ma funzionerebbe solo se non fosse presente nessun altro frame TXXX.
ru: Спецификация полей применяется в том случае, когда нужно создать пользовательский фрейм TXXX с описанием «rating» вместо стандартного фрейма Popularimeter (такой метод оценки используется некоторыми модулями). Фрейм оценки TXXX возможно создать с помощью <command>kid3-cli</command>, однако сначала следует создать фрейм TXXX с описанием «rating», а затем указать значение оценки для этого фрейма. <screen width="65"> <prompt>kid3-cli&gt; </prompt><userinput>set rating ""</userinput> <prompt>kid3-cli&gt; </prompt><userinput>set TXXX.Description rating</userinput> <prompt>kid3-cli&gt; </prompt><userinput>set rating 5</userinput> </screen> Первая команда удалит существующий фрейм POPM, потому что, если такой фрейм существует, параметр <userinput>set rating 5</userinput> установит значение фрейма POPM, а не TXXX. Другой способ установки значения — это использование команды <userinput>set TXXX.Text 5</userinput>, но она сработает корректно только в том случае, если нет других фреймов TXXX.
sv: Ett program för fältspecifikationer är fallet då du vill ha en egen TXXX-ram med beskrivning av "rating" istället för den vanliga Popularimeter ramen (som verkar användas av vissa insticksprogram). Du kan skapa en sådan TXXX-betygsram med <command>kid3-cli</command>. Dock måste du först skapa en TXXX-ram med beskrivningen "rating" och därefter tilldela ramens värde till betygsvärdet. <screen width="65"> <prompt>kid3-cli&gt; </prompt><userinput>set rating ""</userinput> <prompt>kid3-cli&gt; </prompt><userinput>set TXXX.Description rating</userinput> <prompt>kid3-cli&gt; </prompt><userinput>set rating 5</userinput> </screen> Det första kommandot tar bort en befintlig POPM-ram, eftersom om en sådan ram finns, skulle <userinput>set rating 5</userinput> använda POPM-ramen och inte TXXX-ramen. En annan möjlighet skulle vara att använda <userinput>set TXXX.Text 5</userinput>, men det skulle bara fungera om det inte fanns någon annan TXXX-ram.

source: To set multiple frames of the same kind, an index can be given in brackets, <abbrev>e.g.</abbrev> to set multiple performers in a Vorbis comment, use
it: Per impostare più frame dello stesso tipo, è possibile indicare un indice tra parentesi, <abbrev>ad es.</abbrev> per impostare più performer in un commento di Vorbis, utilizzare
ru: Чтобы установить несколько фреймов одинакового типа, укажите индекс в скобках; например, чтобы указать несколько исполнителей в комментарии Vorbis, воспользуйтесь командой
sv: För att tilldela flera ramar av samma sort, kan ett index anges inom hakparenteser. För att tilldela flera utövare i en Vorbis-kommentar använd <abbrev>t.ex.</abbrev>
