Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: This section describes a typical session with &kid3;. Let's assume we have a folder containing MP3 files with the tracks from the album "Let's Tag" from the band "One Hit Wonder". The folder is named in the "artist - album" format, in our case <filename>One Hit Wonder - Let's Tag</filename>. The folder contains the tracks in the "track title.mp3" format, which I think is useful because the filenames are short (important when using mobile MP3 players with small displays) and in the correct order when sorted alphabetically (important when using hardware MP3 players which play the tracks in alphabetical order or in the order in which they are burnt on &CD; and that order is alphabetical when using <command>mkisofs</command>). Besides this, the artist and album information is already in the folder name and does not have to be repeated in the filename. But back to our example, the folder listing looks like this:
it: Questa sezione descrive una sessione tipica con &kid3;. Supponiamo di avere una cartella contenente file MP3 con i brani dell'album «Let's Tag» del gruppo «One Hit Wonder». La cartella è denominata nel formato «artista - album», nel nostro caso <filename>One Hit Wonder - Let's Tag</filename>. La cartella contiene le tracce nel formato «traccia titolo.mp3», che si pensa sia utile perché i nomi dei file sono brevi (importante quando si usano lettori MP3 mobili con schermi piccoli) e nell'ordine corretto se ordinati alfabeticamente (importante quando si usano lettori MP3 hardware che riproducono i brani in ordine alfabetico o nell'ordine in cui vengono masterizzati su &CD; e quell'ordine è alfabetico quando si usa <command>mkisofs</command>). Oltre a ciò, le informazioni sull'artista e sull'album sono già nel nome della cartella e non devono essere ripetute nel nome file. Ma torniamo al nostro esempio, l'elenco delle cartelle è simile al seguente:
ru: Этот раздел описывает обычный сеанс работы в &kid3;. Предположим, что есть каталог, в котором содержатся файлы в формате MP3 с дорожками из альбома «Let's Tag» группы «One Hit Wonder». Каталог с файлами назван в формате «Исполнитель - Альбом», в этом примере — «<filename>One Hit Wonder - Let's Tag</filename>». В каталоге содержатся файлы дорожек в формате «название дорожки.mp3», что довольно удобно, так как названия файлов остаются короткими (это важно для мобильных MP3-проигрывателей с небольшими дисплеями) и располагаются в надлежащем порядке при упорядочении списка по алфавиту (это важно при использовании аппаратного MP3-проигрывателя, который воспроизводит дорожки в алфавитном порядке или в том порядке, в котором они записаны на компакт-диске; этот порядок будет алфавитным в случае выполнения команды <command>mkisofs</command>). Кроме этого, информация об исполнителе и альбоме уже содержится в названии каталога, и её не обязательно дублировать в названии файла. В этом примере список файлов в каталоге будет выглядеть так:
sv: Det här avsnittet beskriver en typisk session med &kid3;. Låt oss anta att vi har en katalog som innehåller MP3-filer med spår från albumet "Låt oss tagga" från bandet "Dagslända". Katalogen är namngiven med formatet "artist - album", i vårt fall <filename>Dagslända - Låt oss tagga</filename>. Katalogen innehåller spåren på formatet "spår titel.mp3", som jag tycker är användbart eftersom filnamnen är korta (viktigt vid användning av mobila MP3-spelare med små skärmar) och i rätt ordning när de sorteras alfabetiskt (viktigt vid användning av MP3-hårdvaruspelare som spelar spåren i alfabetisk ordning eller ordningen som de är brända på en cd och den ordningen är alfabetisk när <command>mkisofs</command> används). Bortsett från det, är artist- och albuminformationen redan i katalognamnet och behöver inte upprepas i filnamnet. Men åter till vårt exempel, där listningen av katalog ser ut så här:

source: These files have no tags yet and we want to generate them using &kid3;. We use <menuchoice><guimenu>File</guimenu><guimenuitem>Open</guimenuitem></menuchoice> menu item (or toolbar button) and select one of the files in this folder. All files will be displayed in the file listbox. Lazy as we are, we want to use the information in the folder and file names to generate tags. Therefore we select all files, then click the <guilabel>To:</guilabel> <guibutton>Tag 1</guibutton> button in the <guilabel>File</guilabel> section. This will set the title, artist, album and track values in all files. To set the year and genre values of all files, we keep all files selected and type in "2002" for the <guilabel>Date</guilabel> and select "Pop" from the <guilabel>Genre</guilabel> combobox. To set only these two values, their check boxes are automatically checked and all other check boxes are left unchecked. Now we change the selection by only selecting the first file and we see that all tags contain the correct values. The tags of the other files can be verified too by selecting them one by one. When we are satisfied with the tags, we use <menuchoice><guimenu>File</guimenu><guimenuitem>Save</guimenuitem></menuchoice> menu item (or toolbar button). Selecting <menuchoice><guimenu>File</guimenu><guimenuitem> Create Playlist</guimenuitem></menuchoice> menu item (or toolbar button) will generate a file <filename>One Hit Wonder - Let's Tag.m3u</filename> in the folder.
it: Questi file non hanno ancora tag e vogliamo generarli utilizzando &kid3;. Usiamo la voce di menu <menuchoice><guimenu>File</guimenu><guimenuitem>Apri</guimenuitem></menuchoice> (o il pulsante della barra degli strumenti) e selezioniamo uno dei file in questa cartella. Tutti i file saranno visualizzati nell'elenco dei file. Data la nostra pigrizia, vogliamo utilizzare le informazioni nella cartella e i nomi dei file per generare i tag. Pertanto selezioniamo tutti i file, quindi facciamo clic sul pulsante <guilabel>A:</guilabel> <guibutton>Tag 1</guibutton> nella sezione <guilabel>File</guilabel>. Questo imposterà i valori di titolo, artista, album e traccia in tutti i file. Per impostare i valori di anno e genere di tutti i file, manteniamo tutti i file selezionati e digitiamo «2002» per <guilabel>Data</guilabel> e selezioniamo «Pop» dalla casella combinata <guilabel>Genere</guilabel>. Per impostare solo questi due valori, le loro caselle di controllo vengono automaticamente selezionate e tutti le altre caselle rimangono deselezionate. Ora cambiamo la selezione selezionando solo il primo file e vediamo che tutti i tag contengono i valori corretti. I tag degli altri file possono essere verificati anche selezionandoli uno ad uno. Quando siamo soddisfatti dei tag, utilizziamo la voce di menu <menuchoice><guimenu>File</guimenu><guimenuitem>Salva</guimenuitem></menuchoice> (o il pulsante della barra degli strumenti). La selezione della voce di menu <menuchoice><guimenu>File</guimenu><guimenuitem>Crea scaletta</guimenuitem></menuchoice> (o il pulsante della barra degli strumenti) genererà un file <filename>One Hit Wonder - Let's Tag.m3u</filename> nella cartella.
ru: Этим файлам ещё не присвоены теги, их нужно создать с помощью &kid3;. Для этого следует воспользоваться пунктом меню <menuchoice><guimenu>Файл</guimenu><guimenuitem>Открыть</guimenuitem></menuchoice> (или кнопкой на панели инструментов) и выделить один из файлов в этом каталоге. Все файлы будут отображаться в списке файлов. Чтобы не усложнять себе задачу, для создания тегов воспользуемся данными из названия каталога и имён файлов. Для этого следует выделить все файлы, а затем нажать кнопку <guilabel>В:</guilabel> <guibutton>Тег 1</guibutton> в разделе <guilabel>Файл</guilabel>. Будут установлены значения заголовка, исполнителя, альбома и дорожки для всех файлов. Чтобы установить значение года и жанра для всех файлов, следует, не снимая выделения, ввести «2002» в поле <guilabel>Дата</guilabel> и выбрать, например, «Pop» в раскрывающемся списке <guilabel>Жанр</guilabel>. Чтобы установить только эти два значения, приложение автоматически установит флажки только на эти два пункта. Далее возможно изменить выделение, выделив только первый файл: как можно убедиться, всем тегам присвоены корректные значения. Чтобы проверить теги остальных файлов, их следует выделить один за другим. Если теги установлены корректно, воспользуйтесь пунктом меню <menuchoice><guimenu>Файл</guimenu><guimenuitem>Сохранить</guimenuitem></menuchoice> (или кнопкой на панели инструментов). Пункт меню <menuchoice><guimenu>Файл</guimenu><guimenuitem>Создать список воспроизведения</guimenuitem></menuchoice> (или кнопка на панели инструментов) позволяет создать файл под названием «<filename>One Hit Wonder - Let's Tag.m3u</filename>» в том же каталоге.
sv: Filerna har inga taggar än och vi vill generera dem med &kid3;. Vi använder <menuchoice><guimenu>Arkiv</guimenu> <guimenuitem>Öppna</guimenuitem></menuchoice> (eller knappen i verktygsraden) och markerar en av filerna i katalogen. Alla filer visas i fillistrutan. Lata som vi är, vill vi använda informationen i katalogen och filnamnen för att skapa taggar. Därför markerar vi alla filerna, och klickar på knappen <guilabel>Till:</guilabel> <guibutton>Tagg 1</guibutton> i sektionen <guilabel>Arkiv</guilabel>. Det tilldelar värden för titel, artist, album och spår i alla filer. För att tilldela värden för år och genre i alla filer, behåller vi alla filer markerade och skriver in "2002" för <guilabel>Datum</guilabel> och väljer "Pop" i kombinationsrutan <guilabel>Genre</guilabel>. För att bara tilldela de här två värdena markeras deras kryssrutor automatiskt och alla andra kryssrutor lämnas omarkerade. Nu ändrar vi markeringen genom att bara markera den första filen och vi ser att alla taggar innehåller rätt värden. De andra filernas taggar kan också verifieras genom att markera dem en i taget. När vi är nöjda med taggarna, använder vi menyalternativet <menuchoice><guimenu>Arkiv</guimenu> <guimenuitem>Spara</guimenuitem></menuchoice> (eller knappen i verktygsraden). Att välja menyalternativet <menuchoice><guimenu>Arkiv</guimenu> <guimenuitem>Skapa spellista</guimenuitem></menuchoice> skapar filen <filename>Dagslända - Låt oss tagga.m3u</filename> i katalogen.

source: Command Reference
it: Guida ai comandi
ru: Список команд
sv: Kommandoreferens

source: The &GUI; Elements
it: Gli elementi della &GUI;
ru: Элементы графического интерфейса
sv: Elementen i det grafiska användargränssnittet

source: The &kid3; &GUI; is separated in six sections: At the left are the file and folder listboxes, the right side contains the <guilabel>File</guilabel>, <guilabel>Tag 1</guilabel>, <guilabel>Tag 2</guilabel> and <guilabel>Tag 3 </guilabel> sections.
it: La &GUI; di &kid3; è separata in sei sezioni. A sinistra ci sono gli elenchi dei file e delle cartelle, a destra le sezioni <guilabel>File</guilabel>, <guilabel>Tag 1</guilabel>, <guilabel>Tag 2</guilabel> e <guilabel>Tag 3</guilabel>.
ru: Графический интерфейс &kid3; состоит из шести разделов: слева расположены списки файлов и каталогов, а справа находятся разделы <guilabel>Файл</guilabel>, <guilabel>Тег 1</guilabel>, <guilabel>Тег 2</guilabel> и <guilabel>Тег 3</guilabel>.
sv: Det grafiska gränssnittet i &kid3; är uppdelat i sex sektioner: Till vänster är fil- och kataloglistrutorna, och till höger finns sektionerna <guilabel>Fil</guilabel>, <guilabel>Tagg 1</guilabel>, <guilabel>Tagg 2</guilabel> och <guilabel>Tagg 3 </guilabel>.

source: To navigate between the different sections using the keyboard, several keyboard shortcuts are supported. In the tag sections, the shortcuts are active while not editing text or when being in the first column.
it: Per navigare tra le diverse sezioni utilizzando la tastiera, sono supportate diverse scorciatoie da tastiera. Nelle sezioni dei tag, le scorciatoie sono attive quando non si modifica il testo o quando si è nella prima colonna.
ru: Определённые комбинации клавиш позволяют перемещаться между разделами с помощью клавиатуры. В разделах тегов комбинации клавиш возможно использовать, если не выполняется редактирование текста или если курсор находится в первом столбце таблицы.
sv: För att navigera mellan de olika sektionerna med tangentbordet, stöds flera snabbtangenter. I taggsektionerna är genvägarna aktiva när inte text redigeras eller när man är i den första kolumnen.

source: <keycombo>&Alt;<keycap>Left</keycap></keycombo>: Go to previous section (<keycombo><keycap>Command</keycap><keycap>[</keycap></keycombo> on &macOS;)
it: <keycombo>&Alt;<keycap>Sinistra</keycap></keycombo>: Vai alla sezione precedente (<keycombo><keycap>Command</keycap><keycap>[</keycap></keycombo> su &macOS;)
ru: <keycombo>&Alt;<keycap>Влево</keycap></keycombo>: перейти к предыдущему разделу (<keycombo><keycap>Command</keycap><keycap>[</keycap></keycombo> в &macOS;)
sv: <keycombo>&Alt;<keycap>Vänsterpil</keycap></keycombo>: Gå till föregående sektion (<keycombo><keycap>Kommando</keycap><keycap>[</keycap></keycombo> på &macOS;)

source: <keycombo>&Alt;<keycap>Right</keycap></keycombo>: Go to next section (<keycombo><keycap>Command</keycap><keycap>]</keycap></keycombo> on &macOS;)
it: <keycombo>&Alt;<keycap>Destra</keycap></keycombo>: Vai alla sezione successiva (<keycombo><keycap>Command</keycap><keycap>]</keycap></keycombo> su &macOS;)
ru: <keycombo>&Alt;<keycap>Вправо</keycap></keycombo>: перейти к следующему разделу (<keycombo><keycap>Command</keycap><keycap>]</keycap></keycombo> в &macOS;)
sv: <keycombo>&Alt;<keycap>Högerpil</keycap></keycombo>: Gå till nästa sektion (<keycombo><keycap>Kommando</keycap><keycap>]</keycap></keycombo> på &macOS;)

source: <keycombo>&Ctrl;<keycap>Shift</keycap><keycap>V</keycap></keycombo>: From other tag
it: <keycombo>&Ctrl;<keycap>Maiusc</keycap><keycap>V</keycap></keycombo>: Da altro tag other tag
ru: <keycombo>&Ctrl;<keycap>Shift</keycap><keycap>V</keycap></keycombo>: из другого тега
sv: <keycombo>&Ctrl;<keycap>Skift</keycap><keycap>V</keycap></keycombo>: Från annan tagg

source: <keycombo>&Ctrl;<keycap>C</keycap></keycombo>: Copy
it: <keycombo>&Ctrl;<keycap>C</keycap></keycombo>: Copiare
ru: <keycombo>&Ctrl;<keycap>C</keycap></keycombo>: копировать
sv: <keycombo>&Ctrl;<keycap>C</keycap></keycombo>: Kopiera

source: <keycombo>&Ctrl;<keycap>V</keycap></keycombo>: Paste
it: <keycombo>&Ctrl;<keycap>V</keycap></keycombo>: Incollare
ru: <keycombo>&Ctrl;<keycap>V</keycap></keycombo>: вставить
sv: <keycombo>&Ctrl;<keycap>V</keycap></keycombo>: Klistra in

source: <keycombo><keycap>Shift</keycap><keycap>Delete</keycap></keycombo>: Remove
it: <keycombo><keycap>Maiusc</keycap><keycap>Canc</keycap></keycombo>: Rimuovere
ru: <keycombo><keycap>Shift</keycap><keycap>Delete</keycap></keycombo>: удалить
sv: <keycombo><keycap>Skift</keycap><keycap>Delete</keycap></keycombo>: Ta bort

source: <keycombo><keycap>F2</keycap></keycombo>: Edit
it: <keycombo><keycap>F2</keycap></keycombo>: Modificare
ru: <keycombo><keycap>F2</keycap></keycombo>: изменить
sv: <keycombo><keycap>F2</keycap></keycombo>: Redigera

source: <keycombo><keycap>Insert</keycap></keycombo>: Add
it: <keycombo><keycap>Insert</keycap></keycombo>: Aggiungere
ru: <keycombo><keycap>Insert</keycap></keycombo>: добавить
sv: <keycombo><keycap>Insert</keycap></keycombo>: Lägg till

source: <keycombo><keycap>Delete</keycap></keycombo>: Delete
it: <keycombo><keycap>Canc</keycap></keycombo>: Eliminare
ru: <keycombo><keycap>Delete</keycap></keycombo>: удалить
sv: <keycombo><keycap>Delete</keycap></keycombo>: Ta bort

source: File List
it: Elenco dei file
ru: Список файлов
sv: Fillista

source: The file list contains the names of all the files in the opened folder which match the selected file name filter (typically <filename class="extension">*.mp3 *.ogg *.opus *.dsf *.flac *.mpc *.aac *.m4a *.m4b *.m4p *.mp4 *.mp2 *.spx *.tta *.wv *.wma *.wav *.aiff *.ape</filename>). A single or multiple files can be selected. To select no file, click into the empty area after the listbox entries. The selection determines the files which are affected by the operations which are available by using the buttons described below.
it: L'elenco dei file contiene i nomi di tutti i file nella cartella aperta che corrispondono al filtro del nome file selezionato (in genere <filename class="extension">*.mp3 *.ogg *.opus *.dsf *.flac *.mpc *.aac *.m4a *.m4b *.m4p *.mp4 *.mp2 *.spx *.tta *.wv *.wma *.wav *.aiff *.ape</filename>). È possibile selezionare uno o più file. Per non selezionare alcun file, fare clic nell'area vuota dopo le voci dell'elenco. La selezione determina i file interessati dalle operazioni disponibili utilizzando i pulsanti descritti di seguito.
ru: Список файлов содержит имена всех файлов в открытом каталоге, которые соответствуют выбранному фильтру имён (обычно это <filename class="extension">*.mp3 *.ogg *.opus *.dsf *.flac *.mpc *.aac *.m4a *.m4b *.m4p *.mp4 *.mp2 *.spx *.tta *.wv *.wma *.wav *.aiff *.ape</filename>). Возможно выбрать один или несколько файлов. Чтобы снять выделение, щёлкните левой кнопкой мыши в пустом месте под пунктами списка. Выделение определяет файлы, над которыми будут выполняться действия после нажатия кнопок, описание которых приводится далее.
sv: Fillistan innehåller namnen på alla filerna i de öppnade katalogerna som motsvarar det valda filnamnsfiltret (oftast <filename class="extension">*.mp3 *.ogg *.opus *.dsf *.flac *.mpc *.aac *.m4a *.m4b *.m4p *.mp4 *.mp2 *.spx *.tta *.wv *.wma *.wav *.aiff *.ape</filename>). En enda eller flera filer kan markeras. För att inte markera någon fil, klicka på det tomma utrymmet efter listrutans poster. Markeringen bestämmer filerna som påverkas av de tillgängliga åtgärderna genom att använda knapparna som beskrivs nedan.

source: Besides <guilabel>Name</guilabel>, also other columns <guilabel>Size</guilabel>, <guilabel>Type</guilabel>, <guilabel>Date Modified</guilabel> with file details can be displayed. Columns can be hidden by unchecking their name in the context menu of the list header. The order of the columns can be changed by drag and drop. The sort order can be toggled by clicking on the column header.
it: Oltre a <guilabel>Nome</guilabel>, è possibile visualizzare anche altre colonne <guilabel>Dimensioni</guilabel>, <guilabel>Tipo</guilabel>, <guilabel>Data modifica</guilabel> con i dettagli del file. Le colonne possono essere nascoste deselezionandone il nome nel menu contestuale dell'intestazione dell'elenco. L'ordine delle colonne può essere modificato tramite trascinamento e rilascio. L'ordinamento può essere attivato facendo clic sull'intestazione della colonna.
ru: Параметры файла отображаются не только в столбце <guilabel>Имя</guilabel>, но и в столбцах <guilabel>Размер</guilabel>, <guilabel>Тип</guilabel>, <guilabel>Дата изменения</guilabel>. Чтобы скрыть эти столбцы, снимите флажок в соответствующем пункте контекстного меню строки заголовков списка. Чтобы изменить порядок столбцов, воспользуйтесь функцией перетаскивания. Порядок сортировки файлов переключается щелчком левой кнопкой мыши по заголовку столбца.
sv: Förutom <guilabel>Namn</guilabel> kan andra kolumner med detaljerad filinformation visas, <guilabel>Storlek</guilabel>, <guilabel>Typ</guilabel> och <guilabel>Ändringsdatum</guilabel>. Kolumner kan döljas genom att avmarkera deras namn i listrubrikens sammanhangsberoende meny. Kolumnordningen kan ändras genom att dra och släppa dem. Sorteringsordningen kan ändras genom att klicka på kolumnrubriken.

source: At the left of the names an icon can be displayed: a disc to show that the file has been modified or information about which tags are present (V1, V2, V1V2 or NO TAG, no icon is displayed if the file has not been read in yet).
it: A sinistra dei nomi può essere visualizzata un'icona: un disco per mostrare che il file è stato modificato o informazioni su quali tag sono presenti (V1, V2, V1V2 o NO TAG, nessuna icona è visualizzata se il file non è ancora stato letto).
ru: Слева от названий может отображаться значок дискеты, указывающий на наличие изменений в файле, либо значок, отображающий информацию о том, какие теги используются (V1, V2, V1V2 или NO TAG; значок не будет отображаться, если чтение данных из файла ещё не было произведено).
sv: Till vänster om namnen kan en ikon visas: en skiva för att visa att filen har ändrats eller information om vilka taggar som finns (V1, V2, V1V2 eller NO TAG). Om filen inte ännu har lästs in visas ingen ikon.

source: Folders are displayed with a folder icon. If a folder is opened, its files are displayed in a hierarchical tree. By selecting files from subfolders, operations can be executed on files in different folders, which is useful if the music collection is organized with a folder for each artist containing folders for albums of this artist.
it: Le cartelle sono visualizzate con un'icona a forma di cartella. Se si apre una cartella, i suoi file vengono visualizzati in un albero gerarchico. Selezionando i file dalle sottocartelle, le operazioni possono essere eseguite su file in cartelle diverse, il che è utile se la raccolta musicale è organizzata con una cartella per ciascun artista contenente cartelle per album di questo artista.
ru: Каталоги отображаются со значком в виде папки. При открытии каталога его содержимое отображается в виде иерархического дерева. При выборе файлов из вложенных каталогов возможно выполнять действия над файлами, которые хранятся в разных каталогах. Это удобно, когда музыкальная коллекция организована так, что каталог каждого исполнителя содержит вложенные каталоги с его альбомами.
sv: Kataloger visas med en katalogikon. Om en katalog är öppnad, visas dess filer i ett hierarkiskt träd. Genom att markera filer i underkataloger, kan åtgärder utföras med filer i olika kataloger, vilket är användbart om musiksamlingen är organiserad med en katalog för varje artist som innehåller kataloger för album av artisten.

source: Clicking the <mousebutton>right</mousebutton> mouse button inside the file list opens a context menu with the following commands:
it: Il clic del tasto <mousebutton>destro</mousebutton> del mouse all'interno dell'elenco dei file apre un menu contestuale con i seguenti comandi:
ru: При щелчке <mousebutton>правой</mousebutton> кнопкой мыши внутри списка файлов появится контекстное меню, содержащее следующие команды:
sv: Genom att klicka med <mousebutton>höger</mousebutton> musknapp inne i fillistan visas en sammanhangsberoende meny med följande kommandon:

source: <guimenuitem>Expand all</guimenuitem>: Expands all folder trees (only the current tree if the <keycap>Shift</keycap> key is pressed)
it: <guimenuitem>Espandi tutto</guimenuitem>: espande tutti gli alberi delle cartelle (solo l'albero attuale se il tasto <keycap>Maiusc</keycap> è premuto)
ru: <guimenuitem>Развернуть все</guimenuitem>: разворачивает всё дерево каталога (при нажатой клавише <keycap>Shift</keycap> развернёт дерево текущего каталога)
sv: <guimenuitem>Expandera alla</guimenuitem>: Expanderar alla katalogträd (bara det aktuella trädet om skifttangenten hålls nere)

source: <guimenuitem>Collapse all</guimenuitem>: Collapses all folder trees
it: <guimenuitem>Contrai tutto</guimenuitem>: contrae l'albero tutti gli alberi delle cartelle
ru: <guimenuitem>Свернуть все</guimenuitem>: сворачивает всё дерево каталога
sv: <guimenuitem>Dra ihop alla</guimenuitem>: Drar ihop alla katalogträd

source: <guimenuitem>Rename</guimenuitem>: Changes the name of a file
it: <guimenuitem>Rinomina</guimenuitem>: cambia il nome di un file
ru: <guimenuitem>Переименовать</guimenuitem>: меняет имя файла
sv: <guimenuitem>Byt namn</guimenuitem>: Byter namn på en fil

source: <guimenuitem>Move to Trash</guimenuitem>: Moves a file to the trash
it: <guimenuitem>Cestina</guimenuitem>: sposta un file nel cestino
ru: <guimenuitem>Переместить в корзину</guimenuitem>: перемещает файл в корзину
sv: <guimenuitem>Flytta till papperskorgen</guimenuitem>: Flyttar en fil till papperskorgen
