Repository: AOSC-Tracking/kid3
Catalog: doc/po/*/kid3.po
Languages: it, ru, sv

source: %D %{seconds} Duration in seconds
it: %D %{seconds} Durata in secondi
ru: %D %{seconds} Длительность в секундах
sv: %D %{seconds} Längd i sekunder

source: %n %{tracks} Number of tracks of the album
it: %n %{tracks} Numero di tracce dell'album
ru: %n %{tracks} Количество дорожек в альбоме
sv: %n %{tracks} Antal spår på albumet

source: %e %{extension} File extension
it: %e %{extension} Estensione del file
ru: %e %{extension} Расширение файла
sv: %e %{extension} Filändelse

source: %O %{tag1} The format of tag 1 (ID3v1.1 or empty if not existing)
it: %O %{tag1} Il formato del tag 1 (ID3v1.1 o vuoto se non esistente)
ru: %O %{tag1} Формат тега 1 (ID3v1.1 или пустое значение, если не существует)
sv: %O %{tag1} Format på tagg 1 (ID3v1.1 eller tom om den inte finns)

source: %o %{tag2} The format of tag 2 (ID3v2.3.0, ID3v2.4.0, ID3v2.2.0, ID3v2.2.1, Vorbis, APE, MP4, ASF, or empty if not existing)
it: %o %{tag2} Il formato del tag 2 (ID3v2.3.0, ID3v2.4.0, ID3v2.2.0, ID3v2.2.1, Vorbis, APE, MP4, ASF, o vuoto se non esistente)
ru: %o %{tag2} Формат тега 2 (ID3v2.3.0, ID3v2.4.0, ID3v2.2.0, ID3v2.2.1, Vorbis, APE, MP4, ASF, или пустое значение, если не существует)
sv: %o %{tag2} Formatet på tagg 2 (ID3v2.3.0, ID3v2.4.0, ID3v2.2.0, ID3v2.2.1, Vorbis, APE, MP4, ASF eller tom om den inte finns)

source: %v %{vbr} VBR or empty (only for ID3v2.3 with id3lib)
it: %v %{vbr} VBR o vuoto (solo per ID3v2.3 con id3lib)
ru: %v %{vbr} Переменная скорость или пустое значение (только для ID3v2.3 с id3lib)
sv: %v %{vbr} VBR eller tom (bara för ID3v2.3 med id3lib)

source: %r %{samplerate} Sample rate in Hz
it: %r %{samplerate} Campionamento in Hz
ru: %r %{samplerate} Частота дискретизации в Гц
sv: %r %{samplerate} Samplingsfrekvens i Hz

source: %m %{mode} Channel mode (Stereo or Joint Stereo)
it: %m %{mode} Modalità canale (stereo o stereo congiunto)
ru: %m %{mode} Режим каналов (cтерео или объединённое стерео)
sv: %m %{mode} Kanalläge (Stereo eller Joint Stereo)

source: %h %{channels} Number of channels (1 or 2)
it: %h %{channels} Numero di canali (1 o 2)
ru: %h %{channels} Количество каналов (1 или 2)
sv: %h %{channels} Antal kanaler (1 eller 2)

source: %k %{codec} Codec (<abbrev>e.g.</abbrev> MPEG 1 Layer 3, MP4, Ogg Vorbis, FLAC, MPC, APE, ASF, AIFF, WAV)
it: %k %{codec} Codificatore (<abbrev>ad es.</abbrev> MPEG 1 Layer 3, MP4, Ogg Vorbis, FLAC, MPC, APE, ASF, AIFF, WAV)
ru: %k %{codec} Кодек (например, MPEG 1 Layer 3, MP4, Ogg Vorbis, FLAC, MPC, APE, ASF, AIFF, WAV)
sv: %k %{codec} Kodare (<abbrev>t.ex.</abbrev> MPEG 1 Layer 3, MP4, Ogg Vorbis, FLAC, MPC, APE, ASF, AIFF, WAV)

source: A few formats are predefined. "CSV unquoted" separates the fields by tabs. Data in this format can be imported again into &kid3; using the import format with the same name. "CSV quoted" additionally encloses the fields by double quotes, which eases the import into spreadsheet applications. However, the fields shall not contain any double quotes when this format is used. "Extended M3U" and "Extended PLS" generate playlists with extended attributes and absolute path names. "HTML" can be used to generate an &HTML; page with hyperlinks to the tracks. "Kover &XML;" creates a file which can be imported by the cover printing program Kover. "Technical Details" provides information about bit rate, sample rate, channels, <abbrev>etc.</abbrev> Finally, "Custom Format" is left empty for definition of a custom format. You can define more formats of your own by adding lines in the file <filename>kid3rc</filename> in the configuration folder. The other formats can be adapted to your needs.
it: Alcuni formati sono predefiniti. «CSV non quotato» separa i campi in schede. I dati in questo formato possono essere nuovamente importati in &kid3; utilizzando il formato di importazione con lo stesso nome. «CSV quotato» racchiude inoltre i campi tra virgolette doppie, facilitando l'importazione in applicazioni per fogli di calcolo. Tuttavia, i campi non devono contenere virgolette doppie quando si utilizza questo formato. «M3U esteso» e «PLS esteso» generano scalette con attributi estesi e nomi di percorso assoluti. «HTML» può essere utilizzato per generare una pagina &HTML; con collegamenti ipertestuali alle tracce. «Kover &XML;» crea un file che può essere importato dal programma di stampa di copertine Kover. «Dettagli tecnici» fornisce informazioni su bit rate, frequenza di campionamento, canali, <abbrev>ecc.</abbrev> Infine, «Formato personalizzato» viene lasciato vuoto per la definizione di un formato personalizzato. È possibile definire più formati personalizzati aggiungendo righe nel file <filename>kid3rc</filename> nella cartella di configurazione. Gli altri formati possono essere adattati alle proprie esigenze.
ru: Предустановлено несколько форматов. В формате «CSV unquoted» поля разделяются символами табуляции. Данные в этом формате возможно снова импортировать в &kid3; с использованием одноимённого формата импорта. В формате «CSV quoted» поля дополнительно заключаются в двойные кавычки, что упрощает импорт в приложения для работы с таблицами. Однако, если используется этот формат, эти поля не должны содержать двойные кавычки. Форматы «Extended M3U» и «Extended PLS» позволяют создавать списки воспроизведения с расширенными атрибутами и абсолютными путями к файлам. Формат «HTML» позволяет создавать &HTML;-страницы с гиперссылками на дорожки. Формат «Kover &XML;» создаёт файл, который возможно импортировать в программу для печати обложек компакт-дисков Kover. Формат «Technical Details» позволяет предоставить информацию о скорости передачи, частоте дискретизации, каналах и так далее. Наконец, пункт «Custom Format» намеренно оставлен пустым для определения пользовательского формата. Дополнительные пользовательские форматы задаются путём добавления строк в файл <filename>kid3rc</filename> в каталоге конфигурации. Остальные форматы возможно изменить в соответствии с потребностями пользователя.
sv: Några få format är fördefinierade. "CSV unquoted" skiljer fälten med tabulatorer. Data med det här formatet kan importeras till &kid3; igen genom att använda importformatet med samma namn. "CSV quoted" omger dessutom fälten med dubbla citationstecken, som förenklar import till kalkylprogram. Dock kan fälten inte innehålla några dubbla citationstecken när det här formatet används. "Extended M3U" och "Extended PLS" genererar spellistor med utökade attribut och absoluta sökvägsnamn. "HTML" kan användas för att generera en &HTML;-sida med hyperlänkar till spår. "Kover &XML;" skapar en fil som kan importeras i omslagsutskriftsprogrammet Kover. "Tekniska detaljer" tillhandahåller information om bithastighet, samplingsfrekvens, kanaler, <abbrev>etc.</abbrev> Till sist, är "Eget format" lämnat tomt för att definiera ett eget format. Du kan definiera fler egna format genom att lägga till rader i filen <filename>kid3rc</filename> i inställningskatalogen. Övriga format kan anpassas efter dina behov.

source: The <guilabel>Source</guilabel> of the tags to generate the export data (<guilabel>Tag 1</guilabel> or <guilabel>Tag 2</guilabel>) can be selected with a combo box. Pushing <guibutton>To File</guibutton> or <guibutton>To Clipboard</guibutton> stores the data in a file or on the clipboard. <guibutton>OK</guibutton> and <guibutton>Cancel</guibutton> close the dialog, whereas <guibutton>OK</guibutton> accepts the current dialog settings.
it: La <guilabel>Fonte</guilabel> dei tag per generare i dati dell'esportazione (<guilabel>Tag 1</guilabel> o <guilabel>Tag 2</guilabel>) può essere selezionata con una casella combinata. Premendo <guibutton>Su file</guibutton> o <guibutton>Negli appunti</guibutton> sono archiviati i dati in un file o negli appunti. <guibutton>OK</guibutton> e <guibutton>Annulla</guibutton> chiudono la finestra, mentre <guibutton>OK</guibutton> accetta le impostazioni della finestra attuale.
ru: <guilabel>Источник</guilabel> тегов для создания экспортируемых данных (<guilabel>Тег 1</guilabel> или <guilabel>Tег 2</guilabel>) выбирается в раскрывающемся списке. Кнопки <guibutton>В файл...</guibutton> или <guibutton>В буфер обмена</guibutton> позволяют поместить данные в файл или буфер обмена. Кнопки <guibutton>OK</guibutton> и <guibutton>Отмена</guibutton> закрывают диалог, при этом кнопка <guibutton>OK</guibutton> позволяет сохранить текущие параметры диалога.
sv: Taggarnas <guilabel>Källa</guilabel> för att generera exportdata (<guilabel>Tagg 1</guilabel> eller <guilabel>Tagg 2</guilabel>) kan väljas med en kombinationsruta. Genom att klicka på <guibutton>Till fil</guibutton> eller <guibutton>Till klippbord</guibutton> lagrar data i en fil eller på klippbordet. <guibutton>Ok</guibutton> och <guibutton>Avbryt</guibutton> stänger dialogrutan, medan <guibutton>Ok</guibutton> accepterar de nuvarande dialoginställningarna.

source: <guimenu>File</guimenu> <guimenuitem>Create Playlist...</guimenuitem>
it: <guimenu>File</guimenu> <guimenuitem>Crea scaletta...</guimenuitem>
ru: <guimenu>Файл</guimenu> <guimenuitem>Создать список воспроизведения...</guimenuitem>
sv: <guimenu>Arkiv</guimenu> <guimenuitem>Skapa spellista...</guimenuitem>

source: <action>Creates a playlist.</action> The format and contents of the playlist can be set by various options.
it: <action>Crea una scaletta.</action> Il formato e il contenuto della scaletta possono essere impostati tramite diverse opzioni.
ru: <action>Создаёт список воспроизведения.</action> Формат и содержимое списка воспроизведения возможно настроить с помощью различных параметров.
sv: <action>Skapar en spellista.</action> Spellistans format och innehåll kan ställas in med diverse alternativ.

source: The name of the playlist can be the <guibutton>Same as folder name</guibutton> or use a <guibutton>Format</guibutton> with values from the tags, <abbrev>e.g.</abbrev> "<userinput>%{artist} - %{album}</userinput>" to have the artist and album name in the playlist file name. The format codes are the same as for <link linkend="export">Export</link>. <guibutton>Create new empty playlist</guibutton> will make an empty playlist with the given name. The extension depends on the playlist format.
it: Il nome della scaletta può essere <guibutton>Come il nome della cartella</guibutton> oppure utilizzare un <guibutton>Formato</guibutton> con i valori dei tag, <abbrev>ad es.</abbrev> «<userinput>%{artist} - %{album}</userinput>» per avere l'artista e il nome dell'album nel nome del file della scaletta. I codici di formato sono gli stessi di <link linkend="export">Esporta</link>. <guibutton>Crea nuova scaletta vuota</guibutton> crea una scaletta vuota con il nome indicato. L'estensione dipende dal formato della scaletta.
sv: Spellistans namn kan vara <guibutton>Samma som katalognamnet</guibutton> eller använd ett <guibutton>Format</guibutton> med värden från taggarna, <abbrev>t.ex.</abbrev> "<userinput>%{artist} - %{album}</userinput>", för att få artist- och albumnamn i spellistans filnamn. Formatkoderna är samma för <link linkend="export">Exportera</link>. <guibutton>Skapa ny tom spellista</guibutton> skapar en tom spellista med angivet namn. Filändelsen beror på spellisteformatet.

source: The location of the generated playlist is determined by the selection of the <guilabel>Create in</guilabel> combo box.
it: La posizione della scaletta generata è determinata dalla selezione della casella combinata <guilabel>Crea in</guilabel>.
ru: Расположение создаваемого списка воспроизведения указывается в раскрывающемся списке <guilabel>Создать в</guilabel>.
sv: Den skapade spellistans plats bestäms av valet i kombinationsrutan <guilabel>Skapa i</guilabel>.

source: Current folder
it: Cartella attuale
ru: Текущем каталоге
sv: Nuvarande katalog

source: The playlist is created in the current folder and contains only files of the current folder. The current folder is the folder where the current file is located. If multiple files are selected, the current file is probably the last selected file.
it: La scaletta viene creata nella cartella attuale e contiene solo i file della cartella attuale. La cartella attuale è la cartella in cui si trova il file attuale. Se sono selezionati più file, il file attuale è probabilmente l'ultimo file selezionato.
ru: Список воспроизведения создаётся в текущем каталоге и содержит только файлы текущего каталога. Текущий каталог — это каталог, в котором расположен текущий файл. Если выделено несколько файлов, текущим файлом, вероятно, будет являться последний выделенный файл.
sv: Spellistan skapas i aktuell katalog och innehåller bara filer från aktuell katalog. Den aktuella katalogen är katalogen där den aktuella filen finns. Om flera filer är markerade, är den aktuella filen troligtvis den senast markerade filen.

source: Every folder
it: Tutte le cartelle
ru: Каждом каталоге
sv: Varje katalog

source: A playlist is created in every folder which contains listed files, and each playlist contains the files of that folder.
it: Una scaletta è creata in ogni cartella che contiene i file elencati, e ogni scaletta contiene i file di quella cartella.
ru: Список воспроизведения создаётся в каждом каталоге, который содержит указанные файлы, и каждый список воспроизведения содержит файлы из соответствующего каталога.
sv: En spellista skapas i varje katalog som innehåller listade filer, och varje spellista innehåller den katalogens filer.

source: Top-level folder
it: Cartella principale
ru: Каталоге верхнего уровня
sv: Toppnivåkatalog

source: Only one playlist is created in the top-level folder (<abbrev>i.e.</abbrev> the folder of the file list) and it contains the listed files of the top-level folder and all of its sub-folders.
it: Viene creata una sola scaletta nella cartella di livello superiore (cioè la cartella dell'elenco file) e contiene i file elencati della cartella di livello superiore e tutte le sue sottocartelle.
ru: Создаётся только один список воспроизведения в каталоге верхнего уровня (то есть в каталоге со списком файлов). Этот список содержит файлы из каталога верхнего уровня и файлы из всех вложенных каталогов.
sv: Bara en spellista skapas i toppnivåkataloger (<abbrev>dvs.</abbrev> fillistans katalog) och den innehåller de listade filerna i toppnivåkatalogen och alla dess underkataloger.

source: The <guilabel>Format</guilabel> of the playlist can be <guilabel>M3U</guilabel>, <guilabel>PLS</guilabel> or <guilabel>XSPF</guilabel>.
it: Il <guilabel>Formato</guilabel> della scaletta può essere <guilabel>M3U</guilabel>, <guilabel>PLS</guilabel> o <guilabel>XSPF</guilabel>.
ru: <guilabel>Формат</guilabel> списка воспроизведения может быть следующим: <guilabel>M3U</guilabel>, <guilabel>PLS</guilabel> или <guilabel>XSPF</guilabel>.
sv: Spellistans <guilabel>format</guilabel> kan vara <guilabel>M3U</guilabel>, <guilabel>PLS</guilabel> eller <guilabel>XSPF</guilabel>.

source: If <guibutton>Include only the selected files</guibutton> is checked, only the selected files will be included in the playlist. If a folder is selected, all of its files are selected. If this check box is not activated, all audio files are included in the playlist.
it: Se è selezionato <guibutton>Includi solo i file selezionati</guibutton>, nella scaletta saranno inclusi solo i file selezionati. Se viene selezionata una cartella, saranno selezionati tutti i suoi file. Se questa casella di controllo non è attivata, tutti i file audio saranno inclusi nella scaletta.
ru: Если установлен флажок <guibutton>Включать только выбранные файлы</guibutton>, в список воспроизведения будут включены только выделенные файлы. Если выделен каталог, будут выделены все файлы, содержащиеся в нём. Если этот флажок не установлен, в список воспроизведения будут включены все аудиофайлы.
sv: Om <guibutton>Inkludera bara de markerade filerna</guibutton> är markerad, inkluderas bara de markerade filerna i spellistan. Om en katalog är markerad, är alla dess filer markerade. Om den här kryssrutan inte är aktiverad, inkluderas alla ljudfiler i spellistan.

source: <guibutton>Sort by file name</guibutton> selects the usual case where the files are ordered by file name. With <guibutton>Sort by tag field</guibutton>, it is possible to sort by a format string with values from tag fields. For instance, "<userinput>%{track.3}</userinput>" can be used to sort by track number (the "<userinput>.3</userinput>" is used to get three digits with leading zeros because strings are used for sorting). It is also possible to use multiple fields, <abbrev>e.g.</abbrev> "<userinput>%{genre}%{year}</userinput>" to sort using a string composed of genre and year.
it: <guibutton>Ordina per nome file</guibutton> seleziona il solito caso in cui i file sono ordinati per nome file. Con <guibutton>Ordina per campo tag</guibutton>, è possibile ordinare in base a una stringa di formato con valori dai campi tag. Ad esempio, «<userinput>%{track.3}</userinput>» può essere utilizzato per ordinare in base al numero di traccia («<userinput>.3</userinput>» viene utilizzato per ottenere tre cifre con zeri iniziali poiché le stringhe sono utilizzate per l'ordinamento). È anche possibile utilizzare più campi, <abbrev>ad es.</abbrev> «<userinput>%{genre}%{year}</userinput>» per ordinare utilizzando una stringa composta da genere e anno.
ru: Параметр <guibutton>Упорядочить по имени файла</guibutton> представляет собой обычный метод сортировки, когда файлы упорядочиваются по имени в алфавитном порядке. Параметр <guibutton>Упорядочить по полю тега</guibutton> позволяет отсортировать файлы по строке формата со значениями из полей тега. Например, «<userinput>%{track.3}</userinput>» позволит упорядочить файлы по номеру дорожки («<userinput>.3</userinput>» используется для получения трёх цифр с нулями в начале, потому что строки используются для сортировки). Также возможно указать несколько полей, например, «<userinput>%{genre}%{year}</userinput>» для сортировки на основе строки с жанром и годом.
sv: <guibutton>Sortera enligt filnamn</guibutton> väljer det vanliga fallet där filerna är ordnade enligt filnamn. Med <guibutton>Sortera enligt taggfält</guibutton>, är det möjligt att sortera enligt en formatsträng med värden från taggfält. Exempelvis kan "<userinput>%{track.3}</userinput>" kan användas för att sortera enligt spårnummer ("<userinput>3</userinput>" används för att få tre siffror med inledande nollor eftersom strängar används vid sortering). Det är också möjligt att använda flera fält, <abbrev>t.ex.</abbrev> "<userinput>%{genre}%{year}</userinput>" för att sortera med användning av en sträng sammansatt av genre och år.

source: The playlist entries will have relative or absolute file paths depending on whether <guibutton>Use relative path for files in playlist</guibutton> or <guibutton>Use full path for files in playlist</guibutton> is set.
it: Le voci della scaletta avranno percorsi di file relativi o assoluti a seconda che sia impostato <guibutton>Usa percorso relativo per i file nella scaletta</guibutton> o <guibutton>Usa percorso completo per i file nella scaletta</guibutton>.
ru: Записи в списке воспроизведения могут содержать относительные или абсолютные пути к файлам в зависимости от того, какой параметр установлен: <guibutton>Использовать относительный путь для файлов в списке воспроизведения</guibutton> или <guibutton>Использовать абсолютный путь для файлов в списке воспроизведения</guibutton>.
sv: Spellisteposterna har relativa eller absoluta filsökvägar beroende på om <guibutton>Använd relativ sökväg för filer i spellista</guibutton> eller <guibutton>Använd fullständig sökväg för filer i spellista</guibutton> är valt.

source: When <guibutton>Write only list of files</guibutton> is set, the playlist will only contain the paths to the files. To generate an extended playlist with additional information, a format string can be set using the <guibutton>Write info using</guibutton> control.
it: Quando è impostato <guibutton>Scrivi solo un elenco di file</guibutton>, la scaletta conterrà solo i percorsi dei file. Per generare una scaletta estesa con informazioni aggiuntive, è possibile impostare una stringa di formato utilizzando il controllo <guibutton>Scrivi informazioni usando</guibutton>.
ru: Когда выбрана опция <guibutton>Записать только список файлов</guibutton>, список воспроизведения будет содержать только пути к файлам. Чтобы создать расширенный список воспроизведения с дополнительной информацией, укажите строку формата с помощью параметра <guibutton>Записать информацию, используя</guibutton>.
sv: När <guibutton>Skriv bara lista med filer</guibutton> är valt, innehåller spellistan bara sökvägarna till filerna. För att skapa en utökad spellista med ytterligare information, kan en formatsträng anges genom att använda alternativet <guibutton>Skriv information med användning av</guibutton>.

source: <shortcut> <keycombo>&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
it: <shortcut> <keycombo>&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Esci</guimenuitem>
ru: <shortcut> <keycombo>&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Файл</guimenu> <guimenuitem>Выход</guimenuitem>
sv: <shortcut> <keycombo>&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Arkiv</guimenu> <guimenuitem>Avsluta</guimenuitem>

source: Quits the application.
it: Chiude l'applicazione.
ru: Закрывает приложение.
sv: Avslutar programmet.

source: The Edit Menu
it: Il menu Modifica
ru: Меню «Правка»
sv: Menyn Redigera

source: <shortcut> <keycombo>&Alt;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
it: <shortcut> <keycombo>&Alt;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Modifica</guimenu> <guimenuitem>Seleziona tutto</guimenuitem>
ru: <shortcut> <keycombo>&Alt;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Правка</guimenu> <guimenuitem>Выделить все</guimenuitem>
sv: <shortcut> <keycombo>&Alt;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Redigera</guimenu> <guimenuitem>Markera alla</guimenuitem>

source: Selects all files.
it: Seleziona tutti i file.
ru: Выделяет все файлы.
sv: Markerar alla filer.

source: <shortcut> <keycombo>&Ctrl;<keycap>Shift</keycap><keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Deselect</guimenuitem>
it: <shortcut> <keycombo>&Ctrl;<keycap>Maiusc</keycap><keycap>A</keycap></keycombo> </shortcut> <guimenu>Modifica</guimenu> <guimenuitem>Deseleziona</guimenuitem>
ru: <shortcut> <keycombo>&Ctrl;<keycap>Shift</keycap><keycap>A</keycap></keycombo> </shortcut> <guimenu>Правка</guimenu> <guimenuitem>Снять выделение</guimenuitem>
sv: <shortcut> <keycombo>&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Redigera</guimenu> <guimenuitem>Avmarkera</guimenuitem>

source: Deselects all files.
it: Deseleziona tutti i file.
ru: Снимает выделение со всех файлов.
sv: Avmarkerar alla filer.

source: <guimenu>Edit</guimenu> <guimenuitem>Select All in Folder</guimenuitem>
it: <guimenu>Modifica</guimenu> <guimenuitem>Seleziona tutti i file nella cartella</guimenuitem>
ru: <guimenu>Правка</guimenu> <guimenuitem>Выбрать все файлы в каталоге</guimenuitem>
sv: <guimenu>Redigera</guimenu> <guimenuitem>Markera alla i katalog</guimenuitem>

source: Selects all files of the current folder.
it: Seleziona tutti i file della cartella attuale.
ru: Выделяет все файлы в текущем каталоге.
sv: Markerar alla filer i den aktuella katalogen.
